*** crates/diffguard-core/src/sensor_api.rs:61:9: delete field rule_metadata from struct SensorReportContext expression in run_sensor

*** mutation diff:
--- crates/diffguard-core/src/sensor_api.rs
+++ delete field rule_metadata from struct SensorReportContext expression in run_sensor
@@ -53,17 +53,17 @@
 ) -> Result<SensorReport, anyhow::Error> {
     // 1. Run the check (substrate currently unused; reserved for future optimization)
     let _ = substrate;
     let check_run = run_check(&settings.plan, &settings.config, &settings.diff_text)?;
 
     // 2. Build rule metadata from config and merge check stats into context
     let rule_metadata = extract_rule_metadata(&settings.config);
     let ctx = SensorReportContext {
-        rule_metadata,
+         /* ~ changed by cargo-mutants ~ */
         truncated_count: check_run.truncated_findings,
         rules_total: check_run.rules_evaluated,
         ..settings.context.clone()
     };
 
     // 3. Convert to sensor report
     Ok(render_sensor_report(&check_run.receipt, &ctx))
 }

---- sensor_api::tests::run_sensor_populates_rule_metadata stdout ----

thread 'sensor_api::tests::run_sensor_populates_rule_metadata' (2164885) panicked at crates/diffguard-core/src/sensor_api.rs:215:9:
assertion `left == right` failed
  left: None
 right: Some("Fix the test pattern")

failures:
    sensor_api::tests::run_sensor_populates_rule_metadata

test result: FAILED. 135 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
