*** crates/diffguard-core/src/xml_utils.rs:15:5: replace escape_xml -> String with "xyzzy".into()

*** mutation diff:
--- crates/diffguard-core/src/xml_utils.rs
+++ replace escape_xml -> String with "xyzzy".into()
@@ -7,35 +7,17 @@
 ///
 /// Handles:
 /// - 5 named XML entities: `&`, `<`, `>`, `"`, `'`
 /// - Illegal control characters (0x00-0x1F except tab/LF/CR) as `&#xNN;` entities
 ///
 /// Legal control characters (tab=0x09, LF=0x0A, CR=0x0D) are preserved as-is
 /// since they are allowed in XML character content.
 pub fn escape_xml(s: &str) -> String {
-    let mut out = String::with_capacity(s.len());
-    for c in s.chars() {
-        match c {
-            '&' => out.push_str("&amp;"),
-            '<' => out.push_str("&lt;"),
-            '>' => out.push_str("&gt;"),
-            '"' => out.push_str("&quot;"),
-            '\'' => out.push_str("&apos;"),
-            // Illegal XML control characters (0x00-0x1F except tab/LF/CR).
-            // These are encoded as hex character references (&#xNN;) to comply with
-            // XML 1.0 specification which forbids most control characters.
-            // Tab (0x09), LF (0x0A), and CR (0x0D) are explicitly allowed.
-            c if c <= '\u{001F}' && c != '\t' && c != '\n' && c != '\r' => {
-                out.push_str(&format!("&#x{:X};", c as u32));
-            }
-            _ => out.push(c),
-        }
-    }
-    out
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
     fn escape_xml_handles_all_special_chars() {

---- checkstyle::tests::escapes_xml_special_characters stdout ----

thread 'checkstyle::tests::escapes_xml_special_characters' (2169197) panicked at crates/diffguard-core/src/checkstyle.rs:168:9:
assertion failed: xml.contains("&amp;")

---- checkstyle::tests::renders_checkstyle_xml_structure stdout ----

thread 'checkstyle::tests::renders_checkstyle_xml_structure' (2169201) panicked at crates/diffguard-core/src/checkstyle.rs:147:9:
assertion failed: xml.contains("  <file name=\"src/main.rs\">")

---- checkstyle::tests::multiple_files_grouped_separately stdout ----

thread 'checkstyle::tests::multiple_files_grouped_separately' (2169200) panicked at crates/diffguard-core/src/checkstyle.rs:263:9:
assertion failed: xml.contains("  <file name=\"src/a.rs\">")

failures:
    checkstyle::tests::escapes_xml_special_characters
    checkstyle::tests::multiple_files_grouped_separately
    checkstyle::tests::renders_checkstyle_xml_structure
    junit::tests::junit_escapes_xml_special_chars
    junit::tests::junit_groups_by_rule_id
    junit::tests::snapshot_junit_with_findings
    xml_utils::tests::escape_xml_empty_string
    xml_utils::tests::escape_xml_escapes_illegal_control_chars
    xml_utils::tests::escape_xml_handles_all_special_chars
    xml_utils::tests::escape_xml_preserves_legal_control_chars

test result: FAILED. 126 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.10s

*** result: Failure(101)
