*** crates/diffguard-core/src/xml_utils.rs:18:13: delete match arm '&' in escape_xml

*** mutation diff:
--- crates/diffguard-core/src/xml_utils.rs
+++ delete match arm '&' in escape_xml
@@ -10,17 +10,17 @@
 /// - Illegal control characters (0x00-0x1F except tab/LF/CR) as `&#xNN;` entities
 ///
 /// Legal control characters (tab=0x09, LF=0x0A, CR=0x0D) are preserved as-is
 /// since they are allowed in XML character content.
 pub fn escape_xml(s: &str) -> String {
     let mut out = String::with_capacity(s.len());
     for c in s.chars() {
         match c {
-            '&' => out.push_str("&amp;"),
+             /* ~ changed by cargo-mutants ~ */
             '<' => out.push_str("&lt;"),
             '>' => out.push_str("&gt;"),
             '"' => out.push_str("&quot;"),
             '\'' => out.push_str("&apos;"),
             // Illegal XML control characters (0x00-0x1F except tab/LF/CR).
             // These are encoded as hex character references (&#xNN;) to comply with
             // XML 1.0 specification which forbids most control characters.
             // Tab (0x09), LF (0x0A), and CR (0x0D) are explicitly allowed.

---- checkstyle::tests::escapes_xml_special_characters stdout ----

thread 'checkstyle::tests::escapes_xml_special_characters' (2170245) panicked at crates/diffguard-core/src/checkstyle.rs:168:9:
assertion failed: xml.contains("&amp;")

---- junit::tests::junit_escapes_xml_special_chars stdout ----

thread 'junit::tests::junit_escapes_xml_special_chars' (2170293) panicked at crates/diffguard-core/src/junit.rs:259:9:
assertion failed: xml.contains("&amp;")

---- xml_utils::tests::escape_xml_handles_all_special_chars stdout ----

thread 'xml_utils::tests::escape_xml_handles_all_special_chars' (2170351) panicked at crates/diffguard-core/src/xml_utils.rs:42:9:
assertion `left == right` failed
  left: "&"
 right: "&amp;"

failures:
    checkstyle::tests::escapes_xml_special_characters
    junit::tests::junit_escapes_xml_special_chars
    xml_utils::tests::escape_xml_handles_all_special_chars

test result: FAILED. 133 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
