*** crates/diffguard-core/src/xml_utils.rs:22:13: delete match arm '\'' in escape_xml

*** mutation diff:
--- crates/diffguard-core/src/xml_utils.rs
+++ delete match arm '\'' in escape_xml
@@ -14,17 +14,17 @@
 pub fn escape_xml(s: &str) -> String {
     let mut out = String::with_capacity(s.len());
     for c in s.chars() {
         match c {
             '&' => out.push_str("&amp;"),
             '<' => out.push_str("&lt;"),
             '>' => out.push_str("&gt;"),
             '"' => out.push_str("&quot;"),
-            '\'' => out.push_str("&apos;"),
+             /* ~ changed by cargo-mutants ~ */
             // Illegal XML control characters (0x00-0x1F except tab/LF/CR).
             // These are encoded as hex character references (&#xNN;) to comply with
             // XML 1.0 specification which forbids most control characters.
             // Tab (0x09), LF (0x0A), and CR (0x0D) are explicitly allowed.
             c if c <= '\u{001F}' && c != '\t' && c != '\n' && c != '\r' => {
                 out.push_str(&format!("&#x{:X};", c as u32));
             }
             _ => out.push(c),

---- checkstyle::tests::escapes_xml_special_characters stdout ----

thread 'checkstyle::tests::escapes_xml_special_characters' (2174396) panicked at crates/diffguard-core/src/checkstyle.rs:172:9:
assertion failed: xml.contains("&apos;")

---- xml_utils::tests::escape_xml_handles_all_special_chars stdout ----

thread 'xml_utils::tests::escape_xml_handles_all_special_chars' (2174503) panicked at crates/diffguard-core/src/xml_utils.rs:46:9:
assertion `left == right` failed
  left: "'"
 right: "&apos;"

failures:
    checkstyle::tests::escapes_xml_special_characters
    xml_utils::tests::escape_xml_handles_all_special_chars

test result: FAILED. 134 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
