*** crates/diffguard-core/src/xml_utils.rs:27:39: replace != with == in escape_xml

*** mutation diff:
--- crates/diffguard-core/src/xml_utils.rs
+++ replace != with == in escape_xml
@@ -19,17 +19,17 @@
             '<' => out.push_str("&lt;"),
             '>' => out.push_str("&gt;"),
             '"' => out.push_str("&quot;"),
             '\'' => out.push_str("&apos;"),
             // Illegal XML control characters (0x00-0x1F except tab/LF/CR).
             // These are encoded as hex character references (&#xNN;) to comply with
             // XML 1.0 specification which forbids most control characters.
             // Tab (0x09), LF (0x0A), and CR (0x0D) are explicitly allowed.
-            c if c <= '\u{001F}' && c != '\t' && c != '\n' && c != '\r' => {
+            c if c <= '\u{001F}' && c == /* ~ changed by cargo-mutants ~ */ '\t' && c != '\n' && c != '\r' => {
                 out.push_str(&format!("&#x{:X};", c as u32));
             }
             _ => out.push(c),
         }
     }
     out
 }

---- xml_utils::tests::escape_xml_preserves_legal_control_chars stdout ----

thread 'xml_utils::tests::escape_xml_preserves_legal_control_chars' (2181815) panicked at crates/diffguard-core/src/xml_utils.rs:71:9:
assertion failed: result.contains('\t')

---- xml_utils::tests::escape_xml_escapes_illegal_control_chars stdout ----

thread 'xml_utils::tests::escape_xml_escapes_illegal_control_chars' (2181813) panicked at crates/diffguard-core/src/xml_utils.rs:55:9:
assertion failed: result.contains("&#x0;")

failures:
    xml_utils::tests::escape_xml_escapes_illegal_control_chars
    xml_utils::tests::escape_xml_preserves_legal_control_chars

test result: FAILED. 134 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
