*** crates/diffguard-core/src/xml_utils.rs:27:47: replace && with || in escape_xml

*** mutation diff:
--- crates/diffguard-core/src/xml_utils.rs
+++ replace && with || in escape_xml
@@ -19,17 +19,17 @@
             '<' => out.push_str("&lt;"),
             '>' => out.push_str("&gt;"),
             '"' => out.push_str("&quot;"),
             '\'' => out.push_str("&apos;"),
             // Illegal XML control characters (0x00-0x1F except tab/LF/CR).
             // These are encoded as hex character references (&#xNN;) to comply with
             // XML 1.0 specification which forbids most control characters.
             // Tab (0x09), LF (0x0A), and CR (0x0D) are explicitly allowed.
-            c if c <= '\u{001F}' && c != '\t' && c != '\n' && c != '\r' => {
+            c if c <= '\u{001F}' && c != '\t' || /* ~ changed by cargo-mutants ~ */ c != '\n' && c != '\r' => {
                 out.push_str(&format!("&#x{:X};", c as u32));
             }
             _ => out.push(c),
         }
     }
     out
 }

---- checkstyle::tests::multiple_files_grouped_separately stdout ----

thread 'checkstyle::tests::multiple_files_grouped_separately' (2178568) panicked at crates/diffguard-core/src/checkstyle.rs:263:9:
assertion failed: xml.contains("  <file name=\"src/a.rs\">")

---- checkstyle::tests::renders_checkstyle_xml_structure stdout ----

thread 'checkstyle::tests::renders_checkstyle_xml_structure' (2178569) panicked at crates/diffguard-core/src/checkstyle.rs:147:9:
assertion failed: xml.contains("  <file name=\"src/main.rs\">")

---- junit::tests::junit_groups_by_rule_id stdout ----

thread 'junit::tests::junit_groups_by_rule_id' (2178617) panicked at crates/diffguard-core/src/junit.rs:224:9:
assertion failed: xml.contains("<testsuite name=\"rust.no_dbg\"")

failures:
    checkstyle::tests::multiple_files_grouped_separately
    checkstyle::tests::renders_checkstyle_xml_structure
    junit::tests::junit_escapes_xml_special_chars
    junit::tests::junit_groups_by_rule_id
    junit::tests::snapshot_junit_with_findings
    xml_utils::tests::escape_xml_handles_all_special_chars
    xml_utils::tests::escape_xml_preserves_legal_control_chars

test result: FAILED. 129 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.12s

*** result: Failure(101)
