*** crates/diffguard-diff/src/unified.rs:134:5: replace parse_unified_diff -> Result<(Vec<DiffLine>, DiffStats), DiffParseError> with Ok((vec![], Default::default()))

*** mutation diff:
--- crates/diffguard-diff/src/unified.rs
+++ replace parse_unified_diff -> Result<(Vec<DiffLine>, DiffStats), DiffParseError> with Ok((vec![], Default::default()))
@@ -126,211 +126,17 @@
 /// - Deleted files: skipped unless `scope = deleted`
 /// - Mode-only changes: skipped (no lines extracted)
 /// - Renamed files: uses the new (destination) path
 /// - Malformed content: continues processing subsequent files
 pub fn parse_unified_diff(
     diff_text: &str,
     scope: Scope,
 ) -> Result<(Vec<DiffLine>, DiffStats), DiffParseError> {
-    let mut out: Vec<DiffLine> = Vec::new();
-    let mut current_path: Option<String> = None;
-
-    let mut old_line_no: u32 = 0;
-    let mut new_line_no: u32 = 0;
-    let mut in_hunk = false;
-
-    // For "changed"/"modified" scopes: treat '+' lines as changed if a '-' was seen
-    // since the last context line.
-    let mut pending_removed = false;
-
-    // Track special file status for the current file
-    let mut skip_current_file = false;
-    let mut rename_to_path: Option<String> = None;
-
-    for raw in diff_text.lines() {
-        if raw.starts_with("diff --git ") {
-            // Reset state for new file
-            in_hunk = false;
-            pending_removed = false;
-            skip_current_file = false;
-            rename_to_path = None;
-
-            // Example: diff --git a/foo b/foo
-            if let Some(p) = parse_diff_git_line(raw) {
-                current_path = Some(p);
-            }
-            continue;
-        }
-
-        // Detect binary files (Requirements 4.1)
-        if is_binary_file(raw) {
-            skip_current_file = true;
-            continue;
-        }
-
-        // Detect submodule changes (Requirements 4.2)
-        if is_submodule(raw) {
-            skip_current_file = true;
-            continue;
-        }
-
-        // Detect deleted files (Requirements 4.5)
-        if is_deleted_file(raw) {
-            skip_current_file = !matches!(scope, Scope::Deleted);
-            continue;
-        }
-
-        // Detect mode changes (Requirements 4.4)
-        // Mode-only changes are skipped - they have no content to scan
-        if is_mode_change_only(raw) {
-            continue;
-        }
-
-        // Detect renamed files (Requirements 4.3)
-        if let Some(to_path) = parse_rename_to(raw) {
-            rename_to_path = Some(to_path);
-            continue;
-        }
-
-        // Skip "rename from" lines (we only care about the destination)
-        if parse_rename_from(raw).is_some() {
-            continue;
-        }
-
-        if raw.starts_with("+++ ") {
-            // Prefer the +++ path if present, unless we have a rename_to path
-            if rename_to_path.is_none() {
-                if let Some(p) = parse_plus_plus_plus(raw) {
-                    current_path = Some(p);
-                }
-            } else {
-                // Use the rename_to path for renamed files
-                current_path = rename_to_path.take();
-            }
-            continue;
-        }
-
-        if raw.starts_with("@@") {
-            if skip_current_file {
-                continue;
-            }
-
-            // Try to parse the hunk header, but continue processing on error (Requirements 4.6)
-            match parse_hunk_header(raw) {
-                Ok(hdr) => {
-                    old_line_no = hdr.old_start;
-                    new_line_no = hdr.new_start;
-                    in_hunk = true;
-                    pending_removed = false;
-                }
-                Err(_) => {
-                    // Malformed hunk header - skip this hunk but continue processing
-                    // This allows subsequent files to be processed (Requirements 4.6)
-                    in_hunk = false;
-                }
-            }
-            continue;
-        }
-
-        // Skip if we're not in a hunk or if the current file should be skipped
-        if !in_hunk || skip_current_file {
-            continue;
-        }
-
-        let Some(path) = current_path.as_deref() else {
-            continue;
-        };
-
-        // Skip file marker lines
-        if raw.starts_with("+++") || raw.starts_with("---") {
-            continue;
-        }
-
-        if raw.starts_with('\\') {
-            // "\\ No newline at end of file"
-            continue;
-        }
-
-        let first = raw.as_bytes().first().copied();
-        match first {
-            Some(b'+') => {
-                // Check if this is a submodule content line (Requirements 4.2)
-                let content = &raw[1..];
-                if is_submodule(content) {
-                    skip_current_file = true;
-                    in_hunk = false;
-                    continue;
-                }
-
-                // Added line.
-                let is_changed = pending_removed;
-                let include = match scope {
-                    Scope::Added => true,
-                    Scope::Changed | Scope::Modified => is_changed,
-                    Scope::Deleted => false,
-                };
-
-                if include {
-                    out.push(DiffLine {
-                        path: path.to_string(),
-                        line: new_line_no,
-                        content: content.to_string(),
-                        kind: if is_changed {
-                            ChangeKind::Changed
-                        } else {
-                            ChangeKind::Added
-                        },
-                    });
-                }
-
-                new_line_no = new_line_no.saturating_add(1);
-            }
-            Some(b'-') => {
-                // Check if this is a submodule content line (Requirements 4.2)
-                let content = &raw[1..];
-                if is_submodule(content) {
-                    skip_current_file = true;
-                    in_hunk = false;
-                    continue;
-                }
-
-                // Removed line.
-                if matches!(scope, Scope::Deleted) {
-                    out.push(DiffLine {
-                        path: path.to_string(),
-                        line: old_line_no,
-                        content: content.to_string(),
-                        kind: ChangeKind::Deleted,
-                    });
-                }
-                pending_removed = true;
-                old_line_no = old_line_no.saturating_add(1);
-            }
-            Some(b' ') => {
-                // Context line.
-                pending_removed = false;
-                old_line_no = old_line_no.saturating_add(1);
-                new_line_no = new_line_no.saturating_add(1);
-            }
-            _ => {}
-        }
-    }
-
-    let mut files = std::collections::BTreeSet::<String>::new();
-    for l in &out {
-        files.insert(l.path.clone());
-    }
-
-    let stats = DiffStats {
-        files: files.len() as u32,
-        lines: out.len() as u32,
-    };
-
-    Ok((out, stats))
+    Ok((vec![], Default::default())) /* ~ changed by cargo-mutants ~ */
 }
 
 #[derive(Debug, Clone, Copy, PartialEq, Eq)]
 struct HunkHeader {
     old_start: u32,
     new_start: u32,
 }

---- unified::tests::continues_after_malformed_hunk_header stdout ----

thread 'unified::tests::continues_after_malformed_hunk_header' (781513) panicked at crates/diffguard-diff/src/unified.rs:1035:9:
assertion `left == right` failed
  left: 0
 right: 1

---- unified::tests::binary_file_added_from_dev_null stdout ----

thread 'unified::tests::binary_file_added_from_dev_null' (781512) panicked at crates/diffguard-diff/src/unified.rs:1109:9:
assertion `left == right` failed
  left: 0
 right: 1

---- unified::tests::deleted_scope_includes_deleted_files stdout ----

thread 'unified::tests::deleted_scope_includes_deleted_files' (781514) panicked at crates/diffguard-diff/src/unified.rs:908:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    unified::tests::binary_file_added_from_dev_null
    unified::tests::continues_after_malformed_hunk_header
    unified::tests::deleted_scope_includes_deleted_files
    unified::tests::handles_mixed_unicode_and_ascii
    unified::tests::handles_multiple_special_cases_in_one_diff
    unified::tests::handles_unicode_emojis_in_diff
    unified::tests::handles_unicode_in_added_lines
    unified::tests::handles_unicode_in_changed_lines
    unified::tests::handles_unicode_in_file_paths
    unified::tests::handles_unicode_special_characters
    unified::tests::ignores_lines_outside_hunks
    unified::tests::parses_added_lines

test result: FAILED. 37 passed; 25 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
