*** crates/diffguard-diff/src/unified.rs:178:33: delete ! in parse_unified_diff

*** mutation diff:
--- crates/diffguard-diff/src/unified.rs
+++ delete ! in parse_unified_diff
@@ -170,17 +170,17 @@
         // Detect submodule changes (Requirements 4.2)
         if is_submodule(raw) {
             skip_current_file = true;
             continue;
         }
 
         // Detect deleted files (Requirements 4.5)
         if is_deleted_file(raw) {
-            skip_current_file = !matches!(scope, Scope::Deleted);
+            skip_current_file =  /* ~ changed by cargo-mutants ~ */matches!(scope, Scope::Deleted);
             continue;
         }
 
         // Detect mode changes (Requirements 4.4)
         // Mode-only changes are skipped - they have no content to scan
         if is_mode_change_only(raw) {
             continue;
         }

---- unified::tests::deleted_scope_includes_deleted_files stdout ----

thread 'unified::tests::deleted_scope_includes_deleted_files' (781899) panicked at crates/diffguard-diff/src/unified.rs:1102:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    unified::tests::deleted_scope_includes_deleted_files

test result: FAILED. 61 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
