*** crates/diffguard-diff/src/unified.rs:235:12: delete ! in parse_unified_diff

*** mutation diff:
--- crates/diffguard-diff/src/unified.rs
+++ delete ! in parse_unified_diff
@@ -227,17 +227,17 @@
                     // This allows subsequent files to be processed (Requirements 4.6)
                     in_hunk = false;
                 }
             }
             continue;
         }
 
         // Skip if we're not in a hunk or if the current file should be skipped
-        if !in_hunk || skip_current_file {
+        if  /* ~ changed by cargo-mutants ~ */in_hunk || skip_current_file {
             continue;
         }
 
         let Some(path) = current_path.as_deref() else {
             continue;
         };
 
         // Skip file marker lines

---- unified::tests::binary_file_added_from_dev_null stdout ----

thread 'unified::tests::binary_file_added_from_dev_null' (782643) panicked at crates/diffguard-diff/src/unified.rs:1303:9:
assertion `left == right` failed
  left: 0
 right: 1

---- unified::tests::deleted_scope_includes_deleted_files stdout ----

thread 'unified::tests::deleted_scope_includes_deleted_files' (782645) panicked at crates/diffguard-diff/src/unified.rs:1102:9:
assertion `left == right` failed
  left: 0
 right: 1

---- unified::tests::continues_after_malformed_hunk_header stdout ----

thread 'unified::tests::continues_after_malformed_hunk_header' (782644) panicked at crates/diffguard-diff/src/unified.rs:1231:9:
assertion `left == right` failed
  left: "bad.rs"
 right: "good.rs"

failures:
    unified::tests::binary_file_added_from_dev_null
    unified::tests::continues_after_malformed_hunk_header
    unified::tests::deleted_scope_includes_deleted_files
    unified::tests::handles_mixed_unicode_and_ascii
    unified::tests::handles_multiple_special_cases_in_one_diff
    unified::tests::handles_unicode_emojis_in_diff
    unified::tests::handles_unicode_in_added_lines
    unified::tests::handles_unicode_in_changed_lines
    unified::tests::handles_unicode_in_file_paths
    unified::tests::handles_unicode_special_characters
    unified::tests::ignores_lines_outside_hunks
    unified::tests::parses_added_lines

test result: FAILED. 37 passed; 25 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
