*** crates/diffguard-diff/src/unified.rs:235:21: replace || with && in parse_unified_diff

*** mutation diff:
--- crates/diffguard-diff/src/unified.rs
+++ replace || with && in parse_unified_diff
@@ -227,17 +227,17 @@
                     // This allows subsequent files to be processed (Requirements 4.6)
                     in_hunk = false;
                 }
             }
             continue;
         }
 
         // Skip if we're not in a hunk or if the current file should be skipped
-        if !in_hunk || skip_current_file {
+        if !in_hunk && /* ~ changed by cargo-mutants ~ */ skip_current_file {
             continue;
         }
 
         let Some(path) = current_path.as_deref() else {
             continue;
         };
 
         // Skip file marker lines

---- unified::tests::continues_after_malformed_hunk_header stdout ----

thread 'unified::tests::continues_after_malformed_hunk_header' (782271) panicked at crates/diffguard-diff/src/unified.rs:1229:9:
assertion `left == right` failed
  left: 2
 right: 1

---- unified::tests::ignores_lines_outside_hunks stdout ----

thread 'unified::tests::ignores_lines_outside_hunks' (782284) panicked at crates/diffguard-diff/src/unified.rs:1189:9:
assertion `left == right` failed
  left: 2
 right: 1

failures:
    unified::tests::continues_after_malformed_hunk_header
    unified::tests::ignores_lines_outside_hunks

test result: FAILED. 60 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
