*** crates/diffguard-diff/src/unified.rs:244:35: replace || with && in parse_unified_diff

*** mutation diff:
--- crates/diffguard-diff/src/unified.rs
+++ replace || with && in parse_unified_diff
@@ -236,17 +236,17 @@
             continue;
         }
 
         let Some(path) = current_path.as_deref() else {
             continue;
         };
 
         // Skip file marker lines
-        if raw.starts_with("+++") || raw.starts_with("---") {
+        if raw.starts_with("+++") && /* ~ changed by cargo-mutants ~ */ raw.starts_with("---") {
             continue;
         }
 
         if raw.starts_with('\\') {
             // "\\ No newline at end of file"
             continue;
         }

---- unified::tests::skips_file_markers_inside_hunks stdout ----

thread 'unified::tests::skips_file_markers_inside_hunks' (783065) panicked at crates/diffguard-diff/src/unified.rs:1207:9:
assertion `left == right` failed
  left: 2
 right: 1

failures:
    unified::tests::skips_file_markers_inside_hunks

test result: FAILED. 61 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
