*** crates/diffguard-diff/src/unified.rs:24:39: replace && with || in is_binary_file

*** mutation diff:
--- crates/diffguard-diff/src/unified.rs
+++ replace && with || in is_binary_file
@@ -16,17 +16,17 @@
 /// Detects if a line indicates a binary file in the diff.
 ///
 /// Binary files are marked with lines like:
 /// - "Binary files a/foo.png and b/foo.png differ"
 /// - "Binary files /dev/null and b/foo.png differ"
 ///
 /// Requirements: 4.1
 pub fn is_binary_file(line: &str) -> bool {
-    line.starts_with("Binary files ") && line.contains(" differ")
+    line.starts_with("Binary files ") || /* ~ changed by cargo-mutants ~ */ line.contains(" differ")
 }
 
 /// Detects if a line indicates a submodule change.
 ///
 /// Submodule changes are marked with lines like:
 /// - "Subproject commit abc123..."
 ///
 /// Requirements: 4.2

---- unified::tests::is_binary_file_rejects_non_binary_lines stdout ----

thread 'unified::tests::is_binary_file_rejects_non_binary_lines' (775580) panicked at crates/diffguard-diff/src/unified.rs:757:9:
assertion failed: !is_binary_file("Some binary files differ")

failures:
    unified::tests::is_binary_file_rejects_non_binary_lines

test result: FAILED. 61 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
