*** crates/diffguard-diff/src/unified.rs:24:5: replace is_binary_file -> bool with true

*** mutation diff:
--- crates/diffguard-diff/src/unified.rs
+++ replace is_binary_file -> bool with true
@@ -16,17 +16,17 @@
 /// Detects if a line indicates a binary file in the diff.
 ///
 /// Binary files are marked with lines like:
 /// - "Binary files a/foo.png and b/foo.png differ"
 /// - "Binary files /dev/null and b/foo.png differ"
 ///
 /// Requirements: 4.1
 pub fn is_binary_file(line: &str) -> bool {
-    line.starts_with("Binary files ") && line.contains(" differ")
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 /// Detects if a line indicates a submodule change.
 ///
 /// Submodule changes are marked with lines like:
 /// - "Subproject commit abc123..."
 ///
 /// Requirements: 4.2

---- unified::tests::continues_after_malformed_hunk_header stdout ----

thread 'unified::tests::continues_after_malformed_hunk_header' (774819) panicked at crates/diffguard-diff/src/unified.rs:1229:9:
assertion `left == right` failed
  left: 0
 right: 1

---- unified::tests::handles_mixed_unicode_and_ascii stdout ----

thread 'unified::tests::handles_mixed_unicode_and_ascii' (774824) panicked at crates/diffguard-diff/src/unified.rs:1619:9:
assertion `left == right` failed
  left: 0
 right: 1

---- unified::tests::deleted_scope_includes_deleted_files stdout ----

thread 'unified::tests::deleted_scope_includes_deleted_files' (774820) panicked at crates/diffguard-diff/src/unified.rs:1102:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    unified::tests::binary_file_added_from_dev_null
    unified::tests::continues_after_malformed_hunk_header
    unified::tests::deleted_scope_includes_deleted_files
    unified::tests::handles_mixed_unicode_and_ascii
    unified::tests::handles_multiple_special_cases_in_one_diff
    unified::tests::handles_unicode_emojis_in_diff
    unified::tests::handles_unicode_in_added_lines
    unified::tests::handles_unicode_in_changed_lines
    unified::tests::handles_unicode_in_file_paths
    unified::tests::handles_unicode_special_characters
    unified::tests::ignores_lines_outside_hunks
    unified::tests::is_binary_file_rejects_non_binary_lines

test result: FAILED. 36 passed; 26 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
