*** crates/diffguard-diff/src/unified.rs:24:5: replace is_binary_file -> bool with false

*** mutation diff:
--- crates/diffguard-diff/src/unified.rs
+++ replace is_binary_file -> bool with false
@@ -16,17 +16,17 @@
 /// Detects if a line indicates a binary file in the diff.
 ///
 /// Binary files are marked with lines like:
 /// - "Binary files a/foo.png and b/foo.png differ"
 /// - "Binary files /dev/null and b/foo.png differ"
 ///
 /// Requirements: 4.1
 pub fn is_binary_file(line: &str) -> bool {
-    line.starts_with("Binary files ") && line.contains(" differ")
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 /// Detects if a line indicates a submodule change.
 ///
 /// Submodule changes are marked with lines like:
 /// - "Subproject commit abc123..."
 ///
 /// Requirements: 4.2

---- unified::tests::is_binary_file_detects_binary_markers stdout ----

thread 'unified::tests::is_binary_file_detects_binary_markers' (775206) panicked at crates/diffguard-diff/src/unified.rs:739:9:
assertion failed: is_binary_file("Binary files a/image.png and b/image.png differ")

failures:
    unified::tests::is_binary_file_detects_binary_markers

test result: FAILED. 61 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
