*** crates/diffguard-diff/src/unified.rs:255:13: delete match arm Some(b'+') in parse_unified_diff

*** mutation diff:
--- crates/diffguard-diff/src/unified.rs
+++ delete match arm Some(b'+') in parse_unified_diff
@@ -247,48 +247,17 @@
 
         if raw.starts_with('\\') {
             // "\\ No newline at end of file"
             continue;
         }
 
         let first = raw.as_bytes().first().copied();
         match first {
-            Some(b'+') => {
-                // Check if this is a submodule content line (Requirements 4.2)
-                let content = &raw[1..];
-                if is_submodule(content) {
-                    skip_current_file = true;
-                    in_hunk = false;
-                    continue;
-                }
-
-                // Added line.
-                let is_changed = pending_removed;
-                let include = match scope {
-                    Scope::Added => true,
-                    Scope::Changed | Scope::Modified => is_changed,
-                    Scope::Deleted => false,
-                };
-
-                if include {
-                    out.push(DiffLine {
-                        path: path.to_string(),
-                        line: new_line_no,
-                        content: content.to_string(),
-                        kind: if is_changed {
-                            ChangeKind::Changed
-                        } else {
-                            ChangeKind::Added
-                        },
-                    });
-                }
-
-                new_line_no = new_line_no.saturating_add(1);
-            }
+             /* ~ changed by cargo-mutants ~ */
             Some(b'-') => {
                 // Check if this is a submodule content line (Requirements 4.2)
                 let content = &raw[1..];
                 if is_submodule(content) {
                     skip_current_file = true;
                     in_hunk = false;
                     continue;
                 }

---- unified::tests::binary_file_added_from_dev_null stdout ----

thread 'unified::tests::binary_file_added_from_dev_null' (783389) panicked at crates/diffguard-diff/src/unified.rs:1272:9:
assertion `left == right` failed
  left: 0
 right: 1

---- unified::tests::handles_multiple_special_cases_in_one_diff stdout ----

thread 'unified::tests::handles_multiple_special_cases_in_one_diff' (783397) panicked at crates/diffguard-diff/src/unified.rs:1242:9:
assertion `left == right` failed
  left: 0
 right: 2

---- unified::tests::handles_mixed_unicode_and_ascii stdout ----

thread 'unified::tests::handles_mixed_unicode_and_ascii' (783395) panicked at crates/diffguard-diff/src/unified.rs:1588:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    unified::tests::binary_file_added_from_dev_null
    unified::tests::continues_after_malformed_hunk_header
    unified::tests::handles_mixed_unicode_and_ascii
    unified::tests::handles_multiple_special_cases_in_one_diff
    unified::tests::handles_unicode_emojis_in_diff
    unified::tests::handles_unicode_in_added_lines
    unified::tests::handles_unicode_in_changed_lines
    unified::tests::handles_unicode_in_file_paths
    unified::tests::handles_unicode_special_characters
    unified::tests::ignores_lines_outside_hunks
    unified::tests::parses_added_lines
    unified::tests::parses_changed_lines_only_when_requested

test result: FAILED. 39 passed; 23 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
