*** crates/diffguard-diff/src/unified.rs:287:13: delete match arm Some(b'-') in parse_unified_diff

*** mutation diff:
--- crates/diffguard-diff/src/unified.rs
+++ delete match arm Some(b'-') in parse_unified_diff
@@ -279,37 +279,17 @@
                         } else {
                             ChangeKind::Added
                         },
                     });
                 }
 
                 new_line_no = new_line_no.saturating_add(1);
             }
-            Some(b'-') => {
-                // Check if this is a submodule content line (Requirements 4.2)
-                let content = &raw[1..];
-                if is_submodule(content) {
-                    skip_current_file = true;
-                    in_hunk = false;
-                    continue;
-                }
-
-                // Removed line.
-                if matches!(scope, Scope::Deleted) {
-                    out.push(DiffLine {
-                        path: path.to_string(),
-                        line: old_line_no,
-                        content: content.to_string(),
-                        kind: ChangeKind::Deleted,
-                    });
-                }
-                pending_removed = true;
-                old_line_no = old_line_no.saturating_add(1);
-            }
+             /* ~ changed by cargo-mutants ~ */
             Some(b' ') => {
                 // Context line.
                 pending_removed = false;
                 old_line_no = old_line_no.saturating_add(1);
                 new_line_no = new_line_no.saturating_add(1);
             }
             _ => {}
         }

---- unified::tests::deleted_scope_includes_deleted_files stdout ----

thread 'unified::tests::deleted_scope_includes_deleted_files' (783764) panicked at crates/diffguard-diff/src/unified.rs:1082:9:
assertion `left == right` failed
  left: 0
 right: 1

---- unified::tests::handles_unicode_in_changed_lines stdout ----

thread 'unified::tests::handles_unicode_in_changed_lines' (783773) panicked at crates/diffguard-diff/src/unified.rs:1621:9:
assertion `left == right` failed
  left: 0
 right: 1

---- unified::tests::parses_changed_lines_only_when_requested stdout ----

thread 'unified::tests::parses_changed_lines_only_when_requested' (783802) panicked at crates/diffguard-diff/src/unified.rs:573:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    unified::tests::deleted_scope_includes_deleted_files
    unified::tests::handles_unicode_in_changed_lines
    unified::tests::parses_changed_lines_only_when_requested
    unified::tests::parses_deleted_lines_when_requested

test result: FAILED. 58 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
