*** crates/diffguard-diff/src/unified.rs:308:13: delete match arm Some(b' ') in parse_unified_diff

*** mutation diff:
--- crates/diffguard-diff/src/unified.rs
+++ delete match arm Some(b' ') in parse_unified_diff
@@ -300,22 +300,17 @@
                         line: old_line_no,
                         content: content.to_string(),
                         kind: ChangeKind::Deleted,
                     });
                 }
                 pending_removed = true;
                 old_line_no = old_line_no.saturating_add(1);
             }
-            Some(b' ') => {
-                // Context line.
-                pending_removed = false;
-                old_line_no = old_line_no.saturating_add(1);
-                new_line_no = new_line_no.saturating_add(1);
-            }
+             /* ~ changed by cargo-mutants ~ */
             _ => {}
         }
     }
 
     let mut files = std::collections::BTreeSet::<String>::new();
     for l in &out {
         files.insert(l.path.clone());
     }

---- unified::tests::parses_deleted_lines_when_requested stdout ----

thread 'unified::tests::parses_deleted_lines_when_requested' (784176) panicked at crates/diffguard-diff/src/unified.rs:645:9:
assertion `left == right` failed
  left: 1
 right: 2

---- unified::tests::parses_multiple_files_with_multiple_hunks_each stdout ----

thread 'unified::tests::parses_multiple_files_with_multiple_hunks_each' (784179) panicked at crates/diffguard-diff/src/unified.rs:1456:9:
assertion failed: a_lines.iter().any(|l| l.content == "fn a2() {}" && l.line == 2)

---- unified::tests::parses_multiple_files_in_single_diff stdout ----

thread 'unified::tests::parses_multiple_files_in_single_diff' (784177) panicked at crates/diffguard-diff/src/unified.rs:1413:9:
assertion `left == right` failed
  left: 1
 right: 2

failures:
    unified::tests::parses_added_lines
    unified::tests::parses_deleted_lines_when_requested
    unified::tests::parses_multiple_files_in_single_diff
    unified::tests::parses_multiple_files_with_multiple_hunks_each

test result: FAILED. 58 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
