*** crates/diffguard-diff/src/unified.rs:34:5: replace is_submodule -> bool with true

*** mutation diff:
--- crates/diffguard-diff/src/unified.rs
+++ replace is_submodule -> bool with true
@@ -26,17 +26,17 @@
 
 /// Detects if a line indicates a submodule change.
 ///
 /// Submodule changes are marked with lines like:
 /// - "Subproject commit abc123..."
 ///
 /// Requirements: 4.2
 pub fn is_submodule(line: &str) -> bool {
-    line.starts_with("Subproject commit ")
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 /// Detects if a line indicates a deleted file mode.
 ///
 /// Deleted files are marked with lines like:
 /// - "deleted file mode 100644"
 ///
 /// Requirements: 4.5

---- unified::tests::binary_file_added_from_dev_null stdout ----

thread 'unified::tests::binary_file_added_from_dev_null' (775937) panicked at crates/diffguard-diff/src/unified.rs:1303:9:
assertion `left == right` failed
  left: 0
 right: 1

---- unified::tests::continues_after_malformed_hunk_header stdout ----

thread 'unified::tests::continues_after_malformed_hunk_header' (775938) panicked at crates/diffguard-diff/src/unified.rs:1229:9:
assertion `left == right` failed
  left: 0
 right: 1

---- unified::tests::deleted_scope_includes_deleted_files stdout ----

thread 'unified::tests::deleted_scope_includes_deleted_files' (775939) panicked at crates/diffguard-diff/src/unified.rs:1102:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    unified::tests::binary_file_added_from_dev_null
    unified::tests::continues_after_malformed_hunk_header
    unified::tests::deleted_scope_includes_deleted_files
    unified::tests::handles_mixed_unicode_and_ascii
    unified::tests::handles_multiple_special_cases_in_one_diff
    unified::tests::handles_unicode_emojis_in_diff
    unified::tests::handles_unicode_in_added_lines
    unified::tests::handles_unicode_in_changed_lines
    unified::tests::handles_unicode_in_file_paths
    unified::tests::handles_unicode_special_characters
    unified::tests::ignores_lines_outside_hunks
    unified::tests::is_submodule_rejects_non_submodule_lines

test result: FAILED. 36 passed; 26 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
