*** crates/diffguard-diff/src/unified.rs:34:5: replace is_submodule -> bool with false

*** mutation diff:
--- crates/diffguard-diff/src/unified.rs
+++ replace is_submodule -> bool with false
@@ -26,17 +26,17 @@
 
 /// Detects if a line indicates a submodule change.
 ///
 /// Submodule changes are marked with lines like:
 /// - "Subproject commit abc123..."
 ///
 /// Requirements: 4.2
 pub fn is_submodule(line: &str) -> bool {
-    line.starts_with("Subproject commit ")
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 /// Detects if a line indicates a deleted file mode.
 ///
 /// Deleted files are marked with lines like:
 /// - "deleted file mode 100644"
 ///
 /// Requirements: 4.5

---- unified::tests::handles_multiple_special_cases_in_one_diff stdout ----

thread 'unified::tests::handles_multiple_special_cases_in_one_diff' (776318) panicked at crates/diffguard-diff/src/unified.rs:1273:9:
assertion `left == right` failed
  left: 3
 right: 2

---- unified::tests::is_submodule_detects_submodule_commits stdout ----

thread 'unified::tests::is_submodule_detects_submodule_commits' (776333) panicked at crates/diffguard-diff/src/unified.rs:763:9:
assertion failed: is_submodule("Subproject commit abc123def456")

---- unified::tests::skips_submodule_changes stdout ----

thread 'unified::tests::skips_submodule_changes' (776363) panicked at crates/diffguard-diff/src/unified.rs:1053:9:
assertion `left == right` failed
  left: 2
 right: 1

failures:
    unified::tests::handles_multiple_special_cases_in_one_diff
    unified::tests::is_submodule_detects_submodule_commits
    unified::tests::skips_submodule_changes
    unified::tests::skips_submodule_line_inside_hunk

test result: FAILED. 58 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
