*** crates/diffguard-diff/src/unified.rs:364:5: replace parse_hunk_range_start -> Result<u32, DiffParseError> with Ok(0)

*** mutation diff:
--- crates/diffguard-diff/src/unified.rs
+++ replace parse_hunk_range_start -> Result<u32, DiffParseError> with Ok(0)
@@ -356,23 +356,17 @@
     })
 }
 
 fn parse_hunk_range_start(
     token: &str,
     expected_prefix: char,
     full_line: &str,
 ) -> Result<u32, DiffParseError> {
-    let range = token
-        .strip_prefix(expected_prefix)
-        .ok_or_else(|| DiffParseError::MalformedHunkHeader(full_line.to_string()))?;
-    let start_str = range.split(',').next().unwrap_or(range);
-    start_str
-        .parse()
-        .map_err(|_| DiffParseError::MalformedHunkHeader(full_line.to_string()))
+    Ok(0) /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_diff_git_line(line: &str) -> Option<String> {
     // diff --git a/foo b/foo
     let rest = line.strip_prefix("diff --git ")?;
     let tokens = tokenize_git_paths(rest, 2);
     if tokens.len() < 2 {
         return None;

---- unified::tests::continues_after_malformed_hunk_header stdout ----

thread 'unified::tests::continues_after_malformed_hunk_header' (784521) panicked at crates/diffguard-diff/src/unified.rs:1223:9:
assertion `left == right` failed
  left: 2
 right: 1

---- unified::tests::deleted_scope_includes_deleted_files stdout ----

thread 'unified::tests::deleted_scope_includes_deleted_files' (784522) panicked at crates/diffguard-diff/src/unified.rs:1098:9:
assertion `left == right` failed
  left: 0
 right: 1

---- unified::tests::parse_hunk_header_rejects_non_numeric_start stdout ----

thread 'unified::tests::parse_hunk_header_rejects_non_numeric_start' (784549) panicked at crates/diffguard-diff/src/unified.rs:946:56:
called `Result::unwrap_err()` on an `Ok` value: HunkHeader { old_start: 0, new_start: 0 }

failures:
    unified::tests::continues_after_malformed_hunk_header
    unified::tests::deleted_scope_includes_deleted_files
    unified::tests::parse_hunk_header_rejects_non_numeric_start
    unified::tests::parses_added_lines
    unified::tests::parses_deleted_lines_when_requested
    unified::tests::parses_multiple_files_in_single_diff
    unified::tests::parses_multiple_files_with_multiple_hunks_each

test result: FAILED. 55 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
