*** crates/diffguard-diff/src/unified.rs:364:5: replace parse_hunk_range_start -> Result<u32, DiffParseError> with Ok(1)

*** mutation diff:
--- crates/diffguard-diff/src/unified.rs
+++ replace parse_hunk_range_start -> Result<u32, DiffParseError> with Ok(1)
@@ -356,23 +356,17 @@
     })
 }
 
 fn parse_hunk_range_start(
     token: &str,
     expected_prefix: char,
     full_line: &str,
 ) -> Result<u32, DiffParseError> {
-    let range = token
-        .strip_prefix(expected_prefix)
-        .ok_or_else(|| DiffParseError::MalformedHunkHeader(full_line.to_string()))?;
-    let start_str = range.split(',').next().unwrap_or(range);
-    start_str
-        .parse()
-        .map_err(|_| DiffParseError::MalformedHunkHeader(full_line.to_string()))
+    Ok(1) /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_diff_git_line(line: &str) -> Option<String> {
     // diff --git a/foo b/foo
     let rest = line.strip_prefix("diff --git ")?;
     let tokens = tokenize_git_paths(rest, 2);
     if tokens.len() < 2 {
         return None;

---- unified::tests::continues_after_malformed_hunk_header stdout ----

thread 'unified::tests::continues_after_malformed_hunk_header' (784894) panicked at crates/diffguard-diff/src/unified.rs:1223:9:
assertion `left == right` failed
  left: 2
 right: 1

---- unified::tests::parse_hunk_header_rejects_non_numeric_start stdout ----

thread 'unified::tests::parse_hunk_header_rejects_non_numeric_start' (784922) panicked at crates/diffguard-diff/src/unified.rs:946:56:
called `Result::unwrap_err()` on an `Ok` value: HunkHeader { old_start: 1, new_start: 1 }

---- unified::tests::parses_multiple_files_with_multiple_hunks_each stdout ----

thread 'unified::tests::parses_multiple_files_with_multiple_hunks_each' (784937) panicked at crates/diffguard-diff/src/unified.rs:1460:9:
assertion failed: a_lines.iter().any(|l| l.content == "fn a11() {}" && l.line == 12)

failures:
    unified::tests::continues_after_malformed_hunk_header
    unified::tests::parse_hunk_header_rejects_non_numeric_start
    unified::tests::parses_multiple_files_with_multiple_hunks_each

test result: FAILED. 59 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
