*** crates/diffguard-diff/src/unified.rs:375:5: replace parse_diff_git_line -> Option<String> with None

*** mutation diff:
--- crates/diffguard-diff/src/unified.rs
+++ replace parse_diff_git_line -> Option<String> with None
@@ -367,23 +367,17 @@
     let start_str = range.split(',').next().unwrap_or(range);
     start_str
         .parse()
         .map_err(|_| DiffParseError::MalformedHunkHeader(full_line.to_string()))
 }
 
 fn parse_diff_git_line(line: &str) -> Option<String> {
     // diff --git a/foo b/foo
-    let rest = line.strip_prefix("diff --git ")?;
-    let tokens = tokenize_git_paths(rest, 2);
-    if tokens.len() < 2 {
-        return None;
-    }
-    let b = unquote_git_token(&tokens[1]);
-    strip_prefix_path(&b)
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_plus_plus_plus(line: &str) -> Option<String> {
     // +++ b/foo
     let rest = line.strip_prefix("+++ ")?;
     let token = parse_single_git_path(rest)?;
     if token == "/dev/null" {
         return None;

---- unified::tests::deleted_scope_includes_deleted_files stdout ----

thread 'unified::tests::deleted_scope_includes_deleted_files' (785267) panicked at crates/diffguard-diff/src/unified.rs:1096:9:
assertion `left == right` failed
  left: 0
 right: 1

---- unified::tests::parse_diff_git_line_parses_paths stdout ----

thread 'unified::tests::parse_diff_git_line_parses_paths' (785291) panicked at crates/diffguard-diff/src/unified.rs:881:9:
assertion `left == right` failed
  left: None
 right: Some("src/lib.rs")

failures:
    unified::tests::deleted_scope_includes_deleted_files
    unified::tests::parse_diff_git_line_parses_paths

test result: FAILED. 60 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
