*** crates/diffguard-diff/src/unified.rs:375:5: replace parse_diff_git_line -> Option<String> with Some("xyzzy".into())

*** mutation diff:
--- crates/diffguard-diff/src/unified.rs
+++ replace parse_diff_git_line -> Option<String> with Some("xyzzy".into())
@@ -367,23 +367,17 @@
     let start_str = range.split(',').next().unwrap_or(range);
     start_str
         .parse()
         .map_err(|_| DiffParseError::MalformedHunkHeader(full_line.to_string()))
 }
 
 fn parse_diff_git_line(line: &str) -> Option<String> {
     // diff --git a/foo b/foo
-    let rest = line.strip_prefix("diff --git ")?;
-    let tokens = tokenize_git_paths(rest, 2);
-    if tokens.len() < 2 {
-        return None;
-    }
-    let b = unquote_git_token(&tokens[1]);
-    strip_prefix_path(&b)
+    Some("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_plus_plus_plus(line: &str) -> Option<String> {
     // +++ b/foo
     let rest = line.strip_prefix("+++ ")?;
     let token = parse_single_git_path(rest)?;
     if token == "/dev/null" {
         return None;

---- unified::tests::parse_diff_git_line_parses_paths stdout ----

thread 'unified::tests::parse_diff_git_line_parses_paths' (786035) panicked at crates/diffguard-diff/src/unified.rs:881:9:
assertion `left == right` failed
  left: Some("xyzzy")
 right: Some("src/lib.rs")

---- unified::tests::parse_unified_diff_skips_malformed_diff_git_line stdout ----

thread 'unified::tests::parse_unified_diff_skips_malformed_diff_git_line' (786047) panicked at crates/diffguard-diff/src/unified.rs:916:9:
assertion failed: lines.is_empty()

---- unified::tests::parse_diff_git_line_rejects_missing_prefix stdout ----

thread 'unified::tests::parse_diff_git_line_rejects_missing_prefix' (786036) panicked at crates/diffguard-diff/src/unified.rs:900:9:
assertion `left == right` failed
  left: Some("xyzzy")
 right: None

failures:
    unified::tests::parse_diff_git_line_parses_paths
    unified::tests::parse_diff_git_line_rejects_missing_prefix
    unified::tests::parse_unified_diff_skips_malformed_diff_git_line

test result: FAILED. 59 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
