*** crates/diffguard-diff/src/unified.rs:377:21: replace < with == in parse_diff_git_line

*** mutation diff:
--- crates/diffguard-diff/src/unified.rs
+++ replace < with == in parse_diff_git_line
@@ -369,17 +369,17 @@
         .parse()
         .map_err(|_| DiffParseError::MalformedHunkHeader(full_line.to_string()))
 }
 
 fn parse_diff_git_line(line: &str) -> Option<String> {
     // diff --git a/foo b/foo
     let rest = line.strip_prefix("diff --git ")?;
     let tokens = tokenize_git_paths(rest, 2);
-    if tokens.len() < 2 {
+    if tokens.len() == /* ~ changed by cargo-mutants ~ */ 2 {
         return None;
     }
     let b = unquote_git_token(&tokens[1]);
     strip_prefix_path(&b)
 }
 
 fn parse_plus_plus_plus(line: &str) -> Option<String> {
     // +++ b/foo

---- unified::tests::deleted_scope_includes_deleted_files stdout ----

thread 'unified::tests::deleted_scope_includes_deleted_files' (786384) panicked at crates/diffguard-diff/src/unified.rs:1102:9:
assertion `left == right` failed
  left: 0
 right: 1

---- unified::tests::parse_diff_git_line_parses_paths stdout ----

thread 'unified::tests::parse_diff_git_line_parses_paths' (786408) panicked at crates/diffguard-diff/src/unified.rs:887:9:
assertion `left == right` failed
  left: None
 right: Some("src/lib.rs")

---- unified::tests::parse_unified_diff_skips_malformed_diff_git_line stdout ----

thread 'unified::tests::parse_unified_diff_skips_malformed_diff_git_line' (786420) panicked at crates/diffguard-diff/src/unified.rs:380:38:
index out of bounds: the len is 1 but the index is 1

failures:
    unified::tests::deleted_scope_includes_deleted_files
    unified::tests::parse_diff_git_line_parses_paths
    unified::tests::parse_unified_diff_skips_malformed_diff_git_line

test result: FAILED. 59 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
