*** crates/diffguard-diff/src/unified.rs:386:5: replace parse_plus_plus_plus -> Option<String> with None

*** mutation diff:
--- crates/diffguard-diff/src/unified.rs
+++ replace parse_plus_plus_plus -> Option<String> with None
@@ -378,22 +378,17 @@
         return None;
     }
     let b = unquote_git_token(&tokens[1]);
     strip_prefix_path(&b)
 }
 
 fn parse_plus_plus_plus(line: &str) -> Option<String> {
     // +++ b/foo
-    let rest = line.strip_prefix("+++ ")?;
-    let token = parse_single_git_path(rest)?;
-    if token == "/dev/null" {
-        return None;
-    }
-    strip_prefix_path(&token)
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn strip_prefix_path(p: &str) -> Option<String> {
     // strips a/ or b/
     let p = p.trim();
     let p = p
         .strip_prefix("a/")
         .or_else(|| p.strip_prefix("b/"))

---- unified::tests::parse_plus_plus_plus_parses_paths stdout ----

thread 'unified::tests::parse_plus_plus_plus_parses_paths' (787531) panicked at crates/diffguard-diff/src/unified.rs:924:9:
assertion `left == right` failed
  left: None
 right: Some("src/lib.rs")

failures:
    unified::tests::parse_plus_plus_plus_parses_paths

test result: FAILED. 61 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
