*** crates/diffguard-diff/src/unified.rs:386:5: replace parse_plus_plus_plus -> Option<String> with Some("xyzzy".into())

*** mutation diff:
--- crates/diffguard-diff/src/unified.rs
+++ replace parse_plus_plus_plus -> Option<String> with Some("xyzzy".into())
@@ -378,22 +378,17 @@
         return None;
     }
     let b = unquote_git_token(&tokens[1]);
     strip_prefix_path(&b)
 }
 
 fn parse_plus_plus_plus(line: &str) -> Option<String> {
     // +++ b/foo
-    let rest = line.strip_prefix("+++ ")?;
-    let token = parse_single_git_path(rest)?;
-    if token == "/dev/null" {
-        return None;
-    }
-    strip_prefix_path(&token)
+    Some("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn strip_prefix_path(p: &str) -> Option<String> {
     // strips a/ or b/
     let p = p.trim();
     let p = p
         .strip_prefix("a/")
         .or_else(|| p.strip_prefix("b/"))

---- unified::tests::binary_file_added_from_dev_null stdout ----

thread 'unified::tests::binary_file_added_from_dev_null' (788247) panicked at crates/diffguard-diff/src/unified.rs:1299:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "src/lib.rs"

---- unified::tests::continues_after_malformed_hunk_header stdout ----

thread 'unified::tests::continues_after_malformed_hunk_header' (788248) panicked at crates/diffguard-diff/src/unified.rs:1226:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "good.rs"

---- unified::tests::handles_multiple_special_cases_in_one_diff stdout ----

thread 'unified::tests::handles_multiple_special_cases_in_one_diff' (788255) panicked at crates/diffguard-diff/src/unified.rs:1279:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "normal.rs"

failures:
    unified::tests::binary_file_added_from_dev_null
    unified::tests::continues_after_malformed_hunk_header
    unified::tests::handles_multiple_special_cases_in_one_diff
    unified::tests::handles_unicode_in_file_paths
    unified::tests::parse_plus_plus_plus_parses_paths
    unified::tests::parse_plus_plus_plus_rejects_invalid_lines
    unified::tests::parses_added_lines
    unified::tests::parses_deleted_lines_when_requested
    unified::tests::parses_multiple_files_in_single_diff
    unified::tests::parses_multiple_files_preserves_order
    unified::tests::parses_multiple_files_with_multiple_hunks_each
    unified::tests::parses_quoted_paths_in_headers

test result: FAILED. 46 passed; 16 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
