*** crates/diffguard-diff/src/unified.rs:388:14: replace == with != in parse_plus_plus_plus

*** mutation diff:
--- crates/diffguard-diff/src/unified.rs
+++ replace == with != in parse_plus_plus_plus
@@ -380,17 +380,17 @@
     let b = unquote_git_token(&tokens[1]);
     strip_prefix_path(&b)
 }
 
 fn parse_plus_plus_plus(line: &str) -> Option<String> {
     // +++ b/foo
     let rest = line.strip_prefix("+++ ")?;
     let token = parse_single_git_path(rest)?;
-    if token == "/dev/null" {
+    if token != /* ~ changed by cargo-mutants ~ */ "/dev/null" {
         return None;
     }
     strip_prefix_path(&token)
 }
 
 fn strip_prefix_path(p: &str) -> Option<String> {
     // strips a/ or b/
     let p = p.trim();

---- unified::tests::parse_plus_plus_plus_parses_paths stdout ----

thread 'unified::tests::parse_plus_plus_plus_parses_paths' (788650) panicked at crates/diffguard-diff/src/unified.rs:929:9:
assertion `left == right` failed
  left: None
 right: Some("src/lib.rs")

failures:
    unified::tests::parse_plus_plus_plus_parses_paths

test result: FAILED. 61 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
