*** crates/diffguard-diff/src/unified.rs:396:5: replace strip_prefix_path -> Option<String> with None

*** mutation diff:
--- crates/diffguard-diff/src/unified.rs
+++ replace strip_prefix_path -> Option<String> with None
@@ -388,34 +388,17 @@
     if token == "/dev/null" {
         return None;
     }
     strip_prefix_path(&token)
 }
 
 fn strip_prefix_path(p: &str) -> Option<String> {
     // strips a/ or b/
-    let p = p.trim();
-    let p = p
-        .strip_prefix("a/")
-        .or_else(|| p.strip_prefix("b/"))
-        .unwrap_or(p);
-
-    // Normalize to forward slashes for receipts.
-    let normalized = Path::new(p)
-        .components()
-        .map(|c| c.as_os_str().to_string_lossy())
-        .collect::<Vec<_>>()
-        .join("/");
-
-    if normalized.is_empty() {
-        None
-    } else {
-        Some(normalized)
-    }
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 #[derive(Debug, Clone)]
 struct GitPathToken {
     value: String,
     quoted: bool,
 }

---- unified::tests::binary_file_added_from_dev_null stdout ----

thread 'unified::tests::binary_file_added_from_dev_null' (788973) panicked at crates/diffguard-diff/src/unified.rs:1286:9:
assertion `left == right` failed
  left: 0
 right: 1

---- unified::tests::continues_after_malformed_hunk_header stdout ----

thread 'unified::tests::continues_after_malformed_hunk_header' (788974) panicked at crates/diffguard-diff/src/unified.rs:1212:9:
assertion `left == right` failed
  left: 0
 right: 1

---- unified::tests::deleted_scope_includes_deleted_files stdout ----

thread 'unified::tests::deleted_scope_includes_deleted_files' (788975) panicked at crates/diffguard-diff/src/unified.rs:1085:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    unified::tests::binary_file_added_from_dev_null
    unified::tests::continues_after_malformed_hunk_header
    unified::tests::deleted_scope_includes_deleted_files
    unified::tests::handles_mixed_unicode_and_ascii
    unified::tests::handles_multiple_special_cases_in_one_diff
    unified::tests::handles_unicode_emojis_in_diff
    unified::tests::handles_unicode_in_added_lines
    unified::tests::handles_unicode_in_changed_lines
    unified::tests::handles_unicode_in_file_paths
    unified::tests::handles_unicode_special_characters
    unified::tests::ignores_lines_outside_hunks
    unified::tests::parse_diff_git_line_parses_paths

test result: FAILED. 36 passed; 26 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
