*** crates/diffguard-diff/src/unified.rs:396:5: replace strip_prefix_path -> Option<String> with Some("xyzzy".into())

*** mutation diff:
--- crates/diffguard-diff/src/unified.rs
+++ replace strip_prefix_path -> Option<String> with Some("xyzzy".into())
@@ -388,34 +388,17 @@
     if token == "/dev/null" {
         return None;
     }
     strip_prefix_path(&token)
 }
 
 fn strip_prefix_path(p: &str) -> Option<String> {
     // strips a/ or b/
-    let p = p.trim();
-    let p = p
-        .strip_prefix("a/")
-        .or_else(|| p.strip_prefix("b/"))
-        .unwrap_or(p);
-
-    // Normalize to forward slashes for receipts.
-    let normalized = Path::new(p)
-        .components()
-        .map(|c| c.as_os_str().to_string_lossy())
-        .collect::<Vec<_>>()
-        .join("/");
-
-    if normalized.is_empty() {
-        None
-    } else {
-        Some(normalized)
-    }
+    Some("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[derive(Debug, Clone)]
 struct GitPathToken {
     value: String,
     quoted: bool,
 }

---- unified::tests::binary_file_added_from_dev_null stdout ----

thread 'unified::tests::binary_file_added_from_dev_null' (789679) panicked at crates/diffguard-diff/src/unified.rs:1287:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "src/lib.rs"

---- unified::tests::continues_after_malformed_hunk_header stdout ----

thread 'unified::tests::continues_after_malformed_hunk_header' (789680) panicked at crates/diffguard-diff/src/unified.rs:1214:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "good.rs"

---- unified::tests::handles_multiple_special_cases_in_one_diff stdout ----

thread 'unified::tests::handles_multiple_special_cases_in_one_diff' (789687) panicked at crates/diffguard-diff/src/unified.rs:1267:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "normal.rs"

failures:
    unified::tests::binary_file_added_from_dev_null
    unified::tests::continues_after_malformed_hunk_header
    unified::tests::handles_multiple_special_cases_in_one_diff
    unified::tests::handles_unicode_in_file_paths
    unified::tests::parse_diff_git_line_parses_paths
    unified::tests::parse_plus_plus_plus_parses_paths
    unified::tests::parses_added_lines
    unified::tests::parses_deleted_lines_when_requested
    unified::tests::parses_multiple_files_in_single_diff
    unified::tests::parses_multiple_files_preserves_order
    unified::tests::parses_multiple_files_with_multiple_hunks_each
    unified::tests::parses_quoted_paths_in_headers

test result: FAILED. 45 passed; 17 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
