*** crates/diffguard-diff/src/unified.rs:423:5: replace tokenize_git_paths -> Vec<GitPathToken> with vec![]

*** mutation diff:
--- crates/diffguard-diff/src/unified.rs
+++ replace tokenize_git_paths -> Vec<GitPathToken> with vec![]
@@ -415,72 +415,17 @@
 
 #[derive(Debug, Clone)]
 struct GitPathToken {
     value: String,
     quoted: bool,
 }
 
 fn tokenize_git_paths(input: &str, limit: usize) -> Vec<GitPathToken> {
-    let mut tokens = Vec::new();
-    let mut buf = String::new();
-    let mut quoted = false;
-    let mut in_quote = false;
-    let mut chars = input.chars().peekable();
-
-    while let Some(ch) = chars.next() {
-        if in_quote {
-            if ch == '\\' {
-                if let Some(next) = chars.next() {
-                    buf.push('\\');
-                    buf.push(next);
-                } else {
-                    buf.push('\\');
-                }
-                continue;
-            }
-
-            if ch == '"' {
-                in_quote = false;
-                continue;
-            }
-
-            buf.push(ch);
-            continue;
-        }
-
-        if ch.is_whitespace() {
-            if !buf.is_empty() {
-                tokens.push(GitPathToken {
-                    value: buf.clone(),
-                    quoted,
-                });
-                buf.clear();
-                quoted = false;
-                if tokens.len() >= limit {
-                    return tokens;
-                }
-            }
-            continue;
-        }
-
-        if ch == '"' {
-            in_quote = true;
-            quoted = true;
-            continue;
-        }
-
-        buf.push(ch);
-    }
-
-    if !buf.is_empty() && tokens.len() < limit {
-        tokens.push(GitPathToken { value: buf, quoted });
-    }
-
-    tokens
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_single_git_path(input: &str) -> Option<String> {
     let tokens = tokenize_git_paths(input, 1);
     tokens.first().map(unquote_git_token)
 }
 
 fn parse_rename_path(input: &str) -> Option<String> {

---- unified::tests::binary_file_added_from_dev_null stdout ----

thread 'unified::tests::binary_file_added_from_dev_null' (790052) panicked at crates/diffguard-diff/src/unified.rs:1248:9:
assertion `left == right` failed
  left: 0
 right: 1

---- unified::tests::continues_after_malformed_hunk_header stdout ----

thread 'unified::tests::continues_after_malformed_hunk_header' (790053) panicked at crates/diffguard-diff/src/unified.rs:1174:9:
assertion `left == right` failed
  left: 0
 right: 1

---- unified::tests::deleted_scope_includes_deleted_files stdout ----

thread 'unified::tests::deleted_scope_includes_deleted_files' (790054) panicked at crates/diffguard-diff/src/unified.rs:1047:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    unified::tests::binary_file_added_from_dev_null
    unified::tests::continues_after_malformed_hunk_header
    unified::tests::deleted_scope_includes_deleted_files
    unified::tests::handles_mixed_unicode_and_ascii
    unified::tests::handles_multiple_special_cases_in_one_diff
    unified::tests::handles_unicode_emojis_in_diff
    unified::tests::handles_unicode_in_added_lines
    unified::tests::handles_unicode_in_changed_lines
    unified::tests::handles_unicode_in_file_paths
    unified::tests::handles_unicode_special_characters
    unified::tests::ignores_lines_outside_hunks
    unified::tests::parse_diff_git_line_parses_paths

test result: FAILED. 32 passed; 30 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
