*** crates/diffguard-diff/src/unified.rs:431:19: replace == with != in tokenize_git_paths

*** mutation diff:
--- crates/diffguard-diff/src/unified.rs
+++ replace == with != in tokenize_git_paths
@@ -423,17 +423,17 @@
     let mut tokens = Vec::new();
     let mut buf = String::new();
     let mut quoted = false;
     let mut in_quote = false;
     let mut chars = input.chars().peekable();
 
     while let Some(ch) = chars.next() {
         if in_quote {
-            if ch == '\\' {
+            if ch != /* ~ changed by cargo-mutants ~ */ '\\' {
                 if let Some(next) = chars.next() {
                     buf.push('\\');
                     buf.push(next);
                 } else {
                     buf.push('\\');
                 }
                 continue;
             }

---- unified::tests::parse_plus_plus_plus_parses_paths stdout ----

thread 'unified::tests::parse_plus_plus_plus_parses_paths' (790467) panicked at crates/diffguard-diff/src/unified.rs:934:9:
assertion `left == right` failed
  left: Some("\\/\\i \\a\\e\\f\\l\\.\\s\\")
 right: Some("dir name/file.rs")

---- unified::tests::parse_diff_git_line_parses_paths stdout ----

thread 'unified::tests::parse_diff_git_line_parses_paths' (790463) panicked at crates/diffguard-diff/src/unified.rs:891:9:
assertion `left == right` failed
  left: None
 right: Some("dir name/file.rs")

---- unified::tests::parse_rename_from_extracts_source_path stdout ----

thread 'unified::tests::parse_rename_from_extracts_source_path' (790469) panicked at crates/diffguard-diff/src/unified.rs:838:9:
assertion `left == right` failed
  left: Some("\\a\\h\\w\t \\p\\c\\s\\f\\l\\.\\s\\")
 right: Some("path/with spaces/file.rs")

failures:
    unified::tests::parse_diff_git_line_parses_paths
    unified::tests::parse_plus_plus_plus_parses_paths
    unified::tests::parse_rename_from_extracts_source_path
    unified::tests::parse_rename_to_extracts_destination_path
    unified::tests::parses_quoted_paths_in_headers
    unified::tests::tokenize_git_paths_respects_quotes_and_limits
    unified::tests::tokenize_git_paths_trailing_escape_in_quote

test result: FAILED. 55 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
