*** crates/diffguard-diff/src/unified.rs:441:19: replace == with != in tokenize_git_paths

*** mutation diff:
--- crates/diffguard-diff/src/unified.rs
+++ replace == with != in tokenize_git_paths
@@ -433,17 +433,17 @@
                     buf.push('\\');
                     buf.push(next);
                 } else {
                     buf.push('\\');
                 }
                 continue;
             }
 
-            if ch == '"' {
+            if ch != /* ~ changed by cargo-mutants ~ */ '"' {
                 in_quote = false;
                 continue;
             }
 
             buf.push(ch);
             continue;
         }

---- unified::tests::parse_plus_plus_plus_parses_paths stdout ----

thread 'unified::tests::parse_plus_plus_plus_parses_paths' (790840) panicked at crates/diffguard-diff/src/unified.rs:934:9:
assertion `left == right` failed
  left: Some("//dir")
 right: Some("dir name/file.rs")

---- unified::tests::parse_rename_from_extracts_source_path stdout ----

thread 'unified::tests::parse_rename_from_extracts_source_path' (790842) panicked at crates/diffguard-diff/src/unified.rs:838:9:
assertion `left == right` failed
  left: Some("ath/with")
 right: Some("path/with spaces/file.rs")

---- unified::tests::parse_rename_to_extracts_destination_path stdout ----

thread 'unified::tests::parse_rename_to_extracts_destination_path' (790845) panicked at crates/diffguard-diff/src/unified.rs:871:9:
assertion `left == right` failed
  left: Some("ath/with")
 right: Some("path/with spaces/file.rs")

failures:
    unified::tests::parse_diff_git_line_parses_paths
    unified::tests::parse_plus_plus_plus_parses_paths
    unified::tests::parse_rename_from_extracts_source_path
    unified::tests::parse_rename_to_extracts_destination_path
    unified::tests::parses_quoted_paths_in_headers
    unified::tests::tokenize_git_paths_respects_quotes_and_limits
    unified::tests::tokenize_git_paths_trailing_escape_in_quote

test result: FAILED. 55 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
