*** crates/diffguard-diff/src/unified.rs:44:5: replace is_deleted_file -> bool with true

*** mutation diff:
--- crates/diffguard-diff/src/unified.rs
+++ replace is_deleted_file -> bool with true
@@ -36,17 +36,17 @@
 
 /// Detects if a line indicates a deleted file mode.
 ///
 /// Deleted files are marked with lines like:
 /// - "deleted file mode 100644"
 ///
 /// Requirements: 4.5
 pub fn is_deleted_file(line: &str) -> bool {
-    line.starts_with("deleted file mode ")
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 /// Detects if a line indicates a new file mode.
 ///
 /// New files are marked with lines like:
 /// - "new file mode 100644"
 pub fn is_new_file(line: &str) -> bool {
     line.starts_with("new file mode ")

---- unified::tests::binary_file_added_from_dev_null stdout ----

thread 'unified::tests::binary_file_added_from_dev_null' (776683) panicked at crates/diffguard-diff/src/unified.rs:1303:9:
assertion `left == right` failed
  left: 0
 right: 1

---- unified::tests::continues_after_malformed_hunk_header stdout ----

thread 'unified::tests::continues_after_malformed_hunk_header' (776684) panicked at crates/diffguard-diff/src/unified.rs:1229:9:
assertion `left == right` failed
  left: 0
 right: 1

---- unified::tests::handles_mixed_unicode_and_ascii stdout ----

thread 'unified::tests::handles_mixed_unicode_and_ascii' (776689) panicked at crates/diffguard-diff/src/unified.rs:1619:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    unified::tests::binary_file_added_from_dev_null
    unified::tests::continues_after_malformed_hunk_header
    unified::tests::deleted_scope_includes_deleted_files
    unified::tests::handles_mixed_unicode_and_ascii
    unified::tests::handles_multiple_special_cases_in_one_diff
    unified::tests::handles_unicode_emojis_in_diff
    unified::tests::handles_unicode_in_added_lines
    unified::tests::handles_unicode_in_changed_lines
    unified::tests::handles_unicode_in_file_paths
    unified::tests::handles_unicode_special_characters
    unified::tests::ignores_lines_outside_hunks
    unified::tests::is_deleted_file_rejects_non_deleted_lines

test result: FAILED. 36 passed; 26 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
