*** crates/diffguard-diff/src/unified.rs:44:5: replace is_deleted_file -> bool with false

*** mutation diff:
--- crates/diffguard-diff/src/unified.rs
+++ replace is_deleted_file -> bool with false
@@ -36,17 +36,17 @@
 
 /// Detects if a line indicates a deleted file mode.
 ///
 /// Deleted files are marked with lines like:
 /// - "deleted file mode 100644"
 ///
 /// Requirements: 4.5
 pub fn is_deleted_file(line: &str) -> bool {
-    line.starts_with("deleted file mode ")
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 /// Detects if a line indicates a new file mode.
 ///
 /// New files are marked with lines like:
 /// - "new file mode 100644"
 pub fn is_new_file(line: &str) -> bool {
     line.starts_with("new file mode ")

---- unified::tests::is_deleted_file_detects_deleted_mode stdout ----

thread 'unified::tests::is_deleted_file_detects_deleted_mode' (777073) panicked at crates/diffguard-diff/src/unified.rs:779:9:
assertion failed: is_deleted_file("deleted file mode 100644")

failures:
    unified::tests::is_deleted_file_detects_deleted_mode

test result: FAILED. 61 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
