*** crates/diffguard-diff/src/unified.rs:451:16: delete ! in tokenize_git_paths

*** mutation diff:
--- crates/diffguard-diff/src/unified.rs
+++ delete ! in tokenize_git_paths
@@ -443,17 +443,17 @@
                 continue;
             }
 
             buf.push(ch);
             continue;
         }
 
         if ch.is_whitespace() {
-            if !buf.is_empty() {
+            if  /* ~ changed by cargo-mutants ~ */buf.is_empty() {
                 tokens.push(GitPathToken {
                     value: buf.clone(),
                     quoted,
                 });
                 buf.clear();
                 quoted = false;
                 if tokens.len() >= limit {
                     return tokens;

---- unified::tests::deleted_scope_includes_deleted_files stdout ----

thread 'unified::tests::deleted_scope_includes_deleted_files' (791185) panicked at crates/diffguard-diff/src/unified.rs:1102:9:
assertion `left == right` failed
  left: 0
 right: 1

---- unified::tests::parse_diff_git_line_parses_paths stdout ----

thread 'unified::tests::parse_diff_git_line_parses_paths' (791209) panicked at crates/diffguard-diff/src/unified.rs:887:9:
assertion `left == right` failed
  left: None
 right: Some("src/lib.rs")

---- unified::tests::parse_single_git_path_empty_returns_none stdout ----

thread 'unified::tests::parse_single_git_path_empty_returns_none' (791220) panicked at crates/diffguard-diff/src/unified.rs:729:9:
assertion failed: parse_single_git_path("   ").is_none()

failures:
    unified::tests::deleted_scope_includes_deleted_files
    unified::tests::parse_diff_git_line_parses_paths
    unified::tests::parse_single_git_path_empty_returns_none
    unified::tests::tokenize_git_paths_respects_quotes_and_limits

test result: FAILED. 58 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
