*** crates/diffguard-diff/src/unified.rs:458:33: replace >= with < in tokenize_git_paths

*** mutation diff:
--- crates/diffguard-diff/src/unified.rs
+++ replace >= with < in tokenize_git_paths
@@ -450,17 +450,17 @@
         if ch.is_whitespace() {
             if !buf.is_empty() {
                 tokens.push(GitPathToken {
                     value: buf.clone(),
                     quoted,
                 });
                 buf.clear();
                 quoted = false;
-                if tokens.len() >= limit {
+                if tokens.len() < /* ~ changed by cargo-mutants ~ */ limit {
                     return tokens;
                 }
             }
             continue;
         }
 
         if ch == '"' {
             in_quote = true;

---- unified::tests::deleted_scope_includes_deleted_files stdout ----

thread 'unified::tests::deleted_scope_includes_deleted_files' (791558) panicked at crates/diffguard-diff/src/unified.rs:1102:9:
assertion `left == right` failed
  left: 0
 right: 1

---- unified::tests::parse_diff_git_line_parses_paths stdout ----

thread 'unified::tests::parse_diff_git_line_parses_paths' (791582) panicked at crates/diffguard-diff/src/unified.rs:887:9:
assertion `left == right` failed
  left: None
 right: Some("src/lib.rs")

---- unified::tests::tokenize_git_paths_respects_quotes_and_limits stdout ----

thread 'unified::tests::tokenize_git_paths_respects_quotes_and_limits' (791613) panicked at crates/diffguard-diff/src/unified.rs:965:9:
assertion `left == right` failed
  left: 1
 right: 2

failures:
    unified::tests::deleted_scope_includes_deleted_files
    unified::tests::parse_diff_git_line_parses_paths
    unified::tests::tokenize_git_paths_respects_quotes_and_limits

test result: FAILED. 59 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
