*** crates/diffguard-diff/src/unified.rs:474:24: replace && with || in tokenize_git_paths

*** mutation diff:
--- crates/diffguard-diff/src/unified.rs
+++ replace && with || in tokenize_git_paths
@@ -466,17 +466,17 @@
             in_quote = true;
             quoted = true;
             continue;
         }
 
         buf.push(ch);
     }
 
-    if !buf.is_empty() && tokens.len() < limit {
+    if !buf.is_empty() || /* ~ changed by cargo-mutants ~ */ tokens.len() < limit {
         tokens.push(GitPathToken { value: buf, quoted });
     }
 
     tokens
 }
 
 fn parse_single_git_path(input: &str) -> Option<String> {
     let tokens = tokenize_git_paths(input, 1);

---- unified::tests::parse_single_git_path_empty_returns_none stdout ----

thread 'unified::tests::parse_single_git_path_empty_returns_none' (792339) panicked at crates/diffguard-diff/src/unified.rs:729:9:
assertion failed: parse_single_git_path("   ").is_none()

---- unified::tests::tokenize_git_paths_respects_quotes_and_limits stdout ----

thread 'unified::tests::tokenize_git_paths_respects_quotes_and_limits' (792359) panicked at crates/diffguard-diff/src/unified.rs:977:9:
assertion `left == right` failed
  left: 2
 right: 1

failures:
    unified::tests::parse_single_git_path_empty_returns_none
    unified::tests::tokenize_git_paths_respects_quotes_and_limits

test result: FAILED. 60 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
