*** crates/diffguard-diff/src/unified.rs:474:40: replace < with > in tokenize_git_paths

*** mutation diff:
--- crates/diffguard-diff/src/unified.rs
+++ replace < with > in tokenize_git_paths
@@ -466,17 +466,17 @@
             in_quote = true;
             quoted = true;
             continue;
         }
 
         buf.push(ch);
     }
 
-    if !buf.is_empty() && tokens.len() < limit {
+    if !buf.is_empty() && tokens.len() > /* ~ changed by cargo-mutants ~ */ limit {
         tokens.push(GitPathToken { value: buf, quoted });
     }
 
     tokens
 }
 
 fn parse_single_git_path(input: &str) -> Option<String> {
     let tokens = tokenize_git_paths(input, 1);

---- unified::tests::continues_after_malformed_hunk_header stdout ----

thread 'unified::tests::continues_after_malformed_hunk_header' (793422) panicked at crates/diffguard-diff/src/unified.rs:1229:9:
assertion `left == right` failed
  left: 0
 right: 1

---- unified::tests::deleted_scope_includes_deleted_files stdout ----

thread 'unified::tests::deleted_scope_includes_deleted_files' (793423) panicked at crates/diffguard-diff/src/unified.rs:1102:9:
assertion `left == right` failed
  left: 0
 right: 1

---- unified::tests::binary_file_added_from_dev_null stdout ----

thread 'unified::tests::binary_file_added_from_dev_null' (793421) panicked at crates/diffguard-diff/src/unified.rs:1303:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    unified::tests::binary_file_added_from_dev_null
    unified::tests::continues_after_malformed_hunk_header
    unified::tests::deleted_scope_includes_deleted_files
    unified::tests::handles_mixed_unicode_and_ascii
    unified::tests::handles_multiple_special_cases_in_one_diff
    unified::tests::handles_unicode_emojis_in_diff
    unified::tests::handles_unicode_in_added_lines
    unified::tests::handles_unicode_in_changed_lines
    unified::tests::handles_unicode_in_file_paths
    unified::tests::handles_unicode_special_characters
    unified::tests::ignores_lines_outside_hunks
    unified::tests::parse_diff_git_line_parses_paths

test result: FAILED. 32 passed; 30 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
