*** crates/diffguard-diff/src/unified.rs:474:40: replace < with <= in tokenize_git_paths

*** mutation diff:
--- crates/diffguard-diff/src/unified.rs
+++ replace < with <= in tokenize_git_paths
@@ -466,17 +466,17 @@
             in_quote = true;
             quoted = true;
             continue;
         }
 
         buf.push(ch);
     }
 
-    if !buf.is_empty() && tokens.len() < limit {
+    if !buf.is_empty() && tokens.len() <= /* ~ changed by cargo-mutants ~ */ limit {
         tokens.push(GitPathToken { value: buf, quoted });
     }
 
     tokens
 }
 
 fn parse_single_git_path(input: &str) -> Option<String> {
     let tokens = tokenize_git_paths(input, 1);

---- unified::tests::tokenize_git_paths_respects_quotes_and_limits stdout ----

thread 'unified::tests::tokenize_git_paths_respects_quotes_and_limits' (793851) panicked at crates/diffguard-diff/src/unified.rs:981:9:
assertion failed: tokens.is_empty()

failures:
    unified::tests::tokenize_git_paths_respects_quotes_and_limits

test result: FAILED. 61 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
