*** crates/diffguard-diff/src/unified.rs:482:5: replace parse_single_git_path -> Option<String> with None

*** mutation diff:
--- crates/diffguard-diff/src/unified.rs
+++ replace parse_single_git_path -> Option<String> with None
@@ -474,18 +474,17 @@
     if !buf.is_empty() && tokens.len() < limit {
         tokens.push(GitPathToken { value: buf, quoted });
     }
 
     tokens
 }
 
 fn parse_single_git_path(input: &str) -> Option<String> {
-    let tokens = tokenize_git_paths(input, 1);
-    tokens.first().map(unquote_git_token)
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_rename_path(input: &str) -> Option<String> {
     let trimmed = input.trim();
     if trimmed.is_empty() {
         return None;
     }

---- unified::tests::parse_plus_plus_plus_parses_paths stdout ----

thread 'unified::tests::parse_plus_plus_plus_parses_paths' (794197) panicked at crates/diffguard-diff/src/unified.rs:928:9:
assertion `left == right` failed
  left: None
 right: Some("src/lib.rs")

---- unified::tests::parse_rename_from_extracts_source_path stdout ----

thread 'unified::tests::parse_rename_from_extracts_source_path' (794199) panicked at crates/diffguard-diff/src/unified.rs:837:9:
assertion `left == right` failed
  left: None
 right: Some("path/with spaces/file.rs")

---- unified::tests::parse_rename_to_extracts_destination_path stdout ----

thread 'unified::tests::parse_rename_to_extracts_destination_path' (794202) panicked at crates/diffguard-diff/src/unified.rs:870:9:
assertion `left == right` failed
  left: None
 right: Some("path/with spaces/file.rs")

failures:
    unified::tests::parse_plus_plus_plus_parses_paths
    unified::tests::parse_rename_from_extracts_source_path
    unified::tests::parse_rename_to_extracts_destination_path

test result: FAILED. 59 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
