*** crates/diffguard-diff/src/unified.rs:482:5: replace parse_single_git_path -> Option<String> with Some("xyzzy".into())

*** mutation diff:
--- crates/diffguard-diff/src/unified.rs
+++ replace parse_single_git_path -> Option<String> with Some("xyzzy".into())
@@ -474,18 +474,17 @@
     if !buf.is_empty() && tokens.len() < limit {
         tokens.push(GitPathToken { value: buf, quoted });
     }
 
     tokens
 }
 
 fn parse_single_git_path(input: &str) -> Option<String> {
-    let tokens = tokenize_git_paths(input, 1);
-    tokens.first().map(unquote_git_token)
+    Some("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_rename_path(input: &str) -> Option<String> {
     let trimmed = input.trim();
     if trimmed.is_empty() {
         return None;
     }

---- unified::tests::continues_after_malformed_hunk_header stdout ----

thread 'unified::tests::continues_after_malformed_hunk_header' (794914) panicked at crates/diffguard-diff/src/unified.rs:1230:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "good.rs"

---- unified::tests::binary_file_added_from_dev_null stdout ----

thread 'unified::tests::binary_file_added_from_dev_null' (794913) panicked at crates/diffguard-diff/src/unified.rs:1303:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "src/lib.rs"

---- unified::tests::handles_multiple_special_cases_in_one_diff stdout ----

thread 'unified::tests::handles_multiple_special_cases_in_one_diff' (794921) panicked at crates/diffguard-diff/src/unified.rs:1283:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "normal.rs"

failures:
    unified::tests::binary_file_added_from_dev_null
    unified::tests::continues_after_malformed_hunk_header
    unified::tests::handles_multiple_special_cases_in_one_diff
    unified::tests::handles_unicode_in_file_paths
    unified::tests::parse_plus_plus_plus_parses_paths
    unified::tests::parse_plus_plus_plus_rejects_invalid_lines
    unified::tests::parse_rename_from_extracts_source_path
    unified::tests::parse_rename_to_extracts_destination_path
    unified::tests::parse_single_git_path_empty_returns_none
    unified::tests::parses_added_lines
    unified::tests::parses_deleted_lines_when_requested
    unified::tests::parses_multiple_files_in_single_diff

test result: FAILED. 43 passed; 19 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
