*** crates/diffguard-diff/src/unified.rs:487:5: replace parse_rename_path -> Option<String> with None

*** mutation diff:
--- crates/diffguard-diff/src/unified.rs
+++ replace parse_rename_path -> Option<String> with None
@@ -479,26 +479,17 @@
 }
 
 fn parse_single_git_path(input: &str) -> Option<String> {
     let tokens = tokenize_git_paths(input, 1);
     tokens.first().map(unquote_git_token)
 }
 
 fn parse_rename_path(input: &str) -> Option<String> {
-    let trimmed = input.trim();
-    if trimmed.is_empty() {
-        return None;
-    }
-
-    if trimmed.starts_with('"') {
-        return parse_single_git_path(trimmed);
-    }
-
-    Some(trimmed.to_string())
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn unquote_git_token(token: &GitPathToken) -> String {
     if token.quoted {
         unescape_git_path(&token.value)
     } else {
         token.value.clone()
     }

---- unified::tests::parse_rename_from_extracts_source_path stdout ----

thread 'unified::tests::parse_rename_from_extracts_source_path' (795318) panicked at crates/diffguard-diff/src/unified.rs:817:9:
assertion `left == right` failed
  left: None
 right: Some("src/old/path.rs")

---- unified::tests::parse_rename_to_extracts_destination_path stdout ----

thread 'unified::tests::parse_rename_to_extracts_destination_path' (795321) panicked at crates/diffguard-diff/src/unified.rs:850:9:
assertion `left == right` failed
  left: None
 right: Some("src/new/path.rs")

failures:
    unified::tests::parse_rename_from_extracts_source_path
    unified::tests::parse_rename_to_extracts_destination_path

test result: FAILED. 60 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
