*** crates/diffguard-diff/src/unified.rs:500:5: replace unquote_git_token -> String with String::new()

*** mutation diff:
--- crates/diffguard-diff/src/unified.rs
+++ replace unquote_git_token -> String with String::new()
@@ -492,21 +492,17 @@
     if trimmed.starts_with('"') {
         return parse_single_git_path(trimmed);
     }
 
     Some(trimmed.to_string())
 }
 
 fn unquote_git_token(token: &GitPathToken) -> String {
-    if token.quoted {
-        unescape_git_path(&token.value)
-    } else {
-        token.value.clone()
-    }
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 fn unescape_git_path(s: &str) -> String {
     let mut out: Vec<u8> = Vec::with_capacity(s.len());
     let mut iter = s.as_bytes().iter().copied().peekable();
 
     while let Some(b) = iter.next() {
         if b != b'\\' {

---- unified::tests::continues_after_malformed_hunk_header stdout ----

thread 'unified::tests::continues_after_malformed_hunk_header' (796402) panicked at crates/diffguard-diff/src/unified.rs:1225:9:
assertion `left == right` failed
  left: 0
 right: 1

---- unified::tests::binary_file_added_from_dev_null stdout ----

thread 'unified::tests::binary_file_added_from_dev_null' (796401) panicked at crates/diffguard-diff/src/unified.rs:1299:9:
assertion `left == right` failed
  left: 0
 right: 1

---- unified::tests::deleted_scope_includes_deleted_files stdout ----

thread 'unified::tests::deleted_scope_includes_deleted_files' (796403) panicked at crates/diffguard-diff/src/unified.rs:1098:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    unified::tests::binary_file_added_from_dev_null
    unified::tests::continues_after_malformed_hunk_header
    unified::tests::deleted_scope_includes_deleted_files
    unified::tests::handles_mixed_unicode_and_ascii
    unified::tests::handles_multiple_special_cases_in_one_diff
    unified::tests::handles_unicode_emojis_in_diff
    unified::tests::handles_unicode_in_added_lines
    unified::tests::handles_unicode_in_changed_lines
    unified::tests::handles_unicode_in_file_paths
    unified::tests::handles_unicode_special_characters
    unified::tests::ignores_lines_outside_hunks
    unified::tests::parse_diff_git_line_parses_paths

test result: FAILED. 34 passed; 28 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
