*** crates/diffguard-diff/src/unified.rs:500:5: replace unquote_git_token -> String with "xyzzy".into()

*** mutation diff:
--- crates/diffguard-diff/src/unified.rs
+++ replace unquote_git_token -> String with "xyzzy".into()
@@ -492,21 +492,17 @@
     if trimmed.starts_with('"') {
         return parse_single_git_path(trimmed);
     }
 
     Some(trimmed.to_string())
 }
 
 fn unquote_git_token(token: &GitPathToken) -> String {
-    if token.quoted {
-        unescape_git_path(&token.value)
-    } else {
-        token.value.clone()
-    }
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 fn unescape_git_path(s: &str) -> String {
     let mut out: Vec<u8> = Vec::with_capacity(s.len());
     let mut iter = s.as_bytes().iter().copied().peekable();
 
     while let Some(b) = iter.next() {
         if b != b'\\' {

---- unified::tests::continues_after_malformed_hunk_header stdout ----

thread 'unified::tests::continues_after_malformed_hunk_header' (796771) panicked at crates/diffguard-diff/src/unified.rs:1227:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "good.rs"

---- unified::tests::binary_file_added_from_dev_null stdout ----

thread 'unified::tests::binary_file_added_from_dev_null' (796770) panicked at crates/diffguard-diff/src/unified.rs:1300:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "src/lib.rs"

---- unified::tests::handles_multiple_special_cases_in_one_diff stdout ----

thread 'unified::tests::handles_multiple_special_cases_in_one_diff' (796778) panicked at crates/diffguard-diff/src/unified.rs:1280:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "normal.rs"

failures:
    unified::tests::binary_file_added_from_dev_null
    unified::tests::continues_after_malformed_hunk_header
    unified::tests::handles_multiple_special_cases_in_one_diff
    unified::tests::handles_unicode_in_file_paths
    unified::tests::parse_diff_git_line_parses_paths
    unified::tests::parse_plus_plus_plus_parses_paths
    unified::tests::parse_rename_from_extracts_source_path
    unified::tests::parse_rename_to_extracts_destination_path
    unified::tests::parses_added_lines
    unified::tests::parses_deleted_lines_when_requested
    unified::tests::parses_multiple_files_in_single_diff
    unified::tests::parses_multiple_files_preserves_order

test result: FAILED. 44 passed; 18 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
