*** crates/diffguard-diff/src/unified.rs:508:5: replace unescape_git_path -> String with "xyzzy".into()

*** mutation diff:
--- crates/diffguard-diff/src/unified.rs
+++ replace unescape_git_path -> String with "xyzzy".into()
@@ -500,58 +500,17 @@
     if token.quoted {
         unescape_git_path(&token.value)
     } else {
         token.value.clone()
     }
 }
 
 fn unescape_git_path(s: &str) -> String {
-    let mut out: Vec<u8> = Vec::with_capacity(s.len());
-    let mut iter = s.as_bytes().iter().copied().peekable();
-
-    while let Some(b) = iter.next() {
-        if b != b'\\' {
-            out.push(b);
-            continue;
-        }
-
-        let Some(next) = iter.next() else {
-            out.push(b'\\');
-            break;
-        };
-
-        match next {
-            b'\\' => out.push(b'\\'),
-            b'"' => out.push(b'"'),
-            b'n' => out.push(b'\n'),
-            b't' => out.push(b'\t'),
-            b'r' => out.push(b'\r'),
-            b' ' => out.push(b' '),
-            b'0'..=b'7' => {
-                let mut val = (next - b'0') as u32;
-                for _ in 0..2 {
-                    match iter.peek().copied() {
-                        Some(d) if (b'0'..=b'7').contains(&d) => {
-                            val = val * 8 + (d - b'0') as u32;
-                            iter.next();
-                        }
-                        _ => break,
-                    }
-                }
-                out.push((val & 0xFF) as u8);
-            }
-            _ => {
-                out.push(b'\\');
-                out.push(next);
-            }
-        }
-    }
-
-    String::from_utf8_lossy(&out).into_owned()
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
     fn parses_added_lines() {

---- unified::tests::parse_rename_from_extracts_source_path stdout ----

thread 'unified::tests::parse_rename_from_extracts_source_path' (797532) panicked at crates/diffguard-diff/src/unified.rs:797:9:
assertion `left == right` failed
  left: Some("xyzzy")
 right: Some("path/with spaces/file.rs")

---- unified::tests::parse_rename_to_extracts_destination_path stdout ----

thread 'unified::tests::parse_rename_to_extracts_destination_path' (797535) panicked at crates/diffguard-diff/src/unified.rs:830:9:
assertion `left == right` failed
  left: Some("xyzzy")
 right: Some("path/with spaces/file.rs")

---- unified::tests::parses_quoted_paths_in_headers stdout ----

thread 'unified::tests::parses_quoted_paths_in_headers' (797545) panicked at crates/diffguard-diff/src/unified.rs:1130:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "dir name/file.rs"

failures:
    unified::tests::parse_diff_git_line_parses_paths
    unified::tests::parse_plus_plus_plus_parses_paths
    unified::tests::parse_rename_from_extracts_source_path
    unified::tests::parse_rename_to_extracts_destination_path
    unified::tests::parses_quoted_paths_in_headers
    unified::tests::unescape_git_path_handles_common_escapes
    unified::tests::unescape_git_path_handles_octal_limits_and_control_chars

test result: FAILED. 55 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
