*** crates/diffguard-diff/src/unified.rs:512:14: replace != with == in unescape_git_path

*** mutation diff:
--- crates/diffguard-diff/src/unified.rs
+++ replace != with == in unescape_git_path
@@ -504,17 +504,17 @@
     }
 }
 
 fn unescape_git_path(s: &str) -> String {
     let mut out: Vec<u8> = Vec::with_capacity(s.len());
     let mut iter = s.as_bytes().iter().copied().peekable();
 
     while let Some(b) = iter.next() {
-        if b != b'\\' {
+        if b == /* ~ changed by cargo-mutants ~ */ b'\\' {
             out.push(b);
             continue;
         }
 
         let Some(next) = iter.next() else {
             out.push(b'\\');
             break;
         };

---- unified::tests::parse_diff_git_line_parses_paths stdout ----

thread 'unified::tests::parse_diff_git_line_parses_paths' (797899) panicked at crates/diffguard-diff/src/unified.rs:891:9:
assertion `left == right` failed
  left: Some("\\/\\i \\a\\e\\f\\l\\.\\s")
 right: Some("dir name/file.rs")

---- unified::tests::parse_plus_plus_plus_parses_paths stdout ----

thread 'unified::tests::parse_plus_plus_plus_parses_paths' (797903) panicked at crates/diffguard-diff/src/unified.rs:934:9:
assertion `left == right` failed
  left: Some("\\/\\i \\a\\e\\f\\l\\.\\s")
 right: Some("dir name/file.rs")

---- unified::tests::parse_rename_from_extracts_source_path stdout ----

thread 'unified::tests::parse_rename_from_extracts_source_path' (797905) panicked at crates/diffguard-diff/src/unified.rs:838:9:
assertion `left == right` failed
  left: Some("\\a\\h\\w\t \\p\\c\\s\\f\\l\\.\\s")
 right: Some("path/with spaces/file.rs")

failures:
    unified::tests::parse_diff_git_line_parses_paths
    unified::tests::parse_plus_plus_plus_parses_paths
    unified::tests::parse_rename_from_extracts_source_path
    unified::tests::parse_rename_to_extracts_destination_path
    unified::tests::parses_quoted_paths_in_headers
    unified::tests::unescape_git_path_handles_common_escapes
    unified::tests::unescape_git_path_handles_octal_limits_and_control_chars

test result: FAILED. 55 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
