*** crates/diffguard-diff/src/unified.rs:526:13: delete match arm b't' in unescape_git_path

*** mutation diff:
--- crates/diffguard-diff/src/unified.rs
+++ delete match arm b't' in unescape_git_path
@@ -518,17 +518,17 @@
             out.push(b'\\');
             break;
         };
 
         match next {
             b'\\' => out.push(b'\\'),
             b'"' => out.push(b'"'),
             b'n' => out.push(b'\n'),
-            b't' => out.push(b'\t'),
+             /* ~ changed by cargo-mutants ~ */
             b'r' => out.push(b'\r'),
             b' ' => out.push(b' '),
             b'0'..=b'7' => {
                 let mut val = (next - b'0') as u32;
                 for _ in 0..2 {
                     match iter.peek().copied() {
                         Some(d) if (b'0'..=b'7').contains(&d) => {
                             val = val * 8 + (d - b'0') as u32;

---- unified::tests::unescape_git_path_handles_common_escapes stdout ----

thread 'unified::tests::unescape_git_path_handles_common_escapes' (799424) panicked at crates/diffguard-diff/src/unified.rs:990:9:
assertion `left == right` failed
  left: "dir name\"quote\"\\tab\\tnewline\ncarriage\rend"
 right: "dir name\"quote\"\\tab\tnewline\ncarriage\rend"

failures:
    unified::tests::unescape_git_path_handles_common_escapes

test result: FAILED. 61 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
