*** crates/diffguard-diff/src/unified.rs:527:13: delete match arm b'r' in unescape_git_path

*** mutation diff:
--- crates/diffguard-diff/src/unified.rs
+++ delete match arm b'r' in unescape_git_path
@@ -519,17 +519,17 @@
             break;
         };
 
         match next {
             b'\\' => out.push(b'\\'),
             b'"' => out.push(b'"'),
             b'n' => out.push(b'\n'),
             b't' => out.push(b'\t'),
-            b'r' => out.push(b'\r'),
+             /* ~ changed by cargo-mutants ~ */
             b' ' => out.push(b' '),
             b'0'..=b'7' => {
                 let mut val = (next - b'0') as u32;
                 for _ in 0..2 {
                     match iter.peek().copied() {
                         Some(d) if (b'0'..=b'7').contains(&d) => {
                             val = val * 8 + (d - b'0') as u32;
                             iter.next();

---- unified::tests::unescape_git_path_handles_common_escapes stdout ----

thread 'unified::tests::unescape_git_path_handles_common_escapes' (799797) panicked at crates/diffguard-diff/src/unified.rs:990:9:
assertion `left == right` failed
  left: "dir name\"quote\"\\tab\tnewline\ncarriage\\rend"
 right: "dir name\"quote\"\\tab\tnewline\ncarriage\rend"

---- unified::tests::unescape_git_path_handles_octal_limits_and_control_chars stdout ----

thread 'unified::tests::unescape_git_path_handles_octal_limits_and_control_chars' (799798) panicked at crates/diffguard-diff/src/unified.rs:1003:9:
assertion `left == right` failed
  left: [97, 92, 114, 98]
 right: [97, 13, 98]

failures:
    unified::tests::unescape_git_path_handles_common_escapes
    unified::tests::unescape_git_path_handles_octal_limits_and_control_chars

test result: FAILED. 60 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
