*** crates/diffguard-diff/src/unified.rs:528:13: delete match arm b' ' in unescape_git_path

*** mutation diff:
--- crates/diffguard-diff/src/unified.rs
+++ delete match arm b' ' in unescape_git_path
@@ -520,17 +520,17 @@
         };
 
         match next {
             b'\\' => out.push(b'\\'),
             b'"' => out.push(b'"'),
             b'n' => out.push(b'\n'),
             b't' => out.push(b'\t'),
             b'r' => out.push(b'\r'),
-            b' ' => out.push(b' '),
+             /* ~ changed by cargo-mutants ~ */
             b'0'..=b'7' => {
                 let mut val = (next - b'0') as u32;
                 for _ in 0..2 {
                     match iter.peek().copied() {
                         Some(d) if (b'0'..=b'7').contains(&d) => {
                             val = val * 8 + (d - b'0') as u32;
                             iter.next();
                         }

---- unified::tests::parse_diff_git_line_parses_paths stdout ----

thread 'unified::tests::parse_diff_git_line_parses_paths' (800137) panicked at crates/diffguard-diff/src/unified.rs:895:9:
assertion `left == right` failed
  left: Some("dir\\ name/\"file\".rs")
 right: Some("dir name/\"file\".rs")

---- unified::tests::parse_plus_plus_plus_parses_paths stdout ----

thread 'unified::tests::parse_plus_plus_plus_parses_paths' (800141) panicked at crates/diffguard-diff/src/unified.rs:938:9:
assertion `left == right` failed
  left: Some("dir\\ name/\"file\".rs")
 right: Some("dir name/\"file\".rs")

---- unified::tests::unescape_git_path_handles_common_escapes stdout ----

thread 'unified::tests::unescape_git_path_handles_common_escapes' (800170) panicked at crates/diffguard-diff/src/unified.rs:990:9:
assertion `left == right` failed
  left: "dir\\ name\"quote\"\\tab\tnewline\ncarriage\rend"
 right: "dir name\"quote\"\\tab\tnewline\ncarriage\rend"

failures:
    unified::tests::parse_diff_git_line_parses_paths
    unified::tests::parse_plus_plus_plus_parses_paths
    unified::tests::unescape_git_path_handles_common_escapes

test result: FAILED. 59 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
