*** crates/diffguard-diff/src/unified.rs:529:13: delete match arm b'0'..= b'7' in unescape_git_path

*** mutation diff:
--- crates/diffguard-diff/src/unified.rs
+++ delete match arm b'0'..= b'7' in unescape_git_path
@@ -521,29 +521,17 @@
 
         match next {
             b'\\' => out.push(b'\\'),
             b'"' => out.push(b'"'),
             b'n' => out.push(b'\n'),
             b't' => out.push(b'\t'),
             b'r' => out.push(b'\r'),
             b' ' => out.push(b' '),
-            b'0'..=b'7' => {
-                let mut val = (next - b'0') as u32;
-                for _ in 0..2 {
-                    match iter.peek().copied() {
-                        Some(d) if (b'0'..=b'7').contains(&d) => {
-                            val = val * 8 + (d - b'0') as u32;
-                            iter.next();
-                        }
-                        _ => break,
-                    }
-                }
-                out.push((val & 0xFF) as u8);
-            }
+             /* ~ changed by cargo-mutants ~ */
             _ => {
                 out.push(b'\\');
                 out.push(next);
             }
         }
     }
 
     String::from_utf8_lossy(&out).into_owned()

---- unified::tests::unescape_git_path_handles_common_escapes stdout ----

thread 'unified::tests::unescape_git_path_handles_common_escapes' (800537) panicked at crates/diffguard-diff/src/unified.rs:982:9:
assertion `left == right` failed
  left: "octal\\141\\040space"
 right: "octala space"

---- unified::tests::unescape_git_path_handles_octal_limits_and_control_chars stdout ----

thread 'unified::tests::unescape_git_path_handles_octal_limits_and_control_chars' (800538) panicked at crates/diffguard-diff/src/unified.rs:989:9:
assertion `left == right` failed
  left: [92, 55]
 right: [7]

failures:
    unified::tests::unescape_git_path_handles_common_escapes
    unified::tests::unescape_git_path_handles_octal_limits_and_control_chars

test result: FAILED. 60 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
