*** crates/diffguard-diff/src/unified.rs:52:5: replace is_new_file -> bool with true

*** mutation diff:
--- crates/diffguard-diff/src/unified.rs
+++ replace is_new_file -> bool with true
@@ -44,17 +44,17 @@
     line.starts_with("deleted file mode ")
 }
 
 /// Detects if a line indicates a new file mode.
 ///
 /// New files are marked with lines like:
 /// - "new file mode 100644"
 pub fn is_new_file(line: &str) -> bool {
-    line.starts_with("new file mode ")
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 /// Detects if a diff section represents a mode-only change (no content changes).
 ///
 /// Mode-only changes have lines like:
 /// - "old mode 100644"
 /// - "new mode 100755"
 ///

---- unified::tests::is_new_file_rejects_non_new_lines stdout ----

thread 'unified::tests::is_new_file_rejects_non_new_lines' (777451) panicked at crates/diffguard-diff/src/unified.rs:801:9:
assertion failed: !is_new_file("deleted file mode 100644")

failures:
    unified::tests::is_new_file_rejects_non_new_lines

test result: FAILED. 61 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
