*** crates/diffguard-diff/src/unified.rs:52:5: replace is_new_file -> bool with false

*** mutation diff:
--- crates/diffguard-diff/src/unified.rs
+++ replace is_new_file -> bool with false
@@ -44,17 +44,17 @@
     line.starts_with("deleted file mode ")
 }
 
 /// Detects if a line indicates a new file mode.
 ///
 /// New files are marked with lines like:
 /// - "new file mode 100644"
 pub fn is_new_file(line: &str) -> bool {
-    line.starts_with("new file mode ")
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 /// Detects if a diff section represents a mode-only change (no content changes).
 ///
 /// Mode-only changes have lines like:
 /// - "old mode 100644"
 /// - "new mode 100755"
 ///

---- unified::tests::is_new_file_detects_new_mode stdout ----

thread 'unified::tests::is_new_file_detects_new_mode' (777823) panicked at crates/diffguard-diff/src/unified.rs:794:9:
assertion failed: is_new_file("new file mode 100644")

failures:
    unified::tests::is_new_file_detects_new_mode

test result: FAILED. 61 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
