*** crates/diffguard-diff/src/unified.rs:530:37: replace - with / in unescape_git_path

*** mutation diff:
--- crates/diffguard-diff/src/unified.rs
+++ replace - with / in unescape_git_path
@@ -522,17 +522,17 @@
         match next {
             b'\\' => out.push(b'\\'),
             b'"' => out.push(b'"'),
             b'n' => out.push(b'\n'),
             b't' => out.push(b'\t'),
             b'r' => out.push(b'\r'),
             b' ' => out.push(b' '),
             b'0'..=b'7' => {
-                let mut val = (next - b'0') as u32;
+                let mut val = (next / /* ~ changed by cargo-mutants ~ */ b'0') as u32;
                 for _ in 0..2 {
                     match iter.peek().copied() {
                         Some(d) if (b'0'..=b'7').contains(&d) => {
                             val = val * 8 + (d - b'0') as u32;
                             iter.next();
                         }
                         _ => break,
                     }

---- unified::tests::unescape_git_path_handles_common_escapes stdout ----

thread 'unified::tests::unescape_git_path_handles_common_escapes' (801283) panicked at crates/diffguard-diff/src/unified.rs:994:9:
assertion `left == right` failed
  left: "octala`space"
 right: "octala space"

---- unified::tests::unescape_git_path_handles_octal_limits_and_control_chars stdout ----

thread 'unified::tests::unescape_git_path_handles_octal_limits_and_control_chars' (801284) panicked at crates/diffguard-diff/src/unified.rs:1001:9:
assertion `left == right` failed
  left: [1]
 right: [7]

failures:
    unified::tests::unescape_git_path_handles_common_escapes
    unified::tests::unescape_git_path_handles_octal_limits_and_control_chars

test result: FAILED. 60 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
