*** crates/diffguard-diff/src/unified.rs:533:36: replace match guard (b'0'..=b'7').contains(&d) with true in unescape_git_path

*** mutation diff:
--- crates/diffguard-diff/src/unified.rs
+++ replace match guard (b'0'..=b'7').contains(&d) with true in unescape_git_path
@@ -525,17 +525,17 @@
             b'n' => out.push(b'\n'),
             b't' => out.push(b'\t'),
             b'r' => out.push(b'\r'),
             b' ' => out.push(b' '),
             b'0'..=b'7' => {
                 let mut val = (next - b'0') as u32;
                 for _ in 0..2 {
                     match iter.peek().copied() {
-                        Some(d) if (b'0'..=b'7').contains(&d) => {
+                        Some(d) if true /* ~ changed by cargo-mutants ~ */ => {
                             val = val * 8 + (d - b'0') as u32;
                             iter.next();
                         }
                         _ => break,
                     }
                 }
                 out.push((val & 0xFF) as u8);
             }

---- unified::tests::unescape_git_path_handles_octal_limits_and_control_chars stdout ----

thread 'unified::tests::unescape_git_path_handles_octal_limits_and_control_chars' (801657) panicked at crates/diffguard-diff/src/unified.rs:1004:9:
assertion `left == right` failed
  left: [239, 191, 189]
 right: [10, 120]

failures:
    unified::tests::unescape_git_path_handles_octal_limits_and_control_chars

test result: FAILED. 61 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
