*** crates/diffguard-diff/src/unified.rs:540:31: replace & with ^ in unescape_git_path

*** mutation diff:
--- crates/diffguard-diff/src/unified.rs
+++ replace & with ^ in unescape_git_path
@@ -532,17 +532,17 @@
                     match iter.peek().copied() {
                         Some(d) if (b'0'..=b'7').contains(&d) => {
                             val = val * 8 + (d - b'0') as u32;
                             iter.next();
                         }
                         _ => break,
                     }
                 }
-                out.push((val & 0xFF) as u8);
+                out.push((val ^ /* ~ changed by cargo-mutants ~ */ 0xFF) as u8);
             }
             _ => {
                 out.push(b'\\');
                 out.push(next);
             }
         }
     }

---- unified::tests::unescape_git_path_handles_common_escapes stdout ----

thread 'unified::tests::unescape_git_path_handles_common_escapes' (805013) panicked at crates/diffguard-diff/src/unified.rs:994:9:
assertion `left == right` failed
  left: "octal��space"
 right: "octala space"

---- unified::tests::unescape_git_path_handles_octal_limits_and_control_chars stdout ----

thread 'unified::tests::unescape_git_path_handles_octal_limits_and_control_chars' (805014) panicked at crates/diffguard-diff/src/unified.rs:1001:9:
assertion `left == right` failed
  left: [239, 191, 189]
 right: [7]

failures:
    unified::tests::unescape_git_path_handles_common_escapes
    unified::tests::unescape_git_path_handles_octal_limits_and_control_chars

test result: FAILED. 60 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
