*** crates/diffguard-diff/src/unified.rs:66:35: replace || with && in is_mode_change_only

*** mutation diff:
--- crates/diffguard-diff/src/unified.rs
+++ replace || with && in is_mode_change_only
@@ -58,17 +58,17 @@
 /// - "old mode 100644"
 /// - "new mode 100755"
 ///
 /// This function checks for the "old mode" marker which indicates a mode change.
 /// A mode-only change is one where only the file permissions changed, not the content.
 ///
 /// Requirements: 4.4
 pub fn is_mode_change_only(line: &str) -> bool {
-    line.starts_with("old mode ") || line.starts_with("new mode ")
+    line.starts_with("old mode ") && /* ~ changed by cargo-mutants ~ */ line.starts_with("new mode ")
 }
 
 /// Parses a rename line and extracts the source path.
 ///
 /// Rename lines look like:
 /// - "rename from path/to/old/file.rs"
 ///
 /// Returns the path after "rename from " if the line matches, None otherwise.

---- unified::tests::is_mode_change_only_detects_mode_changes stdout ----

thread 'unified::tests::is_mode_change_only_detects_mode_changes' (778940) panicked at crates/diffguard-diff/src/unified.rs:809:9:
assertion failed: is_mode_change_only("old mode 100644")

failures:
    unified::tests::is_mode_change_only_detects_mode_changes

test result: FAILED. 61 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
