*** crates/diffguard-diff/src/unified.rs:66:5: replace is_mode_change_only -> bool with true

*** mutation diff:
--- crates/diffguard-diff/src/unified.rs
+++ replace is_mode_change_only -> bool with true
@@ -58,17 +58,17 @@
 /// - "old mode 100644"
 /// - "new mode 100755"
 ///
 /// This function checks for the "old mode" marker which indicates a mode change.
 /// A mode-only change is one where only the file permissions changed, not the content.
 ///
 /// Requirements: 4.4
 pub fn is_mode_change_only(line: &str) -> bool {
-    line.starts_with("old mode ") || line.starts_with("new mode ")
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 /// Parses a rename line and extracts the source path.
 ///
 /// Rename lines look like:
 /// - "rename from path/to/old/file.rs"
 ///
 /// Returns the path after "rename from " if the line matches, None otherwise.

---- unified::tests::continues_after_malformed_hunk_header stdout ----

thread 'unified::tests::continues_after_malformed_hunk_header' (778176) panicked at crates/diffguard-diff/src/unified.rs:1229:9:
assertion `left == right` failed
  left: 0
 right: 1

---- unified::tests::binary_file_added_from_dev_null stdout ----

thread 'unified::tests::binary_file_added_from_dev_null' (778175) panicked at crates/diffguard-diff/src/unified.rs:1303:9:
assertion `left == right` failed
  left: 0
 right: 1

---- unified::tests::deleted_scope_includes_deleted_files stdout ----

thread 'unified::tests::deleted_scope_includes_deleted_files' (778177) panicked at crates/diffguard-diff/src/unified.rs:1102:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    unified::tests::binary_file_added_from_dev_null
    unified::tests::continues_after_malformed_hunk_header
    unified::tests::deleted_scope_includes_deleted_files
    unified::tests::handles_mixed_unicode_and_ascii
    unified::tests::handles_multiple_special_cases_in_one_diff
    unified::tests::handles_unicode_emojis_in_diff
    unified::tests::handles_unicode_in_added_lines
    unified::tests::handles_unicode_in_changed_lines
    unified::tests::handles_unicode_in_file_paths
    unified::tests::handles_unicode_special_characters
    unified::tests::ignores_lines_outside_hunks
    unified::tests::is_mode_change_only_rejects_non_mode_lines

test result: FAILED. 36 passed; 26 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
