*** crates/diffguard-diff/src/unified.rs:78:5: replace parse_rename_from -> Option<String> with None

*** mutation diff:
--- crates/diffguard-diff/src/unified.rs
+++ replace parse_rename_from -> Option<String> with None
@@ -70,18 +70,17 @@
 ///
 /// Rename lines look like:
 /// - "rename from path/to/old/file.rs"
 ///
 /// Returns the path after "rename from " if the line matches, None otherwise.
 ///
 /// Requirements: 4.3
 pub fn parse_rename_from(line: &str) -> Option<String> {
-    let rest = line.strip_prefix("rename from ")?;
-    parse_rename_path(rest)
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 /// Parses a rename line and extracts the destination path.
 ///
 /// Rename lines look like:
 /// - "rename to path/to/new/file.rs"
 ///
 /// Returns the path after "rename to " if the line matches, None otherwise.

---- unified::tests::parse_rename_from_extracts_source_path stdout ----

thread 'unified::tests::parse_rename_from_extracts_source_path' (779326) panicked at crates/diffguard-diff/src/unified.rs:825:9:
assertion `left == right` failed
  left: None
 right: Some("src/old/path.rs")

failures:
    unified::tests::parse_rename_from_extracts_source_path

test result: FAILED. 61 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
