*** crates/diffguard-diff/src/unified.rs:91:5: replace parse_rename_to -> Option<String> with None

*** mutation diff:
--- crates/diffguard-diff/src/unified.rs
+++ replace parse_rename_to -> Option<String> with None
@@ -83,18 +83,17 @@
 ///
 /// Rename lines look like:
 /// - "rename to path/to/new/file.rs"
 ///
 /// Returns the path after "rename to " if the line matches, None otherwise.
 ///
 /// Requirements: 4.3
 pub fn parse_rename_to(line: &str) -> Option<String> {
-    let rest = line.strip_prefix("rename to ")?;
-    parse_rename_path(rest)
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 #[derive(Debug, Clone, PartialEq, Eq)]
 pub struct DiffLine {
     pub path: String,
     pub line: u32,
     pub content: String,
     pub kind: ChangeKind,

---- unified::tests::parse_rename_to_extracts_destination_path stdout ----

thread 'unified::tests::parse_rename_to_extracts_destination_path' (780448) panicked at crates/diffguard-diff/src/unified.rs:858:9:
assertion `left == right` failed
  left: None
 right: Some("src/new/path.rs")

failures:
    unified::tests::parse_rename_to_extracts_destination_path

test result: FAILED. 61 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
