*** crates/diffguard-diff/src/unified.rs:91:5: replace parse_rename_to -> Option<String> with Some("xyzzy".into())

*** mutation diff:
--- crates/diffguard-diff/src/unified.rs
+++ replace parse_rename_to -> Option<String> with Some("xyzzy".into())
@@ -83,18 +83,17 @@
 ///
 /// Rename lines look like:
 /// - "rename to path/to/new/file.rs"
 ///
 /// Returns the path after "rename to " if the line matches, None otherwise.
 ///
 /// Requirements: 4.3
 pub fn parse_rename_to(line: &str) -> Option<String> {
-    let rest = line.strip_prefix("rename to ")?;
-    parse_rename_path(rest)
+    Some("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[derive(Debug, Clone, PartialEq, Eq)]
 pub struct DiffLine {
     pub path: String,
     pub line: u32,
     pub content: String,
     pub kind: ChangeKind,

---- unified::tests::binary_file_added_from_dev_null stdout ----

thread 'unified::tests::binary_file_added_from_dev_null' (781159) panicked at crates/diffguard-diff/src/unified.rs:1302:9:
assertion `left == right` failed
  left: 0
 right: 1

---- unified::tests::deleted_scope_includes_deleted_files stdout ----

thread 'unified::tests::deleted_scope_includes_deleted_files' (781161) panicked at crates/diffguard-diff/src/unified.rs:1101:9:
assertion `left == right` failed
  left: 0
 right: 1

---- unified::tests::continues_after_malformed_hunk_header stdout ----

thread 'unified::tests::continues_after_malformed_hunk_header' (781160) panicked at crates/diffguard-diff/src/unified.rs:1228:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    unified::tests::binary_file_added_from_dev_null
    unified::tests::continues_after_malformed_hunk_header
    unified::tests::deleted_scope_includes_deleted_files
    unified::tests::handles_mixed_unicode_and_ascii
    unified::tests::handles_multiple_special_cases_in_one_diff
    unified::tests::handles_unicode_emojis_in_diff
    unified::tests::handles_unicode_in_added_lines
    unified::tests::handles_unicode_in_changed_lines
    unified::tests::handles_unicode_in_file_paths
    unified::tests::handles_unicode_special_characters
    unified::tests::ignores_lines_outside_hunks
    unified::tests::parse_rename_to_extracts_destination_path

test result: FAILED. 35 passed; 27 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
