*** crates/diffguard-domain/src/evaluate.rs:122:36: replace != with == in evaluate_lines_with_overrides_and_language

*** mutation diff:
--- crates/diffguard-domain/src/evaluate.rs
+++ replace != with == in evaluate_lines_with_overrides_and_language
@@ -114,17 +114,17 @@
             .map(|lang| match lang.parse::<Language>() {
                 Ok(parsed) => parsed,
                 Err(infallible) => match infallible {},
             });
 
     let mut suppression_tracker = SuppressionTracker::new();
     let mut prepared_lines: Vec<PreparedLine> = Vec::with_capacity(input_lines.len());
     for input in input_lines {
-        if current_file.as_deref() != Some(&input.path) {
+        if current_file.as_deref() == /* ~ changed by cargo-mutants ~ */ Some(&input.path) {
             current_file = Some(input.path.clone());
             current_lang = if let Some(forced_lang) = forced_language_enum {
                 forced_lang
             } else {
                 let path = std::path::Path::new(&input.path);
                 detect_language(path)
                     .map(|s| s.parse::<Language>().unwrap_or(Language::Unknown))
                     .unwrap_or(Language::Unknown)

---- evaluate::tests::language_changes_between_files stdout ----

thread 'evaluate::tests::language_changes_between_files' (1523716) panicked at crates/diffguard-domain/src/evaluate.rs:914:9:
assertion `left == right` failed
  left: 2
 right: 1

---- evaluate::tests::suppression_resets_on_file_change stdout ----

thread 'evaluate::tests::suppression_resets_on_file_change' (1523727) panicked at crates/diffguard-domain/src/evaluate.rs:1224:9:
assertion `left == right` failed
  left: 0
 right: 1

---- evaluate::tests::go_backtick_raw_string_ignored_with_language_aware_preprocessing stdout ----

thread 'evaluate::tests::go_backtick_raw_string_ignored_with_language_aware_preprocessing' (1523714) panicked at crates/diffguard-domain/src/evaluate.rs:873:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    evaluate::tests::go_backtick_raw_string_ignored_with_language_aware_preprocessing
    evaluate::tests::javascript_template_literal_ignored_with_language_aware_preprocessing
    evaluate::tests::language_changes_between_files
    evaluate::tests::python_hash_comment_ignored_with_language_aware_preprocessing
    evaluate::tests::suppression_resets_on_file_change

test result: FAILED. 288 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
