*** crates/diffguard-domain/src/evaluate.rs:177:16: delete ! in evaluate_lines_with_overrides_and_language

*** mutation diff:
--- crates/diffguard-domain/src/evaluate.rs
+++ delete ! in evaluate_lines_with_overrides_and_language
@@ -169,17 +169,17 @@
             continue;
         }
 
         let path_ref = std::path::Path::new(path);
         let lang = prepared_lines[file_indices[0]].lang.as_deref();
         let mut per_rule_events = vec![Vec::<MatchEvent>::new(); rules.len()];
 
         for (rule_idx, rule) in rules.iter().enumerate() {
-            if !rule.applies_to(path_ref, lang) {
+            if  /* ~ changed by cargo-mutants ~ */rule.applies_to(path_ref, lang) {
                 continue;
             }
 
             let resolved_override = overrides.map(|m| m.resolve(path, &rule.id));
             if resolved_override.is_some_and(|resolved| !resolved.enabled) {
                 continue;
             }

---- evaluate::tests::caps_findings_but_keeps_counts stdout ----

thread 'evaluate::tests::caps_findings_but_keeps_counts' (1524549) panicked at crates/diffguard-domain/src/evaluate.rs:738:9:
assertion `left == right` failed
  left: 0
 right: 5

---- evaluate::tests::absent_mode_emits_when_pattern_missing stdout ----

thread 'evaluate::tests::absent_mode_emits_when_pattern_missing' (1524546) panicked at crates/diffguard-domain/src/evaluate.rs:1522:9:
assertion `left == right` failed
  left: 0
 right: 1

---- evaluate::tests::finds_unwrap_in_added_line stdout ----

thread 'evaluate::tests::finds_unwrap_in_added_line' (1524555) panicked at crates/diffguard-domain/src/evaluate.rs:653:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    evaluate::tests::absent_mode_emits_when_pattern_missing
    evaluate::tests::caps_findings_but_keeps_counts
    evaluate::tests::dependency_gates_secondary_rule
    evaluate::tests::directory_overrides_can_change_severity_or_disable_rule
    evaluate::tests::escalation_patterns_raise_effective_severity
    evaluate::tests::finds_unwrap_in_added_line
    evaluate::tests::forced_language_override_applies_to_unknown_extension
    evaluate::tests::language_changes_between_files
    evaluate::tests::multiline_rule_matches_across_consecutive_lines
    evaluate::tests::python_print_detected_outside_comment
    evaluate::tests::rule_hits_track_emitted_and_suppressed
    evaluate::tests::skips_rules_that_do_not_apply_to_language

test result: FAILED. 273 passed; 20 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
