*** crates/diffguard-domain/src/evaluate.rs:182:57: delete ! in evaluate_lines_with_overrides_and_language

*** mutation diff:
--- crates/diffguard-domain/src/evaluate.rs
+++ delete ! in evaluate_lines_with_overrides_and_language
@@ -174,17 +174,17 @@
         let mut per_rule_events = vec![Vec::<MatchEvent>::new(); rules.len()];
 
         for (rule_idx, rule) in rules.iter().enumerate() {
             if !rule.applies_to(path_ref, lang) {
                 continue;
             }
 
             let resolved_override = overrides.map(|m| m.resolve(path, &rule.id));
-            if resolved_override.is_some_and(|resolved| !resolved.enabled) {
+            if resolved_override.is_some_and(|resolved|  /* ~ changed by cargo-mutants ~ */resolved.enabled) {
                 continue;
             }
 
             let base_severity = resolved_override
                 .and_then(|resolved| resolved.severity)
                 .unwrap_or(rule.severity);
 
             let rule_matches = match rule.match_mode {

---- evaluate::tests::directory_overrides_can_change_severity_or_disable_rule stdout ----

thread 'evaluate::tests::directory_overrides_can_change_severity_or_disable_rule' (1525376) panicked at crates/diffguard-domain/src/evaluate.rs:1413:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    evaluate::tests::directory_overrides_can_change_severity_or_disable_rule

test result: FAILED. 292 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
