*** crates/diffguard-domain/src/evaluate.rs:240:16: delete ! in evaluate_lines_with_overrides_and_language

*** mutation diff:
--- crates/diffguard-domain/src/evaluate.rs
+++ delete ! in evaluate_lines_with_overrides_and_language
@@ -232,17 +232,17 @@
             per_rule_events[rule_idx] = converted;
         }
 
         let active_rule_ids = resolve_dependency_gated_rule_ids(rules, &per_rule_events);
         for (rule_idx, mut matched) in per_rule_events.into_iter().enumerate() {
             if matched.is_empty() {
                 continue;
             }
-            if !active_rule_ids.contains(&rules[rule_idx].id) {
+            if  /* ~ changed by cargo-mutants ~ */active_rule_ids.contains(&rules[rule_idx].id) {
                 continue;
             }
             events.append(&mut matched);
         }
     }
 
     events.sort_by(|a, b| {
         a.anchor_idx

---- evaluate::tests::caps_findings_but_keeps_counts stdout ----

thread 'evaluate::tests::caps_findings_but_keeps_counts' (1526196) panicked at crates/diffguard-domain/src/evaluate.rs:738:9:
assertion `left == right` failed
  left: 0
 right: 5

---- evaluate::tests::finds_unwrap_in_added_line stdout ----

thread 'evaluate::tests::finds_unwrap_in_added_line' (1526202) panicked at crates/diffguard-domain/src/evaluate.rs:653:9:
assertion `left == right` failed
  left: 0
 right: 1

---- evaluate::tests::directory_overrides_can_change_severity_or_disable_rule stdout ----

thread 'evaluate::tests::directory_overrides_can_change_severity_or_disable_rule' (1526199) panicked at crates/diffguard-domain/src/evaluate.rs:1412:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    evaluate::tests::absent_mode_emits_when_pattern_missing
    evaluate::tests::caps_findings_but_keeps_counts
    evaluate::tests::dependency_gates_secondary_rule
    evaluate::tests::directory_overrides_can_change_severity_or_disable_rule
    evaluate::tests::escalation_patterns_raise_effective_severity
    evaluate::tests::finds_unwrap_in_added_line
    evaluate::tests::forced_language_override_applies_to_unknown_extension
    evaluate::tests::language_changes_between_files
    evaluate::tests::multiline_rule_matches_across_consecutive_lines
    evaluate::tests::python_print_detected_outside_comment
    evaluate::tests::rule_hits_track_emitted_and_suppressed
    evaluate::tests::suppression_ignore_all_directive

test result: FAILED. 274 passed; 19 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
