*** crates/diffguard-domain/src/evaluate.rs:288:27: replace < with == in evaluate_lines_with_overrides_and_language

*** mutation diff:
--- crates/diffguard-domain/src/evaluate.rs
+++ replace < with == in evaluate_lines_with_overrides_and_language
@@ -280,17 +280,17 @@
         bump_counts(&mut counts, event.severity);
         stat.emitted = stat.emitted.saturating_add(1);
         match event.severity {
             Severity::Info => stat.info = stat.info.saturating_add(1),
             Severity::Warn => stat.warn = stat.warn.saturating_add(1),
             Severity::Error => stat.error = stat.error.saturating_add(1),
         }
 
-        if findings.len() < max_findings {
+        if findings.len() == /* ~ changed by cargo-mutants ~ */ max_findings {
             let column = event
                 .match_start
                 .and_then(|start| byte_to_column(&prepared.line.content, start))
                 .map(|c| c as u32);
             findings.push(Finding {
                 rule_id: rule.id.clone(),
                 severity: event.severity,
                 message: rule.message.clone(),

---- evaluate::tests::caps_findings_but_keeps_counts stdout ----

thread 'evaluate::tests::caps_findings_but_keeps_counts' (1527054) panicked at crates/diffguard-domain/src/evaluate.rs:739:9:
assertion `left == right` failed
  left: 0
 right: 2

---- evaluate::tests::finds_unwrap_in_added_line stdout ----

thread 'evaluate::tests::finds_unwrap_in_added_line' (1527060) panicked at crates/diffguard-domain/src/evaluate.rs:654:9:
assertion `left == right` failed
  left: 0
 right: 1

---- evaluate::tests::forced_language_override_applies_to_unknown_extension stdout ----

thread 'evaluate::tests::forced_language_override_applies_to_unknown_extension' (1527062) panicked at crates/diffguard-domain/src/evaluate.rs:946:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    evaluate::tests::absent_mode_emits_when_pattern_missing
    evaluate::tests::caps_findings_but_keeps_counts
    evaluate::tests::directory_overrides_can_change_severity_or_disable_rule
    evaluate::tests::escalation_patterns_raise_effective_severity
    evaluate::tests::finds_unwrap_in_added_line
    evaluate::tests::forced_language_override_applies_to_unknown_extension
    evaluate::tests::language_changes_between_files
    evaluate::tests::multiline_rule_matches_across_consecutive_lines
    evaluate::tests::python_print_detected_outside_comment
    evaluate::tests::suppression_next_line_does_not_affect_third_line
    evaluate::tests::suppression_resets_on_file_change
    evaluate::tests::suppression_wrong_rule_does_not_suppress

test result: FAILED. 281 passed; 12 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
