*** crates/diffguard-domain/src/evaluate.rs:288:27: replace < with <= in evaluate_lines_with_overrides_and_language

*** mutation diff:
--- crates/diffguard-domain/src/evaluate.rs
+++ replace < with <= in evaluate_lines_with_overrides_and_language
@@ -280,17 +280,17 @@
         bump_counts(&mut counts, event.severity);
         stat.emitted = stat.emitted.saturating_add(1);
         match event.severity {
             Severity::Info => stat.info = stat.info.saturating_add(1),
             Severity::Warn => stat.warn = stat.warn.saturating_add(1),
             Severity::Error => stat.error = stat.error.saturating_add(1),
         }
 
-        if findings.len() < max_findings {
+        if findings.len() <= /* ~ changed by cargo-mutants ~ */ max_findings {
             let column = event
                 .match_start
                 .and_then(|start| byte_to_column(&prepared.line.content, start))
                 .map(|c| c as u32);
             findings.push(Finding {
                 rule_id: rule.id.clone(),
                 severity: event.severity,
                 message: rule.message.clone(),

---- evaluate::tests::caps_findings_but_keeps_counts stdout ----

thread 'evaluate::tests::caps_findings_but_keeps_counts' (1528758) panicked at crates/diffguard-domain/src/evaluate.rs:739:9:
assertion `left == right` failed
  left: 3
 right: 2

failures:
    evaluate::tests::caps_findings_but_keeps_counts

test result: FAILED. 292 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
