*** crates/diffguard-domain/src/evaluate.rs:322:5: replace resolve_dependency_gated_rule_ids -> BTreeSet<String> with BTreeSet::new()

*** mutation diff:
--- crates/diffguard-domain/src/evaluate.rs
+++ replace resolve_dependency_gated_rule_ids -> BTreeSet<String> with BTreeSet::new()
@@ -314,51 +314,17 @@
         rule_hits: per_rule_hits.into_values().collect(),
     }
 }
 
 fn resolve_dependency_gated_rule_ids(
     rules: &[CompiledRule],
     per_rule_events: &[Vec<MatchEvent>],
 ) -> BTreeSet<String> {
-    let mut active_rule_ids = rules
-        .iter()
-        .enumerate()
-        .filter(|(idx, _)| !per_rule_events[*idx].is_empty())
-        .map(|(_, rule)| rule.id.clone())
-        .collect::<BTreeSet<_>>();
-
-    loop {
-        let mut removed_any = false;
-        let mut removed_ids = Vec::new();
-        for rule in rules {
-            if !active_rule_ids.contains(&rule.id) {
-                continue;
-            }
-            if rule
-                .depends_on
-                .iter()
-                .any(|dependency| !active_rule_ids.contains(dependency))
-            {
-                removed_ids.push(rule.id.clone());
-            }
-        }
-
-        for id in removed_ids {
-            if active_rule_ids.remove(&id) {
-                removed_any = true;
-            }
-        }
-
-        if !removed_any {
-            break;
-        }
-    }
-
-    active_rule_ids
+    BTreeSet::new() /* ~ changed by cargo-mutants ~ */
 }
 
 fn find_positive_matches_for_rule(
     rule: &CompiledRule,
     file_indices: &[usize],
     prepared_lines: &[PreparedLine],
 ) -> Vec<RawMatchEvent> {
     let mut events = if rule.multiline {

---- evaluate::tests::caps_findings_but_keeps_counts stdout ----

thread 'evaluate::tests::caps_findings_but_keeps_counts' (1529574) panicked at crates/diffguard-domain/src/evaluate.rs:704:9:
assertion `left == right` failed
  left: 0
 right: 5

---- evaluate::tests::directory_overrides_can_change_severity_or_disable_rule stdout ----

thread 'evaluate::tests::directory_overrides_can_change_severity_or_disable_rule' (1529577) panicked at crates/diffguard-domain/src/evaluate.rs:1378:9:
assertion `left == right` failed
  left: 0
 right: 1

---- evaluate::tests::finds_unwrap_in_added_line stdout ----

thread 'evaluate::tests::finds_unwrap_in_added_line' (1529580) panicked at crates/diffguard-domain/src/evaluate.rs:619:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    evaluate::tests::absent_mode_emits_when_pattern_missing
    evaluate::tests::caps_findings_but_keeps_counts
    evaluate::tests::dependency_gates_secondary_rule
    evaluate::tests::directory_overrides_can_change_severity_or_disable_rule
    evaluate::tests::escalation_patterns_raise_effective_severity
    evaluate::tests::finds_unwrap_in_added_line
    evaluate::tests::forced_language_override_applies_to_unknown_extension
    evaluate::tests::language_changes_between_files
    evaluate::tests::multiline_rule_matches_across_consecutive_lines
    evaluate::tests::python_print_detected_outside_comment
    evaluate::tests::rule_hits_track_emitted_and_suppressed
    evaluate::tests::suppression_ignore_all_directive

test result: FAILED. 274 passed; 19 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
