*** crates/diffguard-domain/src/evaluate.rs:333:16: delete ! in resolve_dependency_gated_rule_ids

*** mutation diff:
--- crates/diffguard-domain/src/evaluate.rs
+++ delete ! in resolve_dependency_gated_rule_ids
@@ -325,17 +325,17 @@
         .filter(|(idx, _)| !per_rule_events[*idx].is_empty())
         .map(|(_, rule)| rule.id.clone())
         .collect::<BTreeSet<_>>();
 
     loop {
         let mut removed_any = false;
         let mut removed_ids = Vec::new();
         for rule in rules {
-            if !active_rule_ids.contains(&rule.id) {
+            if  /* ~ changed by cargo-mutants ~ */active_rule_ids.contains(&rule.id) {
                 continue;
             }
             if rule
                 .depends_on
                 .iter()
                 .any(|dependency| !active_rule_ids.contains(dependency))
             {
                 removed_ids.push(rule.id.clone());

---- evaluate::tests::dependency_gates_secondary_rule stdout ----

thread 'evaluate::tests::dependency_gates_secondary_rule' (1533022) panicked at crates/diffguard-domain/src/evaluate.rs:1685:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    evaluate::tests::dependency_gates_secondary_rule

test result: FAILED. 292 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
