*** crates/diffguard-domain/src/evaluate.rs:339:35: delete ! in resolve_dependency_gated_rule_ids

*** mutation diff:
--- crates/diffguard-domain/src/evaluate.rs
+++ delete ! in resolve_dependency_gated_rule_ids
@@ -331,17 +331,17 @@
         let mut removed_ids = Vec::new();
         for rule in rules {
             if !active_rule_ids.contains(&rule.id) {
                 continue;
             }
             if rule
                 .depends_on
                 .iter()
-                .any(|dependency| !active_rule_ids.contains(dependency))
+                .any(|dependency|  /* ~ changed by cargo-mutants ~ */active_rule_ids.contains(dependency))
             {
                 removed_ids.push(rule.id.clone());
             }
         }
 
         for id in removed_ids {
             if active_rule_ids.remove(&id) {
                 removed_any = true;

---- evaluate::tests::dependency_gates_secondary_rule stdout ----

thread 'evaluate::tests::dependency_gates_secondary_rule' (1533855) panicked at crates/diffguard-domain/src/evaluate.rs:1685:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    evaluate::tests::dependency_gates_secondary_rule

test result: FAILED. 292 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
