*** crates/diffguard-domain/src/evaluate.rs:364:5: replace find_positive_matches_for_rule -> Vec<RawMatchEvent> with vec![]

*** mutation diff:
--- crates/diffguard-domain/src/evaluate.rs
+++ replace find_positive_matches_for_rule -> Vec<RawMatchEvent> with vec![]
@@ -356,29 +356,17 @@
     active_rule_ids
 }
 
 fn find_positive_matches_for_rule(
     rule: &CompiledRule,
     file_indices: &[usize],
     prepared_lines: &[PreparedLine],
 ) -> Vec<RawMatchEvent> {
-    let mut events = if rule.multiline {
-        find_multiline_matches(rule, file_indices, prepared_lines)
-    } else {
-        find_single_line_matches(rule, file_indices, prepared_lines)
-    };
-
-    if !rule.context_patterns.is_empty() {
-        events.retain(|event| {
-            has_required_context(rule, file_indices, event.anchor_file_pos, prepared_lines)
-        });
-    }
-
-    events
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn find_single_line_matches(
     rule: &CompiledRule,
     file_indices: &[usize],
     prepared_lines: &[PreparedLine],
 ) -> Vec<RawMatchEvent> {
     let mut out = Vec::new();

---- evaluate::tests::caps_findings_but_keeps_counts stdout ----

thread 'evaluate::tests::caps_findings_but_keeps_counts' (1535430) panicked at crates/diffguard-domain/src/evaluate.rs:726:9:
assertion `left == right` failed
  left: 0
 right: 5

---- evaluate::tests::forced_language_override_applies_to_unknown_extension stdout ----

thread 'evaluate::tests::forced_language_override_applies_to_unknown_extension' (1535438) panicked at crates/diffguard-domain/src/evaluate.rs:933:9:
assertion `left == right` failed
  left: 0
 right: 1

---- evaluate::tests::finds_unwrap_in_added_line stdout ----

thread 'evaluate::tests::finds_unwrap_in_added_line' (1535436) panicked at crates/diffguard-domain/src/evaluate.rs:641:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    evaluate::tests::caps_findings_but_keeps_counts
    evaluate::tests::dependency_gates_secondary_rule
    evaluate::tests::directory_overrides_can_change_severity_or_disable_rule
    evaluate::tests::escalation_patterns_raise_effective_severity
    evaluate::tests::finds_unwrap_in_added_line
    evaluate::tests::forced_language_override_applies_to_unknown_extension
    evaluate::tests::language_changes_between_files
    evaluate::tests::multiline_rule_matches_across_consecutive_lines
    evaluate::tests::python_print_detected_outside_comment
    evaluate::tests::rule_hits_track_emitted_and_suppressed
    evaluate::tests::suppression_ignore_all_directive
    evaluate::tests::suppression_multiple_rules_on_same_line

test result: FAILED. 275 passed; 18 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
