*** crates/diffguard-domain/src/evaluate.rs:370:8: delete ! in find_positive_matches_for_rule

*** mutation diff:
--- crates/diffguard-domain/src/evaluate.rs
+++ delete ! in find_positive_matches_for_rule
@@ -362,17 +362,17 @@
     prepared_lines: &[PreparedLine],
 ) -> Vec<RawMatchEvent> {
     let mut events = if rule.multiline {
         find_multiline_matches(rule, file_indices, prepared_lines)
     } else {
         find_single_line_matches(rule, file_indices, prepared_lines)
     };
 
-    if !rule.context_patterns.is_empty() {
+    if  /* ~ changed by cargo-mutants ~ */rule.context_patterns.is_empty() {
         events.retain(|event| {
             has_required_context(rule, file_indices, event.anchor_file_pos, prepared_lines)
         });
     }
 
     events
 }

---- evaluate::tests::context_patterns_require_nearby_match stdout ----

thread 'evaluate::tests::context_patterns_require_nearby_match' (1536287) panicked at crates/diffguard-domain/src/evaluate.rs:1573:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    evaluate::tests::context_patterns_require_nearby_match

test result: FAILED. 292 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
