*** crates/diffguard-domain/src/evaluate.rs:384:5: replace find_single_line_matches -> Vec<RawMatchEvent> with vec![]

*** mutation diff:
--- crates/diffguard-domain/src/evaluate.rs
+++ replace find_single_line_matches -> Vec<RawMatchEvent> with vec![]
@@ -376,29 +376,17 @@
     events
 }
 
 fn find_single_line_matches(
     rule: &CompiledRule,
     file_indices: &[usize],
     prepared_lines: &[PreparedLine],
 ) -> Vec<RawMatchEvent> {
-    let mut out = Vec::new();
-    for (file_pos, global_idx) in file_indices.iter().copied().enumerate() {
-        let line = &prepared_lines[global_idx];
-        let candidate = candidate_line_for_rule(rule, line);
-        if let Some((start, end)) = first_match(&rule.patterns, candidate) {
-            out.push(RawMatchEvent {
-                anchor_file_pos: file_pos,
-                match_start: Some(start),
-                match_text: safe_slice(&line.line.content, start, end),
-            });
-        }
-    }
-    out
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn find_multiline_matches(
     rule: &CompiledRule,
     file_indices: &[usize],
     prepared_lines: &[PreparedLine],
 ) -> Vec<RawMatchEvent> {
     if file_indices.len() < 2 {

---- evaluate::tests::caps_findings_but_keeps_counts stdout ----

thread 'evaluate::tests::caps_findings_but_keeps_counts' (1537141) panicked at crates/diffguard-domain/src/evaluate.rs:726:9:
assertion `left == right` failed
  left: 0
 right: 5

---- evaluate::tests::directory_overrides_can_change_severity_or_disable_rule stdout ----

thread 'evaluate::tests::directory_overrides_can_change_severity_or_disable_rule' (1537144) panicked at crates/diffguard-domain/src/evaluate.rs:1400:9:
assertion `left == right` failed
  left: 0
 right: 1

---- evaluate::tests::finds_unwrap_in_added_line stdout ----

thread 'evaluate::tests::finds_unwrap_in_added_line' (1537147) panicked at crates/diffguard-domain/src/evaluate.rs:641:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    evaluate::tests::caps_findings_but_keeps_counts
    evaluate::tests::dependency_gates_secondary_rule
    evaluate::tests::directory_overrides_can_change_severity_or_disable_rule
    evaluate::tests::escalation_patterns_raise_effective_severity
    evaluate::tests::finds_unwrap_in_added_line
    evaluate::tests::forced_language_override_applies_to_unknown_extension
    evaluate::tests::language_changes_between_files
    evaluate::tests::python_print_detected_outside_comment
    evaluate::tests::rule_hits_track_emitted_and_suppressed
    evaluate::tests::suppression_ignore_all_directive
    evaluate::tests::suppression_multiple_rules_on_same_line
    evaluate::tests::suppression_next_line_does_not_affect_third_line

test result: FAILED. 276 passed; 17 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
