*** crates/diffguard-domain/src/evaluate.rs:404:27: replace < with <= in find_multiline_matches

*** mutation diff:
--- crates/diffguard-domain/src/evaluate.rs
+++ replace < with <= in find_multiline_matches
@@ -396,17 +396,17 @@
     out
 }
 
 fn find_multiline_matches(
     rule: &CompiledRule,
     file_indices: &[usize],
     prepared_lines: &[PreparedLine],
 ) -> Vec<RawMatchEvent> {
-    if file_indices.len() < 2 {
+    if file_indices.len() <= /* ~ changed by cargo-mutants ~ */ 2 {
         return Vec::new();
     }
 
     let mut seen = BTreeSet::<(usize, usize, String)>::new();
     let mut out = Vec::new();
 
     for start in 0..file_indices.len() {
         let end = (start + rule.multiline_window).min(file_indices.len());

---- evaluate::tests::multiline_rule_matches_across_consecutive_lines stdout ----

thread 'evaluate::tests::multiline_rule_matches_across_consecutive_lines' (1540634) panicked at crates/diffguard-domain/src/evaluate.rs:1478:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    evaluate::tests::multiline_rule_matches_across_consecutive_lines

test result: FAILED. 292 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
