*** crates/diffguard-domain/src/evaluate.rs:404:5: replace find_multiline_matches -> Vec<RawMatchEvent> with vec![]

*** mutation diff:
--- crates/diffguard-domain/src/evaluate.rs
+++ replace find_multiline_matches -> Vec<RawMatchEvent> with vec![]
@@ -396,76 +396,17 @@
     out
 }
 
 fn find_multiline_matches(
     rule: &CompiledRule,
     file_indices: &[usize],
     prepared_lines: &[PreparedLine],
 ) -> Vec<RawMatchEvent> {
-    if file_indices.len() < 2 {
-        return Vec::new();
-    }
-
-    let mut seen = BTreeSet::<(usize, usize, String)>::new();
-    let mut out = Vec::new();
-
-    for start in 0..file_indices.len() {
-        let end = (start + rule.multiline_window).min(file_indices.len());
-        if end.saturating_sub(start) < 2 {
-            continue;
-        }
-
-        let mut joined_candidate = String::new();
-        let mut joined_raw = String::new();
-        let mut offsets = Vec::with_capacity(end - start);
-        let mut cursor = 0usize;
-
-        for (pos, idx) in file_indices
-            .iter()
-            .copied()
-            .enumerate()
-            .take(end)
-            .skip(start)
-        {
-            offsets.push(cursor);
-            let line = &prepared_lines[idx];
-            let candidate = candidate_line_for_rule(rule, line);
-
-            joined_candidate.push_str(candidate);
-            joined_raw.push_str(&line.line.content);
-            cursor = cursor.saturating_add(candidate.len());
-
-            if pos + 1 < end {
-                joined_candidate.push('\n');
-                joined_raw.push('\n');
-                cursor = cursor.saturating_add(1);
-            }
-        }
-
-        if let Some((m_start, m_end)) = first_match(&rule.patterns, &joined_candidate) {
-            let rel = offsets
-                .partition_point(|offset| *offset <= m_start)
-                .saturating_sub(1);
-            let anchor_file_pos = start + rel;
-            let start_in_line = m_start.saturating_sub(offsets[rel]);
-            let match_text = safe_slice(&joined_raw, m_start, m_end);
-            let dedupe_key = (anchor_file_pos, start_in_line, match_text.clone());
-
-            if seen.insert(dedupe_key) {
-                out.push(RawMatchEvent {
-                    anchor_file_pos,
-                    match_start: Some(start_in_line),
-                    match_text,
-                });
-            }
-        }
-    }
-
-    out
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn has_required_context(
     rule: &CompiledRule,
     file_indices: &[usize],
     anchor_file_pos: usize,
     prepared_lines: &[PreparedLine],
 ) -> bool {

---- evaluate::tests::multiline_rule_matches_across_consecutive_lines stdout ----

thread 'evaluate::tests::multiline_rule_matches_across_consecutive_lines' (1538032) panicked at crates/diffguard-domain/src/evaluate.rs:1419:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    evaluate::tests::multiline_rule_matches_across_consecutive_lines

test result: FAILED. 292 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
