*** crates/diffguard-domain/src/evaluate.rs:413:38: replace < with == in find_multiline_matches

*** mutation diff:
--- crates/diffguard-domain/src/evaluate.rs
+++ replace < with == in find_multiline_matches
@@ -405,17 +405,17 @@
         return Vec::new();
     }
 
     let mut seen = BTreeSet::<(usize, usize, String)>::new();
     let mut out = Vec::new();
 
     for start in 0..file_indices.len() {
         let end = (start + rule.multiline_window).min(file_indices.len());
-        if end.saturating_sub(start) < 2 {
+        if end.saturating_sub(start) == /* ~ changed by cargo-mutants ~ */ 2 {
             continue;
         }
 
         let mut joined_candidate = String::new();
         let mut joined_raw = String::new();
         let mut offsets = Vec::with_capacity(end - start);
         let mut cursor = 0usize;

---- evaluate::tests::multiline_rule_matches_across_consecutive_lines stdout ----

thread 'evaluate::tests::multiline_rule_matches_across_consecutive_lines' (1543131) panicked at crates/diffguard-domain/src/evaluate.rs:1478:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    evaluate::tests::multiline_rule_matches_across_consecutive_lines

test result: FAILED. 292 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
