*** crates/diffguard-domain/src/evaluate.rs:413:38: replace < with > in find_multiline_matches

*** mutation diff:
--- crates/diffguard-domain/src/evaluate.rs
+++ replace < with > in find_multiline_matches
@@ -405,17 +405,17 @@
         return Vec::new();
     }
 
     let mut seen = BTreeSet::<(usize, usize, String)>::new();
     let mut out = Vec::new();
 
     for start in 0..file_indices.len() {
         let end = (start + rule.multiline_window).min(file_indices.len());
-        if end.saturating_sub(start) < 2 {
+        if end.saturating_sub(start) > /* ~ changed by cargo-mutants ~ */ 2 {
             continue;
         }
 
         let mut joined_candidate = String::new();
         let mut joined_raw = String::new();
         let mut offsets = Vec::with_capacity(end - start);
         let mut cursor = 0usize;

*** result: Success
