*** crates/diffguard-domain/src/evaluate.rs:437:24: replace < with == in find_multiline_matches

*** mutation diff:
--- crates/diffguard-domain/src/evaluate.rs
+++ replace < with == in find_multiline_matches
@@ -429,17 +429,17 @@
             offsets.push(cursor);
             let line = &prepared_lines[idx];
             let candidate = candidate_line_for_rule(rule, line);
 
             joined_candidate.push_str(candidate);
             joined_raw.push_str(&line.line.content);
             cursor = cursor.saturating_add(candidate.len());
 
-            if pos + 1 < end {
+            if pos + 1 == /* ~ changed by cargo-mutants ~ */ end {
                 joined_candidate.push('\n');
                 joined_raw.push('\n');
                 cursor = cursor.saturating_add(1);
             }
         }
 
         if let Some((m_start, m_end)) = first_match(&rule.patterns, &joined_candidate) {
             let rel = offsets

---- evaluate::tests::multiline_rule_matches_across_consecutive_lines stdout ----

thread 'evaluate::tests::multiline_rule_matches_across_consecutive_lines' (1545703) panicked at crates/diffguard-domain/src/evaluate.rs:1478:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    evaluate::tests::multiline_rule_matches_across_consecutive_lines

test result: FAILED. 292 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
