*** crates/diffguard-domain/src/evaluate.rs:446:51: replace <= with > in find_multiline_matches

*** mutation diff:
--- crates/diffguard-domain/src/evaluate.rs
+++ replace <= with > in find_multiline_matches
@@ -438,17 +438,17 @@
                 joined_candidate.push('\n');
                 joined_raw.push('\n');
                 cursor = cursor.saturating_add(1);
             }
         }
 
         if let Some((m_start, m_end)) = first_match(&rule.patterns, &joined_candidate) {
             let rel = offsets
-                .partition_point(|offset| *offset <= m_start)
+                .partition_point(|offset| *offset > /* ~ changed by cargo-mutants ~ */ m_start)
                 .saturating_sub(1);
             let anchor_file_pos = start + rel;
             let start_in_line = m_start.saturating_sub(offsets[rel]);
             let match_text = safe_slice(&joined_raw, m_start, m_end);
             let dedupe_key = (anchor_file_pos, start_in_line, match_text.clone());
 
             if seen.insert(dedupe_key) {
                 out.push(RawMatchEvent {

---- evaluate::tests::multiline_rule_matches_across_consecutive_lines stdout ----

thread 'evaluate::tests::multiline_rule_matches_across_consecutive_lines' (1550039) panicked at crates/diffguard-domain/src/evaluate.rs:1480:9:
assertion `left == right` failed
  left: 11
 right: 10

failures:
    evaluate::tests::multiline_rule_matches_across_consecutive_lines

test result: FAILED. 292 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
