*** crates/diffguard-domain/src/evaluate.rs:448:41: replace + with - in find_multiline_matches

*** mutation diff:
--- crates/diffguard-domain/src/evaluate.rs
+++ replace + with - in find_multiline_matches
@@ -440,17 +440,17 @@
                 cursor = cursor.saturating_add(1);
             }
         }
 
         if let Some((m_start, m_end)) = first_match(&rule.patterns, &joined_candidate) {
             let rel = offsets
                 .partition_point(|offset| *offset <= m_start)
                 .saturating_sub(1);
-            let anchor_file_pos = start + rel;
+            let anchor_file_pos = start - /* ~ changed by cargo-mutants ~ */ rel;
             let start_in_line = m_start.saturating_sub(offsets[rel]);
             let match_text = safe_slice(&joined_raw, m_start, m_end);
             let dedupe_key = (anchor_file_pos, start_in_line, match_text.clone());
 
             if seen.insert(dedupe_key) {
                 out.push(RawMatchEvent {
                     anchor_file_pos,
                     match_start: Some(start_in_line),

*** result: Success
