*** crates/diffguard-domain/src/evaluate.rs:472:5: replace has_required_context -> bool with true

*** mutation diff:
--- crates/diffguard-domain/src/evaluate.rs
+++ replace has_required_context -> bool with true
@@ -464,30 +464,17 @@
 }
 
 fn has_required_context(
     rule: &CompiledRule,
     file_indices: &[usize],
     anchor_file_pos: usize,
     prepared_lines: &[PreparedLine],
 ) -> bool {
-    if rule.context_patterns.is_empty() {
-        return true;
-    }
-
-    let start = anchor_file_pos.saturating_sub(rule.context_window);
-    let end = (anchor_file_pos + rule.context_window + 1).min(file_indices.len());
-    for idx in file_indices[start..end].iter().copied() {
-        let candidate = candidate_line_for_rule(rule, &prepared_lines[idx]);
-        if first_match(&rule.context_patterns, candidate).is_some() {
-            return true;
-        }
-    }
-
-    false
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn maybe_escalate_severity(
     rule: &CompiledRule,
     file_indices: &[usize],
     anchor_file_pos: usize,
     prepared_lines: &[PreparedLine],
     base: Severity,

---- evaluate::tests::context_patterns_require_nearby_match stdout ----

thread 'evaluate::tests::context_patterns_require_nearby_match' (1552694) panicked at crates/diffguard-domain/src/evaluate.rs:1560:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    evaluate::tests::context_patterns_require_nearby_match

test result: FAILED. 292 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
