*** crates/diffguard-domain/src/evaluate.rs:472:5: replace has_required_context -> bool with false

*** mutation diff:
--- crates/diffguard-domain/src/evaluate.rs
+++ replace has_required_context -> bool with false
@@ -464,30 +464,17 @@
 }
 
 fn has_required_context(
     rule: &CompiledRule,
     file_indices: &[usize],
     anchor_file_pos: usize,
     prepared_lines: &[PreparedLine],
 ) -> bool {
-    if rule.context_patterns.is_empty() {
-        return true;
-    }
-
-    let start = anchor_file_pos.saturating_sub(rule.context_window);
-    let end = (anchor_file_pos + rule.context_window + 1).min(file_indices.len());
-    for idx in file_indices[start..end].iter().copied() {
-        let candidate = candidate_line_for_rule(rule, &prepared_lines[idx]);
-        if first_match(&rule.context_patterns, candidate).is_some() {
-            return true;
-        }
-    }
-
-    false
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn maybe_escalate_severity(
     rule: &CompiledRule,
     file_indices: &[usize],
     anchor_file_pos: usize,
     prepared_lines: &[PreparedLine],
     base: Severity,

*** result: Success
