*** crates/diffguard-domain/src/evaluate.rs:477:32: replace + with - in has_required_context

*** mutation diff:
--- crates/diffguard-domain/src/evaluate.rs
+++ replace + with - in has_required_context
@@ -469,17 +469,17 @@
     anchor_file_pos: usize,
     prepared_lines: &[PreparedLine],
 ) -> bool {
     if rule.context_patterns.is_empty() {
         return true;
     }
 
     let start = anchor_file_pos.saturating_sub(rule.context_window);
-    let end = (anchor_file_pos + rule.context_window + 1).min(file_indices.len());
+    let end = (anchor_file_pos - /* ~ changed by cargo-mutants ~ */ rule.context_window + 1).min(file_indices.len());
     for idx in file_indices[start..end].iter().copied() {
         let candidate = candidate_line_for_rule(rule, &prepared_lines[idx]);
         if first_match(&rule.context_patterns, candidate).is_some() {
             return true;
         }
     }
 
     false

---- evaluate::tests::context_patterns_require_nearby_match stdout ----

thread 'evaluate::tests::context_patterns_require_nearby_match' (1556298) panicked at crates/diffguard-domain/src/evaluate.rs:477:16:
attempt to subtract with overflow

failures:
    evaluate::tests::context_patterns_require_nearby_match

test result: FAILED. 292 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
