*** crates/diffguard-domain/src/evaluate.rs:500:32: replace + with - in maybe_escalate_severity

*** mutation diff:
--- crates/diffguard-domain/src/evaluate.rs
+++ replace + with - in maybe_escalate_severity
@@ -492,17 +492,17 @@
     prepared_lines: &[PreparedLine],
     base: Severity,
 ) -> Severity {
     if rule.escalate_patterns.is_empty() {
         return base;
     }
 
     let start = anchor_file_pos.saturating_sub(rule.escalate_window);
-    let end = (anchor_file_pos + rule.escalate_window + 1).min(file_indices.len());
+    let end = (anchor_file_pos - /* ~ changed by cargo-mutants ~ */ rule.escalate_window + 1).min(file_indices.len());
     let should_escalate = file_indices[start..end].iter().copied().any(|idx| {
         let candidate = candidate_line_for_rule(rule, &prepared_lines[idx]);
         first_match(&rule.escalate_patterns, candidate).is_some()
     });
 
     if !should_escalate {
         return base;
     }

*** result: Success
