*** crates/diffguard-domain/src/evaluate.rs:500:55: replace + with - in maybe_escalate_severity

*** mutation diff:
--- crates/diffguard-domain/src/evaluate.rs
+++ replace + with - in maybe_escalate_severity
@@ -492,17 +492,17 @@
     prepared_lines: &[PreparedLine],
     base: Severity,
 ) -> Severity {
     if rule.escalate_patterns.is_empty() {
         return base;
     }
 
     let start = anchor_file_pos.saturating_sub(rule.escalate_window);
-    let end = (anchor_file_pos + rule.escalate_window + 1).min(file_indices.len());
+    let end = (anchor_file_pos + rule.escalate_window - /* ~ changed by cargo-mutants ~ */ 1).min(file_indices.len());
     let should_escalate = file_indices[start..end].iter().copied().any(|idx| {
         let candidate = candidate_line_for_rule(rule, &prepared_lines[idx]);
         first_match(&rule.escalate_patterns, candidate).is_some()
     });
 
     if !should_escalate {
         return base;
     }

---- evaluate::tests::escalation_patterns_raise_effective_severity stdout ----

thread 'evaluate::tests::escalation_patterns_raise_effective_severity' (1558089) panicked at crates/diffguard-domain/src/evaluate.rs:500:15:
attempt to subtract with overflow

failures:
    evaluate::tests::escalation_patterns_raise_effective_severity

test result: FAILED. 292 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
