*** crates/diffguard-domain/src/evaluate.rs:506:8: delete ! in maybe_escalate_severity

*** mutation diff:
--- crates/diffguard-domain/src/evaluate.rs
+++ delete ! in maybe_escalate_severity
@@ -498,17 +498,17 @@
 
     let start = anchor_file_pos.saturating_sub(rule.escalate_window);
     let end = (anchor_file_pos + rule.escalate_window + 1).min(file_indices.len());
     let should_escalate = file_indices[start..end].iter().copied().any(|idx| {
         let candidate = candidate_line_for_rule(rule, &prepared_lines[idx]);
         first_match(&rule.escalate_patterns, candidate).is_some()
     });
 
-    if !should_escalate {
+    if  /* ~ changed by cargo-mutants ~ */should_escalate {
         return base;
     }
 
     let target = rule.escalate_to.unwrap_or(Severity::Error);
     max_severity(base, target)
 }
 
 fn candidate_line_for_rule<'a>(rule: &CompiledRule, line: &'a PreparedLine) -> &'a str {

---- evaluate::tests::escalation_patterns_raise_effective_severity stdout ----

thread 'evaluate::tests::escalation_patterns_raise_effective_severity' (1561655) panicked at crates/diffguard-domain/src/evaluate.rs:1615:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    evaluate::tests::escalation_patterns_raise_effective_severity

test result: FAILED. 292 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
