*** crates/diffguard-domain/src/evaluate.rs:515:5: replace candidate_line_for_rule -> &'a str with "xyzzy"

*** mutation diff:
--- crates/diffguard-domain/src/evaluate.rs
+++ replace candidate_line_for_rule -> &'a str with "xyzzy"
@@ -507,22 +507,17 @@
         return base;
     }
 
     let target = rule.escalate_to.unwrap_or(Severity::Error);
     max_severity(base, target)
 }
 
 fn candidate_line_for_rule<'a>(rule: &CompiledRule, line: &'a PreparedLine) -> &'a str {
-    match (rule.ignore_comments, rule.ignore_strings) {
-        (true, true) => line.masked_both.as_str(),
-        (true, false) => line.masked_comments.as_str(),
-        (false, true) => line.masked_strings.as_str(),
-        (false, false) => line.line.content.as_str(),
-    }
+    "xyzzy" /* ~ changed by cargo-mutants ~ */
 }
 
 fn max_severity(a: Severity, b: Severity) -> Severity {
     fn rank(s: Severity) -> u8 {
         match s {
             Severity::Info => 0,
             Severity::Warn => 1,
             Severity::Error => 2,

---- evaluate::tests::finds_unwrap_in_added_line stdout ----

thread 'evaluate::tests::finds_unwrap_in_added_line' (1563287) panicked at crates/diffguard-domain/src/evaluate.rs:648:9:
assertion `left == right` failed
  left: 0
 right: 1

---- evaluate::tests::directory_overrides_can_change_severity_or_disable_rule stdout ----

thread 'evaluate::tests::directory_overrides_can_change_severity_or_disable_rule' (1563284) panicked at crates/diffguard-domain/src/evaluate.rs:1407:9:
assertion `left == right` failed
  left: 0
 right: 1

---- evaluate::tests::forced_language_override_applies_to_unknown_extension stdout ----

thread 'evaluate::tests::forced_language_override_applies_to_unknown_extension' (1563289) panicked at crates/diffguard-domain/src/evaluate.rs:940:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    evaluate::tests::dependency_gates_secondary_rule
    evaluate::tests::directory_overrides_can_change_severity_or_disable_rule
    evaluate::tests::escalation_patterns_raise_effective_severity
    evaluate::tests::finds_unwrap_in_added_line
    evaluate::tests::forced_language_override_applies_to_unknown_extension
    evaluate::tests::language_changes_between_files
    evaluate::tests::multiline_rule_matches_across_consecutive_lines
    evaluate::tests::python_print_detected_outside_comment
    evaluate::tests::rule_hits_track_emitted_and_suppressed
    evaluate::tests::suppression_ignore_all_directive
    evaluate::tests::suppression_multiple_rules_on_same_line
    evaluate::tests::suppression_next_line_does_not_affect_third_line

test result: FAILED. 276 passed; 17 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
