*** crates/diffguard-domain/src/evaluate.rs:524:5: replace candidate_line_for_rule -> &'a str with ""

*** mutation diff:
--- crates/diffguard-domain/src/evaluate.rs
+++ replace candidate_line_for_rule -> &'a str with ""
@@ -516,22 +516,17 @@
         return base;
     }
 
     let target = rule.escalate_to.unwrap_or(Severity::Error);
     max_severity(base, target)
 }
 
 fn candidate_line_for_rule<'a>(rule: &CompiledRule, line: &'a PreparedLine) -> &'a str {
-    match (rule.ignore_comments, rule.ignore_strings) {
-        (true, true) => line.masked_both.as_str(),
-        (true, false) => line.masked_comments.as_str(),
-        (false, true) => line.masked_strings.as_str(),
-        (false, false) => line.line.content.as_str(),
-    }
+    "" /* ~ changed by cargo-mutants ~ */
 }
 
 fn max_severity(a: Severity, b: Severity) -> Severity {
     fn rank(s: Severity) -> u8 {
         match s {
             Severity::Info => 0,
             Severity::Warn => 1,
             Severity::Error => 2,

---- evaluate::tests::caps_findings_but_keeps_counts stdout ----

thread 'evaluate::tests::caps_findings_but_keeps_counts' (828089) panicked at crates/diffguard-domain/src/evaluate.rs:742:9:
assertion `left == right` failed
  left: 0
 right: 5

---- evaluate::tests::directory_overrides_can_change_severity_or_disable_rule stdout ----

thread 'evaluate::tests::directory_overrides_can_change_severity_or_disable_rule' (828092) panicked at crates/diffguard-domain/src/evaluate.rs:1416:9:
assertion `left == right` failed
  left: 0
 right: 1

---- evaluate::tests::finds_unwrap_in_added_line stdout ----

thread 'evaluate::tests::finds_unwrap_in_added_line' (828095) panicked at crates/diffguard-domain/src/evaluate.rs:657:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    evaluate::tests::caps_findings_but_keeps_counts
    evaluate::tests::dependency_gates_secondary_rule
    evaluate::tests::directory_overrides_can_change_severity_or_disable_rule
    evaluate::tests::escalation_patterns_raise_effective_severity
    evaluate::tests::finds_unwrap_in_added_line
    evaluate::tests::forced_language_override_applies_to_unknown_extension
    evaluate::tests::language_changes_between_files
    evaluate::tests::multiline_rule_matches_across_consecutive_lines
    evaluate::tests::python_print_detected_outside_comment
    evaluate::tests::rule_hits_track_emitted_and_suppressed
    evaluate::tests::suppression_ignore_all_directive
    evaluate::tests::suppression_multiple_rules_on_same_line

test result: FAILED. 267 passed; 18 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
