*** crates/diffguard-domain/src/evaluate.rs:525:9: replace max_severity::rank -> u8 with 0

*** mutation diff:
--- crates/diffguard-domain/src/evaluate.rs
+++ replace max_severity::rank -> u8 with 0
@@ -517,21 +517,17 @@
         (true, false) => line.masked_comments.as_str(),
         (false, true) => line.masked_strings.as_str(),
         (false, false) => line.line.content.as_str(),
     }
 }
 
 fn max_severity(a: Severity, b: Severity) -> Severity {
     fn rank(s: Severity) -> u8 {
-        match s {
-            Severity::Info => 0,
-            Severity::Warn => 1,
-            Severity::Error => 2,
-        }
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     if rank(a) >= rank(b) { a } else { b }
 }
 
 fn first_match(patterns: &[regex::Regex], s: &str) -> Option<(usize, usize)> {
     for p in patterns {
         if let Some(m) = p.find(s) {

---- evaluate::tests::escalation_patterns_raise_effective_severity stdout ----

thread 'evaluate::tests::escalation_patterns_raise_effective_severity' (1564121) panicked at crates/diffguard-domain/src/evaluate.rs:1611:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    evaluate::tests::escalation_patterns_raise_effective_severity

test result: FAILED. 292 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
