*** crates/diffguard-domain/src/evaluate.rs:532:16: replace >= with < in max_severity

*** mutation diff:
--- crates/diffguard-domain/src/evaluate.rs
+++ replace >= with < in max_severity
@@ -524,17 +524,17 @@
     fn rank(s: Severity) -> u8 {
         match s {
             Severity::Info => 0,
             Severity::Warn => 1,
             Severity::Error => 2,
         }
     }
 
-    if rank(a) >= rank(b) { a } else { b }
+    if rank(a) < /* ~ changed by cargo-mutants ~ */ rank(b) { a } else { b }
 }
 
 fn first_match(patterns: &[regex::Regex], s: &str) -> Option<(usize, usize)> {
     for p in patterns {
         if let Some(m) = p.find(s) {
             return Some((m.start(), m.end()));
         }
     }

---- evaluate::tests::escalation_patterns_raise_effective_severity stdout ----

thread 'evaluate::tests::escalation_patterns_raise_effective_severity' (1565759) panicked at crates/diffguard-domain/src/evaluate.rs:1615:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    evaluate::tests::escalation_patterns_raise_effective_severity

test result: FAILED. 292 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
