*** crates/diffguard-domain/src/evaluate.rs:536:5: replace first_match -> Option<(usize, usize)> with Some((0, 0))

*** mutation diff:
--- crates/diffguard-domain/src/evaluate.rs
+++ replace first_match -> Option<(usize, usize)> with Some((0, 0))
@@ -528,22 +528,17 @@
             Severity::Error => 2,
         }
     }
 
     if rank(a) >= rank(b) { a } else { b }
 }
 
 fn first_match(patterns: &[regex::Regex], s: &str) -> Option<(usize, usize)> {
-    for p in patterns {
-        if let Some(m) = p.find(s) {
-            return Some((m.start(), m.end()));
-        }
-    }
-    None
+    Some((0, 0)) /* ~ changed by cargo-mutants ~ */
 }
 
 fn bump_counts(counts: &mut VerdictCounts, severity: Severity) {
     match severity {
         Severity::Info => counts.info = counts.info.saturating_add(1),
         Severity::Warn => counts.warn = counts.warn.saturating_add(1),
         Severity::Error => counts.error = counts.error.saturating_add(1),
     }

---- evaluate::tests::first_match_returns_none_for_empty_patterns stdout ----

thread 'evaluate::tests::first_match_returns_none_for_empty_patterns' (1567422) panicked at crates/diffguard-domain/src/evaluate.rs:1336:9:
assertion `left == right` failed
  left: Some((0, 0))
 right: None

---- evaluate::tests::does_not_match_in_comment_when_ignored stdout ----

thread 'evaluate::tests::does_not_match_in_comment_when_ignored' (1567419) panicked at crates/diffguard-domain/src/evaluate.rs:708:9:
assertion `left == right` failed
  left: 1
 right: 0

---- evaluate::tests::absent_mode_emits_when_pattern_missing stdout ----

thread 'evaluate::tests::absent_mode_emits_when_pattern_missing' (1567412) panicked at crates/diffguard-domain/src/evaluate.rs:1517:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    evaluate::tests::absent_mode_emits_when_pattern_missing
    evaluate::tests::context_patterns_require_nearby_match
    evaluate::tests::dependency_gates_secondary_rule
    evaluate::tests::does_not_match_in_comment_when_ignored
    evaluate::tests::first_match_returns_none_for_empty_patterns
    evaluate::tests::go_backtick_raw_string_ignored_with_language_aware_preprocessing
    evaluate::tests::javascript_template_literal_ignored_with_language_aware_preprocessing
    evaluate::tests::language_changes_between_files
    evaluate::tests::python_hash_comment_ignored_with_language_aware_preprocessing
    evaluate::tests::suppression_next_line_does_not_affect_third_line
    evaluate::tests::suppression_next_line_ignores_rule
    evaluate::tests::suppression_resets_on_file_change

test result: FAILED. 281 passed; 12 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
