*** crates/diffguard-domain/src/evaluate.rs:545:5: replace first_match -> Option<(usize, usize)> with None

*** mutation diff:
--- crates/diffguard-domain/src/evaluate.rs
+++ replace first_match -> Option<(usize, usize)> with None
@@ -537,22 +537,17 @@
             Severity::Error => 2,
         }
     }
 
     if rank(a) >= rank(b) { a } else { b }
 }
 
 fn first_match(patterns: &[regex::Regex], s: &str) -> Option<(usize, usize)> {
-    for p in patterns {
-        if let Some(m) = p.find(s) {
-            return Some((m.start(), m.end()));
-        }
-    }
-    None
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn bump_counts(counts: &mut VerdictCounts, severity: Severity) {
     match severity {
         Severity::Info => counts.info = counts.info.saturating_add(1),
         Severity::Warn => counts.warn = counts.warn.saturating_add(1),
         Severity::Error => counts.error = counts.error.saturating_add(1),
     }

---- evaluate::tests::caps_findings_but_keeps_counts stdout ----

thread 'evaluate::tests::caps_findings_but_keeps_counts' (833266) panicked at crates/diffguard-domain/src/evaluate.rs:742:9:
assertion `left == right` failed
  left: 0
 right: 5

---- evaluate::tests::directory_overrides_can_change_severity_or_disable_rule stdout ----

thread 'evaluate::tests::directory_overrides_can_change_severity_or_disable_rule' (833269) panicked at crates/diffguard-domain/src/evaluate.rs:1416:9:
assertion `left == right` failed
  left: 0
 right: 1

---- evaluate::tests::finds_unwrap_in_added_line stdout ----

thread 'evaluate::tests::finds_unwrap_in_added_line' (833272) panicked at crates/diffguard-domain/src/evaluate.rs:657:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    evaluate::tests::caps_findings_but_keeps_counts
    evaluate::tests::dependency_gates_secondary_rule
    evaluate::tests::directory_overrides_can_change_severity_or_disable_rule
    evaluate::tests::escalation_patterns_raise_effective_severity
    evaluate::tests::finds_unwrap_in_added_line
    evaluate::tests::forced_language_override_applies_to_unknown_extension
    evaluate::tests::language_changes_between_files
    evaluate::tests::multiline_rule_matches_across_consecutive_lines
    evaluate::tests::python_print_detected_outside_comment
    evaluate::tests::rule_hits_track_emitted_and_suppressed
    evaluate::tests::suppression_ignore_all_directive
    evaluate::tests::suppression_multiple_rules_on_same_line

test result: FAILED. 267 passed; 18 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
