*** crates/diffguard-domain/src/evaluate.rs:545:5: replace bump_counts with ()

*** mutation diff:
--- crates/diffguard-domain/src/evaluate.rs
+++ replace bump_counts with ()
@@ -537,21 +537,17 @@
         if let Some(m) = p.find(s) {
             return Some((m.start(), m.end()));
         }
     }
     None
 }
 
 fn bump_counts(counts: &mut VerdictCounts, severity: Severity) {
-    match severity {
-        Severity::Info => counts.info = counts.info.saturating_add(1),
-        Severity::Warn => counts.warn = counts.warn.saturating_add(1),
-        Severity::Error => counts.error = counts.error.saturating_add(1),
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 fn trim_snippet(s: &str) -> String {
     let trimmed = s.trim_end();
     const MAX_CHARS: usize = 240;
 
     // Avoid slicing by byte indices (which can panic on Unicode boundaries).
     let mut out = String::new();

---- evaluate::tests::bump_counts_increments_all_severities stdout ----

thread 'evaluate::tests::bump_counts_increments_all_severities' (1570652) panicked at crates/diffguard-domain/src/evaluate.rs:1347:9:
assertion `left == right` failed
  left: 0
 right: 1

---- evaluate::tests::directory_overrides_can_change_severity_or_disable_rule stdout ----

thread 'evaluate::tests::directory_overrides_can_change_severity_or_disable_rule' (1570657) panicked at crates/diffguard-domain/src/evaluate.rs:1408:9:
assertion `left == right` failed
  left: 0
 right: 1

---- evaluate::tests::caps_findings_but_keeps_counts stdout ----

thread 'evaluate::tests::caps_findings_but_keeps_counts' (1570654) panicked at crates/diffguard-domain/src/evaluate.rs:734:9:
assertion `left == right` failed
  left: 0
 right: 5

failures:
    evaluate::tests::absent_mode_emits_when_pattern_missing
    evaluate::tests::bump_counts_increments_all_severities
    evaluate::tests::caps_findings_but_keeps_counts
    evaluate::tests::dependency_gates_secondary_rule
    evaluate::tests::directory_overrides_can_change_severity_or_disable_rule
    evaluate::tests::escalation_patterns_raise_effective_severity
    evaluate::tests::finds_unwrap_in_added_line
    evaluate::tests::forced_language_override_applies_to_unknown_extension
    evaluate::tests::language_changes_between_files
    evaluate::tests::multiline_rule_matches_across_consecutive_lines
    evaluate::tests::python_print_detected_outside_comment
    evaluate::tests::suppression_next_line_does_not_affect_third_line

test result: FAILED. 279 passed; 14 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
