*** crates/diffguard-domain/src/evaluate.rs:553:5: replace trim_snippet -> String with "xyzzy".into()

*** mutation diff:
--- crates/diffguard-domain/src/evaluate.rs
+++ replace trim_snippet -> String with "xyzzy".into()
@@ -545,29 +545,17 @@
     match severity {
         Severity::Info => counts.info = counts.info.saturating_add(1),
         Severity::Warn => counts.warn = counts.warn.saturating_add(1),
         Severity::Error => counts.error = counts.error.saturating_add(1),
     }
 }
 
 fn trim_snippet(s: &str) -> String {
-    let trimmed = s.trim_end();
-    const MAX_CHARS: usize = 240;
-
-    // Avoid slicing by byte indices (which can panic on Unicode boundaries).
-    let mut out = String::new();
-    for (i, ch) in trimmed.chars().enumerate() {
-        if i >= MAX_CHARS {
-            out.push('…');
-            break;
-        }
-        out.push(ch);
-    }
-    out
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 fn safe_slice(s: &str, start: usize, end: usize) -> String {
     let end = end.min(s.len());
     let start = start.min(end);
     s.get(start..end).unwrap_or("").to_string()
 }

---- evaluate::tests::trim_snippet_truncates_and_appends_ellipsis stdout ----

thread 'evaluate::tests::trim_snippet_truncates_and_appends_ellipsis' (1572308) panicked at crates/diffguard-domain/src/evaluate.rs:736:9:
assertion failed: trimmed.ends_with('…')

failures:
    evaluate::tests::trim_snippet_truncates_and_appends_ellipsis

test result: FAILED. 292 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
