*** crates/diffguard-domain/src/evaluate.rs:559:14: replace >= with < in trim_snippet

*** mutation diff:
--- crates/diffguard-domain/src/evaluate.rs
+++ replace >= with < in trim_snippet
@@ -551,17 +551,17 @@
 
 fn trim_snippet(s: &str) -> String {
     let trimmed = s.trim_end();
     const MAX_CHARS: usize = 240;
 
     // Avoid slicing by byte indices (which can panic on Unicode boundaries).
     let mut out = String::new();
     for (i, ch) in trimmed.chars().enumerate() {
-        if i >= MAX_CHARS {
+        if i < /* ~ changed by cargo-mutants ~ */ MAX_CHARS {
             out.push('…');
             break;
         }
         out.push(ch);
     }
     out
 }

---- evaluate::tests::trim_snippet_truncates_and_appends_ellipsis stdout ----

thread 'evaluate::tests::trim_snippet_truncates_and_appends_ellipsis' (1573122) panicked at crates/diffguard-domain/src/evaluate.rs:749:9:
assertion `left == right` failed
  left: 1
 right: 241

failures:
    evaluate::tests::trim_snippet_truncates_and_appends_ellipsis

test result: FAILED. 292 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
