*** crates/diffguard-domain/src/evaluate.rs:569:5: replace safe_slice -> String with String::new()

*** mutation diff:
--- crates/diffguard-domain/src/evaluate.rs
+++ replace safe_slice -> String with String::new()
@@ -561,19 +561,17 @@
             break;
         }
         out.push(ch);
     }
     out
 }
 
 fn safe_slice(s: &str, start: usize, end: usize) -> String {
-    let end = end.min(s.len());
-    let start = start.min(end);
-    s.get(start..end).unwrap_or("").to_string()
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 fn byte_to_column(s: &str, byte_idx: usize) -> Option<usize> {
     if byte_idx > s.len() {
         return None;
     }
     Some(s[..byte_idx].chars().count() + 1)
 }

---- evaluate::tests::safe_slice_clamps_and_slices stdout ----

thread 'evaluate::tests::safe_slice_clamps_and_slices' (1573926) panicked at crates/diffguard-domain/src/evaluate.rs:1321:9:
assertion `left == right` failed
  left: ""
 right: "bc"

failures:
    evaluate::tests::safe_slice_clamps_and_slices

test result: FAILED. 292 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
