*** crates/diffguard-domain/src/evaluate.rs:575:17: replace > with == in byte_to_column

*** mutation diff:
--- crates/diffguard-domain/src/evaluate.rs
+++ replace > with == in byte_to_column
@@ -567,17 +567,17 @@
 
 fn safe_slice(s: &str, start: usize, end: usize) -> String {
     let end = end.min(s.len());
     let start = start.min(end);
     s.get(start..end).unwrap_or("").to_string()
 }
 
 fn byte_to_column(s: &str, byte_idx: usize) -> Option<usize> {
-    if byte_idx > s.len() {
+    if byte_idx == /* ~ changed by cargo-mutants ~ */ s.len() {
         return None;
     }
     Some(s[..byte_idx].chars().count() + 1)
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;

---- evaluate::tests::byte_to_column_counts_chars stdout ----

thread 'evaluate::tests::byte_to_column_counts_chars' (1578001) panicked at crates/diffguard-domain/src/evaluate.rs:1334:9:
assertion `left == right` failed
  left: None
 right: Some(4)

failures:
    evaluate::tests::byte_to_column_counts_chars

test result: FAILED. 292 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
