*** crates/diffguard-domain/src/evaluate.rs:575:5: replace byte_to_column -> Option<usize> with None

*** mutation diff:
--- crates/diffguard-domain/src/evaluate.rs
+++ replace byte_to_column -> Option<usize> with None
@@ -567,20 +567,17 @@
 
 fn safe_slice(s: &str, start: usize, end: usize) -> String {
     let end = end.min(s.len());
     let start = start.min(end);
     s.get(start..end).unwrap_or("").to_string()
 }
 
 fn byte_to_column(s: &str, byte_idx: usize) -> Option<usize> {
-    if byte_idx > s.len() {
-        return None;
-    }
-    Some(s[..byte_idx].chars().count() + 1)
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::rules::compile_rules;
     use crate::{DirectoryRuleOverride, RuleOverrideMatcher};
     use diffguard_types::{MatchMode, RuleConfig};

---- evaluate::tests::byte_to_column_counts_chars stdout ----

thread 'evaluate::tests::byte_to_column_counts_chars' (1575537) panicked at crates/diffguard-domain/src/evaluate.rs:1328:9:
assertion `left == right` failed
  left: None
 right: Some(1)

---- evaluate::tests::finds_unwrap_in_added_line stdout ----

thread 'evaluate::tests::finds_unwrap_in_added_line' (1575544) panicked at crates/diffguard-domain/src/evaluate.rs:653:9:
assertion failed: eval.findings[0].column.is_some()

failures:
    evaluate::tests::byte_to_column_counts_chars
    evaluate::tests::finds_unwrap_in_added_line

test result: FAILED. 291 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
