*** crates/diffguard-domain/src/evaluate.rs:575:5: replace byte_to_column -> Option<usize> with Some(0)

*** mutation diff:
--- crates/diffguard-domain/src/evaluate.rs
+++ replace byte_to_column -> Option<usize> with Some(0)
@@ -567,20 +567,17 @@
 
 fn safe_slice(s: &str, start: usize, end: usize) -> String {
     let end = end.min(s.len());
     let start = start.min(end);
     s.get(start..end).unwrap_or("").to_string()
 }
 
 fn byte_to_column(s: &str, byte_idx: usize) -> Option<usize> {
-    if byte_idx > s.len() {
-        return None;
-    }
-    Some(s[..byte_idx].chars().count() + 1)
+    Some(0) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::rules::compile_rules;
     use crate::{DirectoryRuleOverride, RuleOverrideMatcher};
     use diffguard_types::{MatchMode, RuleConfig};

---- evaluate::tests::byte_to_column_counts_chars stdout ----

thread 'evaluate::tests::byte_to_column_counts_chars' (1576351) panicked at crates/diffguard-domain/src/evaluate.rs:1328:9:
assertion `left == right` failed
  left: Some(0)
 right: Some(1)

failures:
    evaluate::tests::byte_to_column_counts_chars

test result: FAILED. 292 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
