*** crates/diffguard-domain/src/evaluate.rs:578:40: replace + with - in byte_to_column

*** mutation diff:
--- crates/diffguard-domain/src/evaluate.rs
+++ replace + with - in byte_to_column
@@ -570,17 +570,17 @@
     let start = start.min(end);
     s.get(start..end).unwrap_or("").to_string()
 }
 
 fn byte_to_column(s: &str, byte_idx: usize) -> Option<usize> {
     if byte_idx > s.len() {
         return None;
     }
-    Some(s[..byte_idx].chars().count() + 1)
+    Some(s[..byte_idx].chars().count() - /* ~ changed by cargo-mutants ~ */ 1)
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::rules::compile_rules;
     use crate::{DirectoryRuleOverride, RuleOverrideMatcher};
     use diffguard_types::{MatchMode, RuleConfig};

---- evaluate::tests::byte_to_column_counts_chars stdout ----

thread 'evaluate::tests::byte_to_column_counts_chars' (1580465) panicked at crates/diffguard-domain/src/evaluate.rs:578:10:
attempt to subtract with overflow

---- evaluate::tests::caps_findings_but_keeps_counts stdout ----

thread 'evaluate::tests::caps_findings_but_keeps_counts' (1580466) panicked at crates/diffguard-domain/src/evaluate.rs:578:10:
attempt to subtract with overflow

---- evaluate::tests::rule_hits_track_emitted_and_suppressed stdout ----

thread 'evaluate::tests::rule_hits_track_emitted_and_suppressed' (1580481) panicked at crates/diffguard-domain/src/evaluate.rs:578:10:
attempt to subtract with overflow

failures:
    evaluate::tests::byte_to_column_counts_chars
    evaluate::tests::caps_findings_but_keeps_counts
    evaluate::tests::dependency_gates_secondary_rule
    evaluate::tests::escalation_patterns_raise_effective_severity
    evaluate::tests::multiline_rule_matches_across_consecutive_lines
    evaluate::tests::python_print_detected_outside_comment
    evaluate::tests::rule_hits_track_emitted_and_suppressed
    evaluate::tests::suppression_next_line_does_not_affect_third_line
    evaluate::tests::suppression_resets_on_file_change

test result: FAILED. 284 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
