*** crates/diffguard-domain/src/evaluate.rs:578:40: replace + with * in byte_to_column

*** mutation diff:
--- crates/diffguard-domain/src/evaluate.rs
+++ replace + with * in byte_to_column
@@ -570,17 +570,17 @@
     let start = start.min(end);
     s.get(start..end).unwrap_or("").to_string()
 }
 
 fn byte_to_column(s: &str, byte_idx: usize) -> Option<usize> {
     if byte_idx > s.len() {
         return None;
     }
-    Some(s[..byte_idx].chars().count() + 1)
+    Some(s[..byte_idx].chars().count() * /* ~ changed by cargo-mutants ~ */ 1)
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::rules::compile_rules;
     use crate::{DirectoryRuleOverride, RuleOverrideMatcher};
     use diffguard_types::{MatchMode, RuleConfig};

---- evaluate::tests::byte_to_column_counts_chars stdout ----

thread 'evaluate::tests::byte_to_column_counts_chars' (1581279) panicked at crates/diffguard-domain/src/evaluate.rs:1331:9:
assertion `left == right` failed
  left: Some(0)
 right: Some(1)

failures:
    evaluate::tests::byte_to_column_counts_chars

test result: FAILED. 292 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
