*** crates/diffguard-domain/src/overrides.rs:104:9: replace RuleOverrideMatcher::resolve -> ResolvedRuleOverride with Default::default()

*** mutation diff:
--- crates/diffguard-domain/src/overrides.rs
+++ replace RuleOverrideMatcher::resolve -> ResolvedRuleOverride with Default::default()
@@ -96,47 +96,17 @@
             });
         }
 
         Ok(Self { by_rule })
     }
 
     /// Resolve the effective override for a specific path and rule id.
     pub fn resolve(&self, path: &str, rule_id: &str) -> ResolvedRuleOverride {
-        let Some(entries) = self.by_rule.get(rule_id) else {
-            return ResolvedRuleOverride::default();
-        };
-
-        let mut resolved = ResolvedRuleOverride::default();
-        let normalized_path = normalize_path(path);
-        let path_ref = Path::new(&normalized_path);
-
-        for entry in entries {
-            if !path_in_directory(&normalized_path, &entry.directory) {
-                continue;
-            }
-
-            if let Some(enabled) = entry.enabled {
-                resolved.enabled = enabled;
-            }
-
-            if let Some(severity) = entry.severity {
-                resolved.severity = Some(severity);
-            }
-
-            if entry
-                .exclude
-                .as_ref()
-                .is_some_and(|exclude| exclude.is_match(path_ref))
-            {
-                resolved.enabled = false;
-            }
-        }
-
-        resolved
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 fn normalize_path(path: &str) -> String {
     let replaced = path.replace('\\', "/");
     let without_dot = replaced.strip_prefix("./").unwrap_or(&replaced);
     without_dot.trim_start_matches('/').to_string()
 }

---- evaluate::tests::directory_overrides_can_change_severity_or_disable_rule stdout ----

thread 'evaluate::tests::directory_overrides_can_change_severity_or_disable_rule' (1582908) panicked at crates/diffguard-domain/src/evaluate.rs:1412:9:
assertion `left == right` failed
  left: 3
 right: 1

---- overrides::tests::parent_and_child_overrides_merge_in_depth_order stdout ----

thread 'overrides::tests::parent_and_child_overrides_merge_in_depth_order' (1582936) panicked at crates/diffguard-domain/src/overrides.rs:211:9:
assertion failed: !parent_only.enabled

---- overrides::tests::exclude_paths_are_scoped_to_override_directory stdout ----

thread 'overrides::tests::exclude_paths_are_scoped_to_override_directory' (1582934) panicked at crates/diffguard-domain/src/overrides.rs:230:9:
assertion failed: !matcher.resolve("src/generated/file.rs", "rust.no_unwrap").enabled

failures:
    evaluate::tests::directory_overrides_can_change_severity_or_disable_rule
    overrides::tests::exclude_paths_are_scoped_to_override_directory
    overrides::tests::parent_and_child_overrides_merge_in_depth_order
    overrides::tests::root_directory_override_applies_everywhere

test result: FAILED. 289 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
