*** crates/diffguard-domain/src/overrides.rs:113:16: delete ! in RuleOverrideMatcher::resolve

*** mutation diff:
--- crates/diffguard-domain/src/overrides.rs
+++ delete ! in RuleOverrideMatcher::resolve
@@ -105,17 +105,17 @@
             return ResolvedRuleOverride::default();
         };
 
         let mut resolved = ResolvedRuleOverride::default();
         let normalized_path = normalize_path(path);
         let path_ref = Path::new(&normalized_path);
 
         for entry in entries {
-            if !path_in_directory(&normalized_path, &entry.directory) {
+            if  /* ~ changed by cargo-mutants ~ */path_in_directory(&normalized_path, &entry.directory) {
                 continue;
             }
 
             if let Some(enabled) = entry.enabled {
                 resolved.enabled = enabled;
             }
 
             if let Some(severity) = entry.severity {

---- evaluate::tests::directory_overrides_can_change_severity_or_disable_rule stdout ----

thread 'evaluate::tests::directory_overrides_can_change_severity_or_disable_rule' (1583722) panicked at crates/diffguard-domain/src/evaluate.rs:1412:9:
assertion `left == right` failed
  left: 0
 right: 1

---- overrides::tests::root_directory_override_applies_everywhere stdout ----

thread 'overrides::tests::root_directory_override_applies_everywhere' (1583751) panicked at crates/diffguard-domain/src/overrides.rs:283:9:
assertion failed: !matcher.resolve("src/lib.rs", "rust.no_unwrap").enabled

---- overrides::tests::parent_and_child_overrides_merge_in_depth_order stdout ----

thread 'overrides::tests::parent_and_child_overrides_merge_in_depth_order' (1583750) panicked at crates/diffguard-domain/src/overrides.rs:241:9:
assertion failed: !parent_only.enabled

failures:
    evaluate::tests::directory_overrides_can_change_severity_or_disable_rule
    overrides::tests::exclude_paths_are_scoped_to_override_directory
    overrides::tests::parent_and_child_overrides_merge_in_depth_order
    overrides::tests::root_directory_override_applies_everywhere

test result: FAILED. 289 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
