*** crates/diffguard-domain/src/overrides.rs:145:5: replace normalize_path -> String with String::new()

*** mutation diff:
--- crates/diffguard-domain/src/overrides.rs
+++ replace normalize_path -> String with String::new()
@@ -137,19 +137,17 @@
             }
         }
 
         resolved
     }
 }
 
 fn normalize_path(path: &str) -> String {
-    let replaced = path.replace('\\', "/");
-    let without_dot = replaced.strip_prefix("./").unwrap_or(&replaced);
-    without_dot.trim_start_matches('/').to_string()
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 fn normalize_directory(directory: &str) -> String {
     let normalized = normalize_path(directory);
     if normalized.is_empty() || normalized == "." {
         return String::new();
     }
     normalized.trim_end_matches('/').to_string()

---- evaluate::tests::directory_overrides_can_change_severity_or_disable_rule stdout ----

thread 'evaluate::tests::directory_overrides_can_change_severity_or_disable_rule' (3402687) panicked at crates/diffguard-domain/src/evaluate.rs:1437:9:
assertion `left == right` failed
  left: 0
 right: 1

---- overrides::tests::invalid_override_glob_returns_error stdout ----

thread 'overrides::tests::invalid_override_glob_returns_error' (3402712) panicked at crates/diffguard-domain/src/overrides.rs:304:17:
assertion `left == right` failed
  left: "["
 right: "src/["

---- overrides::tests::parent_and_child_overrides_merge_in_depth_order stdout ----

thread 'overrides::tests::parent_and_child_overrides_merge_in_depth_order' (3402713) panicked at crates/diffguard-domain/src/overrides.rs:245:9:
assertion failed: !parent_only.enabled

failures:
    evaluate::tests::directory_overrides_can_change_severity_or_disable_rule
    overrides::tests::exclude_paths_are_scoped_to_override_directory
    overrides::tests::invalid_override_glob_returns_error
    overrides::tests::parent_and_child_overrides_merge_in_depth_order

test result: FAILED. 281 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
