*** crates/diffguard-domain/src/overrides.rs:146:30: replace || with && in normalize_directory

*** mutation diff:
--- crates/diffguard-domain/src/overrides.rs
+++ replace || with && in normalize_directory
@@ -138,17 +138,17 @@
 fn normalize_path(path: &str) -> String {
     let replaced = path.replace('\\', "/");
     let without_dot = replaced.strip_prefix("./").unwrap_or(&replaced);
     without_dot.trim_start_matches('/').to_string()
 }
 
 fn normalize_directory(directory: &str) -> String {
     let normalized = normalize_path(directory);
-    if normalized.is_empty() || normalized == "." {
+    if normalized.is_empty() && /* ~ changed by cargo-mutants ~ */ normalized == "." {
         return String::new();
     }
     normalized.trim_end_matches('/').to_string()
 }
 
 fn directory_depth(directory: &str) -> usize {
     if directory.is_empty() {
         0

*** result: Success
