*** crates/diffguard-domain/src/overrides.rs:161:5: replace path_in_directory -> bool with false

*** mutation diff:
--- crates/diffguard-domain/src/overrides.rs
+++ replace path_in_directory -> bool with false
@@ -153,23 +153,17 @@
     if directory.is_empty() {
         0
     } else {
         directory.split('/').filter(|s| !s.is_empty()).count()
     }
 }
 
 fn path_in_directory(path: &str, directory: &str) -> bool {
-    if directory.is_empty() {
-        return true;
-    }
-    if path == directory {
-        return true;
-    }
-    path.starts_with(directory) && path.as_bytes().get(directory.len()) == Some(&b'/')
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn compile_exclude_globs(
     directory: &str,
     rule_id: &str,
     globs: &[String],
 ) -> Result<Option<GlobSet>, OverrideCompileError> {
     if globs.is_empty() {

---- evaluate::tests::directory_overrides_can_change_severity_or_disable_rule stdout ----

thread 'evaluate::tests::directory_overrides_can_change_severity_or_disable_rule' (1593603) panicked at crates/diffguard-domain/src/evaluate.rs:1412:9:
assertion `left == right` failed
  left: 3
 right: 1

---- overrides::tests::parent_and_child_overrides_merge_in_depth_order stdout ----

thread 'overrides::tests::parent_and_child_overrides_merge_in_depth_order' (1593632) panicked at crates/diffguard-domain/src/overrides.rs:235:9:
assertion failed: !parent_only.enabled

---- overrides::tests::root_directory_override_applies_everywhere stdout ----

thread 'overrides::tests::root_directory_override_applies_everywhere' (1593633) panicked at crates/diffguard-domain/src/overrides.rs:277:9:
assertion failed: !matcher.resolve("src/lib.rs", "rust.no_unwrap").enabled

failures:
    evaluate::tests::directory_overrides_can_change_severity_or_disable_rule
    overrides::tests::exclude_paths_are_scoped_to_override_directory
    overrides::tests::parent_and_child_overrides_merge_in_depth_order
    overrides::tests::root_directory_override_applies_everywhere

test result: FAILED. 289 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
