*** crates/diffguard-domain/src/overrides.rs:167:73: replace == with != in path_in_directory

*** mutation diff:
--- crates/diffguard-domain/src/overrides.rs
+++ replace == with != in path_in_directory
@@ -159,17 +159,17 @@
 
 fn path_in_directory(path: &str, directory: &str) -> bool {
     if directory.is_empty() {
         return true;
     }
     if path == directory {
         return true;
     }
-    path.starts_with(directory) && path.as_bytes().get(directory.len()) == Some(&b'/')
+    path.starts_with(directory) && path.as_bytes().get(directory.len()) != /* ~ changed by cargo-mutants ~ */ Some(&b'/')
 }
 
 fn compile_exclude_globs(
     directory: &str,
     rule_id: &str,
     globs: &[String],
 ) -> Result<Option<GlobSet>, OverrideCompileError> {
     if globs.is_empty() {

---- evaluate::tests::directory_overrides_can_change_severity_or_disable_rule stdout ----

thread 'evaluate::tests::directory_overrides_can_change_severity_or_disable_rule' (1596670) panicked at crates/diffguard-domain/src/evaluate.rs:1412:9:
assertion `left == right` failed
  left: 3
 right: 1

---- overrides::tests::parent_and_child_overrides_merge_in_depth_order stdout ----

thread 'overrides::tests::parent_and_child_overrides_merge_in_depth_order' (1596698) panicked at crates/diffguard-domain/src/overrides.rs:241:9:
assertion failed: !parent_only.enabled

---- overrides::tests::exclude_paths_are_scoped_to_override_directory stdout ----

thread 'overrides::tests::exclude_paths_are_scoped_to_override_directory' (1596696) panicked at crates/diffguard-domain/src/overrides.rs:260:9:
assertion failed: !matcher.resolve("src/generated/file.rs", "rust.no_unwrap").enabled

failures:
    evaluate::tests::directory_overrides_can_change_severity_or_disable_rule
    overrides::tests::exclude_paths_are_scoped_to_override_directory
    overrides::tests::parent_and_child_overrides_merge_in_depth_order

test result: FAILED. 290 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
