*** crates/diffguard-domain/src/overrides.rs:175:5: replace compile_exclude_globs -> Result<Option<GlobSet>, OverrideCompileError> with Ok(None)

*** mutation diff:
--- crates/diffguard-domain/src/overrides.rs
+++ replace compile_exclude_globs -> Result<Option<GlobSet>, OverrideCompileError> with Ok(None)
@@ -167,33 +167,17 @@
     path.starts_with(directory) && path.as_bytes().get(directory.len()) == Some(&b'/')
 }
 
 fn compile_exclude_globs(
     directory: &str,
     rule_id: &str,
     globs: &[String],
 ) -> Result<Option<GlobSet>, OverrideCompileError> {
-    if globs.is_empty() {
-        return Ok(None);
-    }
-
-    let mut builder = GlobSetBuilder::new();
-    for glob in globs {
-        let scoped = scope_glob_to_directory(directory, glob);
-        let parsed = Glob::new(&scoped).map_err(|source| OverrideCompileError::InvalidGlob {
-            rule_id: rule_id.to_string(),
-            directory: directory.to_string(),
-            glob: scoped.clone(),
-            source,
-        })?;
-        builder.add(parsed);
-    }
-
-    Ok(Some(builder.build().expect("globset build should succeed")))
+    Ok(None) /* ~ changed by cargo-mutants ~ */
 }
 
 fn scope_glob_to_directory(directory: &str, glob: &str) -> String {
     let replaced = glob.replace('\\', "/");
     let without_dot = replaced.strip_prefix("./").unwrap_or(&replaced);
 
     if directory.is_empty() || without_dot.starts_with('/') {
         without_dot.trim_start_matches('/').to_string()

---- overrides::tests::invalid_override_glob_returns_error stdout ----

thread 'overrides::tests::invalid_override_glob_returns_error' (1597520) panicked at crates/diffguard-domain/src/overrides.rs:280:10:
invalid glob should fail: RuleOverrideMatcher { by_rule: {"rust.no_unwrap": [CompiledDirectoryRuleOverride { directory: "src", depth: 1, enabled: None, severity: None, exclude: None }]} }

---- overrides::tests::exclude_paths_are_scoped_to_override_directory stdout ----

thread 'overrides::tests::exclude_paths_are_scoped_to_override_directory' (1597519) panicked at crates/diffguard-domain/src/overrides.rs:244:9:
assertion failed: !matcher.resolve("src/generated/file.rs", "rust.no_unwrap").enabled

failures:
    overrides::tests::exclude_paths_are_scoped_to_override_directory
    overrides::tests::invalid_override_glob_returns_error

test result: FAILED. 291 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
