*** crates/diffguard-domain/src/overrides.rs:195:5: replace scope_glob_to_directory -> String with "xyzzy".into()

*** mutation diff:
--- crates/diffguard-domain/src/overrides.rs
+++ replace scope_glob_to_directory -> String with "xyzzy".into()
@@ -187,24 +187,17 @@
         })?;
         builder.add(parsed);
     }
 
     Ok(Some(builder.build().expect("globset build should succeed")))
 }
 
 fn scope_glob_to_directory(directory: &str, glob: &str) -> String {
-    let replaced = glob.replace('\\', "/");
-    let without_dot = replaced.strip_prefix("./").unwrap_or(&replaced);
-
-    if directory.is_empty() || without_dot.starts_with('/') {
-        without_dot.trim_start_matches('/').to_string()
-    } else {
-        format!("{}/{}", directory, without_dot.trim_start_matches('/'))
-    }
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use std::error::Error;
 
     fn override_spec(

---- overrides::tests::exclude_paths_are_scoped_to_override_directory stdout ----

thread 'overrides::tests::exclude_paths_are_scoped_to_override_directory' (1599958) panicked at crates/diffguard-domain/src/overrides.rs:253:9:
assertion failed: !matcher.resolve("src/generated/file.rs", "rust.no_unwrap").enabled

---- overrides::tests::invalid_override_glob_returns_error stdout ----

thread 'overrides::tests::invalid_override_glob_returns_error' (1599959) panicked at crates/diffguard-domain/src/overrides.rs:289:10:
invalid glob should fail: RuleOverrideMatcher { by_rule: {"rust.no_unwrap": [CompiledDirectoryRuleOverride { directory: "src", depth: 1, enabled: None, severity: None, exclude: Some(GlobSet { len: 1, strats: [Literal(LiteralStrategy({[120, 121, 122, 122, 121]: [0]}))] }) }]} }

failures:
    overrides::tests::exclude_paths_are_scoped_to_override_directory
    overrides::tests::invalid_override_glob_returns_error

test result: FAILED. 291 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
