*** crates/diffguard-domain/src/overrides.rs:73:9: replace RuleOverrideMatcher::compile -> Result<Self, OverrideCompileError> with Ok(Default::default())

*** mutation diff:
--- crates/diffguard-domain/src/overrides.rs
+++ replace RuleOverrideMatcher::compile -> Result<Self, OverrideCompileError> with Ok(Default::default())
@@ -65,43 +65,17 @@
 #[derive(Debug, Clone, Default)]
 pub struct RuleOverrideMatcher {
     by_rule: BTreeMap<String, Vec<CompiledDirectoryRuleOverride>>,
 }
 
 impl RuleOverrideMatcher {
     /// Compile raw directory overrides into a matcher.
     pub fn compile(specs: &[DirectoryRuleOverride]) -> Result<Self, OverrideCompileError> {
-        let mut by_rule: BTreeMap<String, Vec<CompiledDirectoryRuleOverride>> = BTreeMap::new();
-
-        for spec in specs {
-            let directory = normalize_directory(&spec.directory);
-            let exclude = compile_exclude_globs(&directory, &spec.rule_id, &spec.exclude_paths)?;
-
-            by_rule
-                .entry(spec.rule_id.clone())
-                .or_default()
-                .push(CompiledDirectoryRuleOverride {
-                    depth: directory_depth(&directory),
-                    directory,
-                    enabled: spec.enabled,
-                    severity: spec.severity,
-                    exclude,
-                });
-        }
-
-        for entries in by_rule.values_mut() {
-            entries.sort_by(|a, b| {
-                a.depth
-                    .cmp(&b.depth)
-                    .then_with(|| a.directory.cmp(&b.directory))
-            });
-        }
-
-        Ok(Self { by_rule })
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Resolve the effective override for a specific path and rule id.
     pub fn resolve(&self, path: &str, rule_id: &str) -> ResolvedRuleOverride {
         let Some(entries) = self.by_rule.get(rule_id) else {
             return ResolvedRuleOverride::default();
         };

---- evaluate::tests::directory_overrides_can_change_severity_or_disable_rule stdout ----

thread 'evaluate::tests::directory_overrides_can_change_severity_or_disable_rule' (1582094) panicked at crates/diffguard-domain/src/evaluate.rs:1412:9:
assertion `left == right` failed
  left: 3
 right: 1

---- overrides::tests::exclude_paths_are_scoped_to_override_directory stdout ----

thread 'overrides::tests::exclude_paths_are_scoped_to_override_directory' (1582120) panicked at crates/diffguard-domain/src/overrides.rs:234:9:
assertion failed: !matcher.resolve("src/generated/file.rs", "rust.no_unwrap").enabled

---- overrides::tests::invalid_override_glob_returns_error stdout ----

thread 'overrides::tests::invalid_override_glob_returns_error' (1582121) panicked at crates/diffguard-domain/src/overrides.rs:270:10:
invalid glob should fail: RuleOverrideMatcher { by_rule: {} }

failures:
    evaluate::tests::directory_overrides_can_change_severity_or_disable_rule
    overrides::tests::exclude_paths_are_scoped_to_override_directory
    overrides::tests::invalid_override_glob_returns_error
    overrides::tests::parent_and_child_overrides_merge_in_depth_order
    overrides::tests::root_directory_override_applies_everywhere

test result: FAILED. 288 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
