*** crates/diffguard-domain/src/preprocess.rs:41:9: replace <impl FromStr for Language>::from_str -> Result<Self, Self::Err> with Ok(Default::default())

*** mutation diff:
--- crates/diffguard-domain/src/preprocess.rs
+++ replace <impl FromStr for Language>::from_str -> Result<Self, Self::Err> with Ok(Default::default())
@@ -33,39 +33,17 @@
 
 impl FromStr for Language {
     type Err = std::convert::Infallible;
 
     /// Parse a language identifier string into a Language enum.
     ///
     /// The matching is case-insensitive. Unknown languages return `Language::Unknown`.
     fn from_str(s: &str) -> Result<Self, Self::Err> {
-        Ok(match s.to_ascii_lowercase().as_str() {
-            "rust" => Language::Rust,
-            "python" => Language::Python,
-            "javascript" => Language::JavaScript,
-            "typescript" => Language::TypeScript,
-            "go" => Language::Go,
-            "ruby" => Language::Ruby,
-            "c" => Language::C,
-            "cpp" => Language::Cpp,
-            "csharp" => Language::CSharp,
-            "java" => Language::Java,
-            "kotlin" => Language::Kotlin,
-            "shell" | "bash" | "sh" | "zsh" | "ksh" | "fish" => Language::Shell,
-            "swift" => Language::Swift,
-            "scala" => Language::Scala,
-            "sql" => Language::Sql,
-            "xml" | "html" | "xhtml" | "svg" | "xsl" | "xslt" => Language::Xml,
-            "php" => Language::Php,
-            "yaml" | "yml" => Language::Yaml,
-            "toml" => Language::Toml,
-            "json" | "jsonc" | "json5" => Language::Json,
-            _ => Language::Unknown,
-        })
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Language {
     /// Returns the comment syntax for this language.
     pub fn comment_syntax(self) -> CommentSyntax {
         match self {
             Language::Python | Language::Ruby | Language::Shell => CommentSyntax::Hash,

---- evaluate::tests::language_changes_between_files stdout ----

thread 'evaluate::tests::language_changes_between_files' (1601667) panicked at crates/diffguard-domain/src/evaluate.rs:914:9:
assertion `left == right` failed
  left: 2
 right: 1

---- evaluate::tests::python_hash_comment_ignored_with_language_aware_preprocessing stdout ----

thread 'evaluate::tests::python_hash_comment_ignored_with_language_aware_preprocessing' (1601669) panicked at crates/diffguard-domain/src/evaluate.rs:781:9:
assertion `left == right` failed
  left: 1
 right: 0

---- preprocess::tests::language_from_str_case_insensitive stdout ----

thread 'preprocess::tests::language_from_str_case_insensitive' (1601714) panicked at crates/diffguard-domain/src/preprocess.rs:1001:9:
assertion `left == right` failed
  left: Unknown
 right: Rust

failures:
    evaluate::tests::go_backtick_raw_string_ignored_with_language_aware_preprocessing
    evaluate::tests::javascript_template_literal_ignored_with_language_aware_preprocessing
    evaluate::tests::language_changes_between_files
    evaluate::tests::python_hash_comment_ignored_with_language_aware_preprocessing
    preprocess::tests::language_from_str_case_insensitive
    preprocess::tests::language_from_str_known_languages
    preprocess::tests::php_language_from_str
    preprocess::tests::scala_language_from_str
    preprocess::tests::shell_language_from_str
    preprocess::tests::sql_language_from_str
    preprocess::tests::swift_language_from_str
    preprocess::tests::xml_language_from_str

test result: FAILED. 281 passed; 12 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
