*** crates/diffguard-domain/src/preprocess.rs:42:13: delete match arm "rust" in <impl FromStr for Language>::from_str

*** mutation diff:
--- crates/diffguard-domain/src/preprocess.rs
+++ delete match arm "rust" in <impl FromStr for Language>::from_str
@@ -34,17 +34,17 @@
 impl FromStr for Language {
     type Err = std::convert::Infallible;
 
     /// Parse a language identifier string into a Language enum.
     ///
     /// The matching is case-insensitive. Unknown languages return `Language::Unknown`.
     fn from_str(s: &str) -> Result<Self, Self::Err> {
         Ok(match s.to_ascii_lowercase().as_str() {
-            "rust" => Language::Rust,
+             /* ~ changed by cargo-mutants ~ */
             "python" => Language::Python,
             "javascript" => Language::JavaScript,
             "typescript" => Language::TypeScript,
             "go" => Language::Go,
             "ruby" => Language::Ruby,
             "c" => Language::C,
             "cpp" => Language::Cpp,
             "csharp" => Language::CSharp,

---- preprocess::tests::language_from_str_case_insensitive stdout ----

thread 'preprocess::tests::language_from_str_case_insensitive' (1602528) panicked at crates/diffguard-domain/src/preprocess.rs:1023:9:
assertion `left == right` failed
  left: Unknown
 right: Rust

---- preprocess::tests::language_from_str_known_languages stdout ----

thread 'preprocess::tests::language_from_str_known_languages' (1602529) panicked at crates/diffguard-domain/src/preprocess.rs:999:9:
assertion `left == right` failed
  left: Unknown
 right: Rust

failures:
    preprocess::tests::language_from_str_case_insensitive
    preprocess::tests::language_from_str_known_languages

test result: FAILED. 291 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
