*** crates/diffguard-domain/src/preprocess.rs:43:13: delete match arm "python" in <impl FromStr for Language>::from_str

*** mutation diff:
--- crates/diffguard-domain/src/preprocess.rs
+++ delete match arm "python" in <impl FromStr for Language>::from_str
@@ -35,17 +35,17 @@
     type Err = std::convert::Infallible;
 
     /// Parse a language identifier string into a Language enum.
     ///
     /// The matching is case-insensitive. Unknown languages return `Language::Unknown`.
     fn from_str(s: &str) -> Result<Self, Self::Err> {
         Ok(match s.to_ascii_lowercase().as_str() {
             "rust" => Language::Rust,
-            "python" => Language::Python,
+             /* ~ changed by cargo-mutants ~ */
             "javascript" => Language::JavaScript,
             "typescript" => Language::TypeScript,
             "go" => Language::Go,
             "ruby" => Language::Ruby,
             "c" => Language::C,
             "cpp" => Language::Cpp,
             "csharp" => Language::CSharp,
             "java" => Language::Java,

---- evaluate::tests::language_changes_between_files stdout ----

thread 'evaluate::tests::language_changes_between_files' (1603295) panicked at crates/diffguard-domain/src/evaluate.rs:914:9:
assertion `left == right` failed
  left: 2
 right: 1

---- preprocess::tests::language_from_str_case_insensitive stdout ----

thread 'preprocess::tests::language_from_str_case_insensitive' (1603342) panicked at crates/diffguard-domain/src/preprocess.rs:1024:9:
assertion `left == right` failed
  left: Unknown
 right: Python

---- preprocess::tests::language_from_str_known_languages stdout ----

thread 'preprocess::tests::language_from_str_known_languages' (1603343) panicked at crates/diffguard-domain/src/preprocess.rs:1000:9:
assertion `left == right` failed
  left: Unknown
 right: Python

failures:
    evaluate::tests::language_changes_between_files
    evaluate::tests::python_hash_comment_ignored_with_language_aware_preprocessing
    preprocess::tests::language_from_str_case_insensitive
    preprocess::tests::language_from_str_known_languages

test result: FAILED. 289 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
