*** crates/diffguard-domain/src/preprocess.rs:44:13: delete match arm "javascript" in <impl FromStr for Language>::from_str

*** mutation diff:
--- crates/diffguard-domain/src/preprocess.rs
+++ delete match arm "javascript" in <impl FromStr for Language>::from_str
@@ -36,17 +36,17 @@
 
     /// Parse a language identifier string into a Language enum.
     ///
     /// The matching is case-insensitive. Unknown languages return `Language::Unknown`.
     fn from_str(s: &str) -> Result<Self, Self::Err> {
         Ok(match s.to_ascii_lowercase().as_str() {
             "rust" => Language::Rust,
             "python" => Language::Python,
-            "javascript" => Language::JavaScript,
+             /* ~ changed by cargo-mutants ~ */
             "typescript" => Language::TypeScript,
             "go" => Language::Go,
             "ruby" => Language::Ruby,
             "c" => Language::C,
             "cpp" => Language::Cpp,
             "csharp" => Language::CSharp,
             "java" => Language::Java,
             "kotlin" => Language::Kotlin,

---- preprocess::tests::language_from_str_known_languages stdout ----

thread 'preprocess::tests::language_from_str_known_languages' (1604157) panicked at crates/diffguard-domain/src/preprocess.rs:1001:9:
assertion `left == right` failed
  left: Unknown
 right: JavaScript

---- preprocess::tests::language_from_str_case_insensitive stdout ----

thread 'preprocess::tests::language_from_str_case_insensitive' (1604156) panicked at crates/diffguard-domain/src/preprocess.rs:1025:9:
assertion `left == right` failed
  left: Unknown
 right: JavaScript

---- evaluate::tests::javascript_template_literal_ignored_with_language_aware_preprocessing stdout ----

thread 'evaluate::tests::javascript_template_literal_ignored_with_language_aware_preprocessing' (1604108) panicked at crates/diffguard-domain/src/evaluate.rs:842:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    evaluate::tests::javascript_template_literal_ignored_with_language_aware_preprocessing
    preprocess::tests::language_from_str_case_insensitive
    preprocess::tests::language_from_str_known_languages

test result: FAILED. 290 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
