*** crates/diffguard-domain/src/preprocess.rs:46:13: delete match arm "go" in <impl FromStr for Language>::from_str

*** mutation diff:
--- crates/diffguard-domain/src/preprocess.rs
+++ delete match arm "go" in <impl FromStr for Language>::from_str
@@ -38,17 +38,17 @@
     ///
     /// The matching is case-insensitive. Unknown languages return `Language::Unknown`.
     fn from_str(s: &str) -> Result<Self, Self::Err> {
         Ok(match s.to_ascii_lowercase().as_str() {
             "rust" => Language::Rust,
             "python" => Language::Python,
             "javascript" => Language::JavaScript,
             "typescript" => Language::TypeScript,
-            "go" => Language::Go,
+             /* ~ changed by cargo-mutants ~ */
             "ruby" => Language::Ruby,
             "c" => Language::C,
             "cpp" => Language::Cpp,
             "csharp" => Language::CSharp,
             "java" => Language::Java,
             "kotlin" => Language::Kotlin,
             "shell" | "bash" | "sh" | "zsh" | "ksh" | "fish" => Language::Shell,
             "swift" => Language::Swift,

---- preprocess::tests::language_from_str_known_languages stdout ----

thread 'preprocess::tests::language_from_str_known_languages' (1605794) panicked at crates/diffguard-domain/src/preprocess.rs:1009:9:
assertion `left == right` failed
  left: Unknown
 right: Go

---- preprocess::tests::language_from_str_case_insensitive stdout ----

thread 'preprocess::tests::language_from_str_case_insensitive' (1605793) panicked at crates/diffguard-domain/src/preprocess.rs:1033:9:
assertion `left == right` failed
  left: Unknown
 right: Go

---- evaluate::tests::go_backtick_raw_string_ignored_with_language_aware_preprocessing stdout ----

thread 'evaluate::tests::go_backtick_raw_string_ignored_with_language_aware_preprocessing' (1605744) panicked at crates/diffguard-domain/src/evaluate.rs:873:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    evaluate::tests::go_backtick_raw_string_ignored_with_language_aware_preprocessing
    preprocess::tests::language_from_str_case_insensitive
    preprocess::tests::language_from_str_known_languages

test result: FAILED. 290 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
