*** crates/diffguard-domain/src/preprocess.rs:47:13: delete match arm "ruby" in <impl FromStr for Language>::from_str

*** mutation diff:
--- crates/diffguard-domain/src/preprocess.rs
+++ delete match arm "ruby" in <impl FromStr for Language>::from_str
@@ -39,17 +39,17 @@
     /// The matching is case-insensitive. Unknown languages return `Language::Unknown`.
     fn from_str(s: &str) -> Result<Self, Self::Err> {
         Ok(match s.to_ascii_lowercase().as_str() {
             "rust" => Language::Rust,
             "python" => Language::Python,
             "javascript" => Language::JavaScript,
             "typescript" => Language::TypeScript,
             "go" => Language::Go,
-            "ruby" => Language::Ruby,
+             /* ~ changed by cargo-mutants ~ */
             "c" => Language::C,
             "cpp" => Language::Cpp,
             "csharp" => Language::CSharp,
             "java" => Language::Java,
             "kotlin" => Language::Kotlin,
             "shell" | "bash" | "sh" | "zsh" | "ksh" | "fish" => Language::Shell,
             "swift" => Language::Swift,
             "scala" => Language::Scala,

---- preprocess::tests::language_from_str_case_insensitive stdout ----

thread 'preprocess::tests::language_from_str_case_insensitive' (1606609) panicked at crates/diffguard-domain/src/preprocess.rs:1034:9:
assertion `left == right` failed
  left: Unknown
 right: Ruby

---- preprocess::tests::language_from_str_known_languages stdout ----

thread 'preprocess::tests::language_from_str_known_languages' (1606610) panicked at crates/diffguard-domain/src/preprocess.rs:1010:9:
assertion `left == right` failed
  left: Unknown
 right: Ruby

failures:
    preprocess::tests::language_from_str_case_insensitive
    preprocess::tests::language_from_str_known_languages

test result: FAILED. 291 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
