*** crates/diffguard-domain/src/preprocess.rs:48:13: delete match arm "c" in <impl FromStr for Language>::from_str

*** mutation diff:
--- crates/diffguard-domain/src/preprocess.rs
+++ delete match arm "c" in <impl FromStr for Language>::from_str
@@ -40,17 +40,17 @@
     fn from_str(s: &str) -> Result<Self, Self::Err> {
         Ok(match s.to_ascii_lowercase().as_str() {
             "rust" => Language::Rust,
             "python" => Language::Python,
             "javascript" => Language::JavaScript,
             "typescript" => Language::TypeScript,
             "go" => Language::Go,
             "ruby" => Language::Ruby,
-            "c" => Language::C,
+             /* ~ changed by cargo-mutants ~ */
             "cpp" => Language::Cpp,
             "csharp" => Language::CSharp,
             "java" => Language::Java,
             "kotlin" => Language::Kotlin,
             "shell" | "bash" | "sh" | "zsh" | "ksh" | "fish" => Language::Shell,
             "swift" => Language::Swift,
             "scala" => Language::Scala,
             "sql" => Language::Sql,

---- preprocess::tests::language_from_str_case_insensitive stdout ----

thread 'preprocess::tests::language_from_str_case_insensitive' (1607433) panicked at crates/diffguard-domain/src/preprocess.rs:1035:9:
assertion `left == right` failed
  left: Unknown
 right: C

---- preprocess::tests::language_from_str_known_languages stdout ----

thread 'preprocess::tests::language_from_str_known_languages' (1607434) panicked at crates/diffguard-domain/src/preprocess.rs:1011:9:
assertion `left == right` failed
  left: Unknown
 right: C

failures:
    preprocess::tests::language_from_str_case_insensitive
    preprocess::tests::language_from_str_known_languages

test result: FAILED. 291 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
