*** crates/diffguard-types/src/lib.rs:1555:5: replace is_false -> bool with false

*** mutation diff:
--- crates/diffguard-types/src/lib.rs
+++ replace is_false -> bool with false
@@ -1547,17 +1547,17 @@
 
 /// Serde predicate: skips serializing a [`bool`] field when it is [`false`].
 ///
 /// Used with `#[serde(skip_serializing_if = "is_false")]`.
 /// Takes [`bool`] by reference to avoid triggering
 /// `clippy::trivially_copy_pass_by_ref` while remaining Clone-free.
 #[allow(clippy::trivially_copy_pass_by_ref)]
 fn is_false(v: &bool) -> bool {
-    !*v
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 /// Serde predicate: skips serializing a [`MatchMode`] field when it is [`MatchMode::Any`].
 ///
 /// Used with `#[serde(skip_serializing_if = "is_match_mode_any")]`.
 /// Takes [`MatchMode`] by reference to avoid triggering
 /// `clippy::trivially_copy_pass_by_ref` while remaining Clone-free.
 #[allow(clippy::trivially_copy_pass_by_ref)]

---- test_is_false_accepts_bool_by_value stdout ----

thread 'test_is_false_accepts_bool_by_value' (2261977) panicked at crates/diffguard-types/tests/predicate_by_value.rs:86:5:
multiline=false should not be serialized: {"id":"test-rule","severity":"warn","message":"test message","languages":[],"patterns":["pattern"],"paths":[],"exclude_paths":[],"ignore_comments":false,"ignore_strings":false,"multiline":false}

---- test_all_predicates_combined_edge_cases stdout ----

thread 'test_all_predicates_combined_edge_cases' (2261976) panicked at crates/diffguard-types/tests/predicate_by_value.rs:254:5:
multiline=false should be skipped

---- test_is_false_with_false_value stdout ----

thread 'test_is_false_with_false_value' (2261978) panicked at crates/diffguard-types/tests/predicate_by_value.rs:225:5:
multiline=false should not be serialized: {"id":"test-rule","severity":"warn","message":"test message","languages":[],"patterns":["pattern"],"paths":[],"exclude_paths":[],"ignore_comments":false,"ignore_strings":false,"match_mode":"absent","multiline":false}

failures:
    test_all_predicates_combined_edge_cases
    test_is_false_accepts_bool_by_value
    test_is_false_with_false_value
    test_skip_serializing_if_combined_default_values

test result: FAILED. 14 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
