*** crates/diffguard-types/src/lib.rs:1565:5: replace is_match_mode_any -> bool with true

*** mutation diff:
--- crates/diffguard-types/src/lib.rs
+++ replace is_match_mode_any -> bool with true
@@ -1557,17 +1557,17 @@
 
 /// Serde predicate: skips serializing a [`MatchMode`] field when it is [`MatchMode::Any`].
 ///
 /// Used with `#[serde(skip_serializing_if = "is_match_mode_any")]`.
 /// Takes [`MatchMode`] by reference to avoid triggering
 /// `clippy::trivially_copy_pass_by_ref` while remaining Clone-free.
 #[allow(clippy::trivially_copy_pass_by_ref)]
 fn is_match_mode_any(mode: &MatchMode) -> bool {
-    matches!(mode, MatchMode::Any)
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 // ============================================================================
 // Per-directory override types
 // ============================================================================
 
 /// Per-directory override configuration (.diffguard.toml).
 ///

---- test_all_predicates_combined_edge_cases stdout ----

thread 'test_all_predicates_combined_edge_cases' (2262824) panicked at crates/diffguard-types/tests/predicate_by_value.rs:295:5:
match_mode=Absent should be serialized

---- test_is_match_mode_any_with_absent_variant stdout ----

thread 'test_is_match_mode_any_with_absent_variant' (2262831) panicked at crates/diffguard-types/tests/predicate_by_value.rs:215:5:
match_mode=Absent should be serialized: {"id":"test-rule","severity":"warn","message":"test message","languages":[],"patterns":["pattern"],"paths":[],"exclude_paths":[],"ignore_comments":false,"ignore_strings":false}

---- test_is_match_mode_any_with_absent_serializes stdout ----

thread 'test_is_match_mode_any_with_absent_serializes' (2262830) panicked at crates/diffguard-types/tests/predicate_by_value.rs:116:5:
match_mode=Absent should be serialized: {"id":"test-rule","severity":"warn","message":"test message","languages":[],"patterns":["pattern"],"paths":[],"exclude_paths":[],"ignore_comments":false,"ignore_strings":false}

failures:
    test_all_predicates_combined_edge_cases
    test_is_match_mode_any_with_absent_serializes
    test_is_match_mode_any_with_absent_variant
    test_round_trip_with_edge_case_values
    test_skip_serializing_if_round_trip

test result: FAILED. 13 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
