*** crates/diffguard-types/src/lib.rs:165:5: replace is_zero -> bool with false

*** mutation diff:
--- crates/diffguard-types/src/lib.rs
+++ replace is_zero -> bool with false
@@ -157,17 +157,17 @@
 
 /// Serde predicate: skips serializing a [`u32`] field when it is zero.
 ///
 /// Used with `#[serde(skip_serializing_if = "is_zero")]`.
 /// Takes [`u32`] by reference to avoid triggering
 /// `clippy::trivially_copy_pass_by_ref` while remaining Clone-free.
 #[allow(clippy::trivially_copy_pass_by_ref)]
 fn is_zero(n: &u32) -> bool {
-    *n == 0
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 #[derive(Debug, Clone, PartialEq, Eq, Serialize, Deserialize, JsonSchema)]
 pub struct Verdict {
     pub status: VerdictStatus,
     pub counts: VerdictCounts,
     pub reasons: Vec<String>,
 }

---- tests::verdict_counts_suppressed_is_omitted_when_zero stdout ----

thread 'tests::verdict_counts_suppressed_is_omitted_when_zero' (2260726) panicked at crates/diffguard-types/src/lib.rs:1737:9:
assertion failed: !obj.contains_key("suppressed")

failures:
    tests::verdict_counts_suppressed_is_omitted_when_zero

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
