*** crates/diffguard-types/src/lib.rs:53:9: replace Severity::as_str -> &'static str with "xyzzy"

*** mutation diff:
--- crates/diffguard-types/src/lib.rs
+++ replace Severity::as_str -> &'static str with "xyzzy"
@@ -45,21 +45,17 @@
 pub enum Severity {
     Info,
     Warn,
     Error,
 }
 
 impl Severity {
     pub fn as_str(self) -> &'static str {
-        match self {
-            Severity::Info => "info",
-            Severity::Warn => "warn",
-            Severity::Error => "error",
-        }
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Debug, Clone, Copy, PartialEq, Eq, Serialize, Deserialize, JsonSchema)]
 #[serde(rename_all = "snake_case")]
 pub enum Scope {
     Added,
     Changed,

---- tests::severity_scope_failon_as_str stdout ----

thread 'tests::severity_scope_failon_as_str' (2249406) panicked at crates/diffguard-types/src/lib.rs:1703:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "info"

failures:
    tests::severity_scope_failon_as_str

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
