*** crates/diffguard-types/src/lib.rs:72:9: replace Scope::as_str -> &'static str with ""

*** mutation diff:
--- crates/diffguard-types/src/lib.rs
+++ replace Scope::as_str -> &'static str with ""
@@ -64,22 +64,17 @@
     Added,
     Changed,
     Modified,
     Deleted,
 }
 
 impl Scope {
     pub fn as_str(self) -> &'static str {
-        match self {
-            Scope::Added => "added",
-            Scope::Changed => "changed",
-            Scope::Modified => "modified",
-            Scope::Deleted => "deleted",
-        }
+        "" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Debug, Clone, Copy, PartialEq, Eq, Serialize, Deserialize, JsonSchema)]
 #[serde(rename_all = "snake_case")]
 pub enum FailOn {
     Error,
     Warn,

---- tests::severity_scope_failon_as_str stdout ----

thread 'tests::severity_scope_failon_as_str' (2258700) panicked at crates/diffguard-types/src/lib.rs:1706:9:
assertion `left == right` failed
  left: ""
 right: "added"

failures:
    tests::severity_scope_failon_as_str

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
