*** crates/diffguard-types/src/lib.rs:91:9: replace FailOn::as_str -> &'static str with ""

*** mutation diff:
--- crates/diffguard-types/src/lib.rs
+++ replace FailOn::as_str -> &'static str with ""
@@ -83,21 +83,17 @@
 pub enum FailOn {
     Error,
     Warn,
     Never,
 }
 
 impl FailOn {
     pub fn as_str(self) -> &'static str {
-        match self {
-            FailOn::Error => "error",
-            FailOn::Warn => "warn",
-            FailOn::Never => "never",
-        }
+        "" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Debug, Clone, Copy, PartialEq, Eq, Serialize, Deserialize, JsonSchema, Default)]
 #[serde(rename_all = "snake_case")]
 pub enum MatchMode {
     /// Emit a finding when at least one pattern matches (default behavior).
     #[default]

---- tests::severity_scope_failon_as_str stdout ----

thread 'tests::severity_scope_failon_as_str' (2250621) panicked at crates/diffguard-types/src/lib.rs:1712:9:
assertion `left == right` failed
  left: ""
 right: "error"

failures:
    tests::severity_scope_failon_as_str

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
