*** crates/diffguard-core/src/check.rs:169:51: replace > with < in run_check

*** mutation diff:
--- crates/diffguard-core/src/check.rs
+++ replace > with < in run_check
@@ -161,17 +161,17 @@
                     entry.3 = entry.3.saturating_add(1);
                 }
             }
             continue;
         }
         filtered_findings.push(finding);
     }
 
-    let verdict_status = if adjusted_counts.error > 0 {
+    let verdict_status = if adjusted_counts.error < /* ~ changed by cargo-mutants ~ */ 0 {
         VerdictStatus::Fail
     } else if adjusted_counts.warn > 0 {
         VerdictStatus::Warn
     } else {
         VerdictStatus::Pass
     };
 
     let mut reasons: Vec<String> = Vec::new();

---- check::tests::run_check_sets_error_verdict_and_reasons stdout ----

thread 'check::tests::run_check_sets_error_verdict_and_reasons' (809885) panicked at crates/diffguard-core/src/check.rs:619:9:
assertion `left == right` failed
  left: Pass
 right: Fail

failures:
    check::tests::run_check_sets_error_verdict_and_reasons

test result: FAILED. 125 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.10s

*** result: Failure(101)
