*** crates/diffguard-core/src/check.rs:169:51: replace > with >= in run_check

*** mutation diff:
--- crates/diffguard-core/src/check.rs
+++ replace > with >= in run_check
@@ -161,17 +161,17 @@
                     entry.3 = entry.3.saturating_add(1);
                 }
             }
             continue;
         }
         filtered_findings.push(finding);
     }
 
-    let verdict_status = if adjusted_counts.error > 0 {
+    let verdict_status = if adjusted_counts.error >= /* ~ changed by cargo-mutants ~ */ 0 {
         VerdictStatus::Fail
     } else if adjusted_counts.warn > 0 {
         VerdictStatus::Warn
     } else {
         VerdictStatus::Pass
     };
 
     let mut reasons: Vec<String> = Vec::new();

---- check::tests::run_check_passes_with_no_findings stdout ----

thread 'check::tests::run_check_passes_with_no_findings' (810677) panicked at crates/diffguard-core/src/check.rs:661:9:
assertion `left == right` failed
  left: Fail
 right: Pass

---- check::tests::run_check_filters_acknowledged_false_positive_fingerprints stdout ----

thread 'check::tests::run_check_filters_acknowledged_false_positive_fingerprints' (810673) panicked at crates/diffguard-core/src/check.rs:581:9:
assertion `left == right` failed
  left: Fail
 right: Pass

---- check::tests::run_check_sets_warn_verdict_and_reasons stdout ----

thread 'check::tests::run_check_sets_warn_verdict_and_reasons' (810679) panicked at crates/diffguard-core/src/check.rs:601:9:
assertion `left == right` failed
  left: Fail
 right: Warn

failures:
    check::tests::run_check_filters_acknowledged_false_positive_fingerprints
    check::tests::run_check_passes_with_no_findings
    check::tests::run_check_sets_warn_verdict_and_reasons

test result: FAILED. 123 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
