*** crates/diffguard-core/src/check.rs:171:36: replace > with < in run_check

*** mutation diff:
--- crates/diffguard-core/src/check.rs
+++ replace > with < in run_check
@@ -163,17 +163,17 @@
             }
             continue;
         }
         filtered_findings.push(finding);
     }
 
     let verdict_status = if adjusted_counts.error > 0 {
         VerdictStatus::Fail
-    } else if adjusted_counts.warn > 0 {
+    } else if adjusted_counts.warn < /* ~ changed by cargo-mutants ~ */ 0 {
         VerdictStatus::Warn
     } else {
         VerdictStatus::Pass
     };
 
     let mut reasons: Vec<String> = Vec::new();
     if evaluation.truncated_findings > 0 {
         reasons.push(REASON_TRUNCATED.to_string());

---- check::tests::run_check_sets_warn_verdict_and_reasons stdout ----

thread 'check::tests::run_check_sets_warn_verdict_and_reasons' (812265) panicked at crates/diffguard-core/src/check.rs:601:9:
assertion `left == right` failed
  left: Pass
 right: Warn

failures:
    check::tests::run_check_sets_warn_verdict_and_reasons

test result: FAILED. 125 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
