*** crates/diffguard-core/src/check.rs:171:36: replace > with >= in run_check

*** mutation diff:
--- crates/diffguard-core/src/check.rs
+++ replace > with >= in run_check
@@ -163,17 +163,17 @@
             }
             continue;
         }
         filtered_findings.push(finding);
     }
 
     let verdict_status = if adjusted_counts.error > 0 {
         VerdictStatus::Fail
-    } else if adjusted_counts.warn > 0 {
+    } else if adjusted_counts.warn >= /* ~ changed by cargo-mutants ~ */ 0 {
         VerdictStatus::Warn
     } else {
         VerdictStatus::Pass
     };
 
     let mut reasons: Vec<String> = Vec::new();
     if evaluation.truncated_findings > 0 {
         reasons.push(REASON_TRUNCATED.to_string());

---- check::tests::run_check_passes_with_no_findings stdout ----

thread 'check::tests::run_check_passes_with_no_findings' (813056) panicked at crates/diffguard-core/src/check.rs:661:9:
assertion `left == right` failed
  left: Warn
 right: Pass

---- check::tests::run_check_filters_acknowledged_false_positive_fingerprints stdout ----

thread 'check::tests::run_check_filters_acknowledged_false_positive_fingerprints' (813052) panicked at crates/diffguard-core/src/check.rs:581:9:
assertion `left == right` failed
  left: Warn
 right: Pass

failures:
    check::tests::run_check_filters_acknowledged_false_positive_fingerprints
    check::tests::run_check_passes_with_no_findings

test result: FAILED. 124 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
