*** crates/diffguard-core/src/check.rs:178:38: replace > with < in run_check

*** mutation diff:
--- crates/diffguard-core/src/check.rs
+++ replace > with < in run_check
@@ -170,17 +170,17 @@
         VerdictStatus::Fail
     } else if adjusted_counts.warn > 0 {
         VerdictStatus::Warn
     } else {
         VerdictStatus::Pass
     };
 
     let mut reasons: Vec<String> = Vec::new();
-    if evaluation.truncated_findings > 0 {
+    if evaluation.truncated_findings < /* ~ changed by cargo-mutants ~ */ 0 {
         reasons.push(REASON_TRUNCATED.to_string());
     }
 
     let receipt = CheckReceipt {
         schema: diffguard_types::CHECK_SCHEMA_V1.to_string(),
         tool: ToolMeta {
             name: "diffguard".to_string(),
             version: env!("CARGO_PKG_VERSION").to_string(),

---- check::tests::run_check_includes_truncation_reason stdout ----

thread 'check::tests::run_check_includes_truncation_reason' (814641) panicked at crates/diffguard-core/src/check.rs:638:9:
assertion failed: run.receipt.verdict.reasons.iter().any(|r| r == REASON_TRUNCATED)

failures:
    check::tests::run_check_includes_truncation_reason

test result: FAILED. 125 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.10s

*** result: Failure(101)
