*** crates/diffguard-core/src/check.rs:178:38: replace > with >= in run_check

*** mutation diff:
--- crates/diffguard-core/src/check.rs
+++ replace > with >= in run_check
@@ -170,17 +170,17 @@
         VerdictStatus::Fail
     } else if adjusted_counts.warn > 0 {
         VerdictStatus::Warn
     } else {
         VerdictStatus::Pass
     };
 
     let mut reasons: Vec<String> = Vec::new();
-    if evaluation.truncated_findings > 0 {
+    if evaluation.truncated_findings >= /* ~ changed by cargo-mutants ~ */ 0 {
         reasons.push(REASON_TRUNCATED.to_string());
     }
 
     let receipt = CheckReceipt {
         schema: diffguard_types::CHECK_SCHEMA_V1.to_string(),
         tool: ToolMeta {
             name: "diffguard".to_string(),
             version: env!("CARGO_PKG_VERSION").to_string(),

---- check::tests::run_check_passes_with_no_findings stdout ----

thread 'check::tests::run_check_passes_with_no_findings' (815435) panicked at crates/diffguard-core/src/check.rs:662:9:
assertion failed: run.receipt.verdict.reasons.is_empty()

---- check::tests::run_check_sets_warn_verdict_and_reasons stdout ----

thread 'check::tests::run_check_sets_warn_verdict_and_reasons' (815437) panicked at crates/diffguard-core/src/check.rs:602:9:
assertion failed: run.receipt.verdict.reasons.is_empty()

---- check::tests::run_check_sets_error_verdict_and_reasons stdout ----

thread 'check::tests::run_check_sets_error_verdict_and_reasons' (815436) panicked at crates/diffguard-core/src/check.rs:620:9:
assertion failed: run.receipt.verdict.reasons.is_empty()

failures:
    check::tests::run_check_passes_with_no_findings
    check::tests::run_check_sets_error_verdict_and_reasons
    check::tests::run_check_sets_warn_verdict_and_reasons

test result: FAILED. 123 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
