*** crates/diffguard-core/src/check.rs:251:5: replace compile_filter_globs -> Result<GlobSet, PathFilterError> with Ok(Default::default())

*** mutation diff:
--- crates/diffguard-core/src/check.rs
+++ replace compile_filter_globs -> Result<GlobSet, PathFilterError> with Ok(Default::default())
@@ -243,25 +243,17 @@
         truncated_findings: evaluation.truncated_findings,
         rules_evaluated,
         rule_hits,
         false_positive_findings,
     })
 }
 
 fn compile_filter_globs(globs: &[String]) -> Result<GlobSet, PathFilterError> {
-    let mut b = GlobSetBuilder::new();
-    for g in globs {
-        let glob = Glob::new(g).map_err(|e| PathFilterError::InvalidGlob {
-            glob: g.clone(),
-            source: e,
-        })?;
-        b.add(glob);
-    }
-    Ok(b.build().expect("globset build should succeed"))
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Filter a rule based on tag criteria in the plan.
 ///
 /// - If `only_tags` is non-empty, the rule must have at least one matching tag.
 /// - `enable_tags` is additive to `only_tags` (a rule matching either set is included).
 /// - If `disable_tags` is non-empty and the rule has any matching tag, it's excluded.
 fn filter_rule_by_tags(rule: &diffguard_types::RuleConfig, plan: &CheckPlan) -> bool {

---- check::tests::compile_filter_globs_rejects_invalid stdout ----

thread 'check::tests::compile_filter_globs_rejects_invalid' (817003) panicked at crates/diffguard-core/src/check.rs:419:60:
called `Result::unwrap_err()` on an `Ok` value: GlobSet { len: 0, strats: [] }

---- check::tests::run_check_with_path_filters_filters_findings stdout ----

thread 'check::tests::run_check_with_path_filters_filters_findings' (817024) panicked at crates/diffguard-core/src/check.rs:462:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    check::tests::compile_filter_globs_rejects_invalid
    check::tests::run_check_with_path_filters_filters_findings

test result: FAILED. 124 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.10s

*** result: Failure(101)
