*** crates/diffguard-core/src/check.rs:270:5: replace filter_rule_by_tags -> bool with false

*** mutation diff:
--- crates/diffguard-core/src/check.rs
+++ replace filter_rule_by_tags -> bool with false
@@ -262,44 +262,17 @@
 /// Filter a rule based on tag criteria in the plan.
 ///
 /// - If `only_tags` is non-empty, the rule must have at least one matching tag.
 /// - `enable_tags` is additive to `only_tags` (a rule matching either set is included).
 /// - If `disable_tags` is non-empty and the rule has any matching tag, it's excluded.
 fn filter_rule_by_tags(rule: &diffguard_types::RuleConfig, plan: &CheckPlan) -> bool {
     // If only_tags is specified, allow rules matching only_tags OR enable_tags.
     // This keeps enable_tags additive rather than restrictive on its own.
-    if !plan.only_tags.is_empty() {
-        let has_only_tag = rule
-            .tags
-            .iter()
-            .any(|t| plan.only_tags.iter().any(|ot| ot.eq_ignore_ascii_case(t)));
-        let has_enabled_tag = !plan.enable_tags.is_empty()
-            && rule
-                .tags
-                .iter()
-                .any(|t| plan.enable_tags.iter().any(|et| et.eq_ignore_ascii_case(t)));
-        if !has_only_tag && !has_enabled_tag {
-            return false;
-        }
-    }
-
-    // If disable_tags is specified, exclude rules that have any matching tag
-    if !plan.disable_tags.is_empty() {
-        let has_disabled_tag = rule.tags.iter().any(|t| {
-            plan.disable_tags
-                .iter()
-                .any(|dt| dt.eq_ignore_ascii_case(t))
-        });
-        if has_disabled_tag {
-            return false;
-        }
-    }
-
-    true
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn compute_exit_code(fail_on: FailOn, counts: &VerdictCounts) -> i32 {
     if matches!(fail_on, FailOn::Never) {
         return 0;
     }
 
     if counts.error > 0 {

---- check::tests::filter_rule_by_tags_disable_tags_no_match stdout ----

thread 'check::tests::filter_rule_by_tags_disable_tags_no_match' (818590) panicked at crates/diffguard-core/src/check.rs:814:9:
assertion failed: filter_rule_by_tags(&rule, &plan)

---- check::tests::filter_rule_by_tags_enable_tags_additive_with_only_tags stdout ----

thread 'check::tests::filter_rule_by_tags_enable_tags_additive_with_only_tags' (818591) panicked at crates/diffguard-core/src/check.rs:789:9:
assertion failed: filter_rule_by_tags(&rule, &plan)

---- check::tests::filter_rule_by_tags_enable_tags_no_effect_without_only_tags stdout ----

thread 'check::tests::filter_rule_by_tags_enable_tags_no_effect_without_only_tags' (818592) panicked at crates/diffguard-core/src/check.rs:798:9:
assertion failed: filter_rule_by_tags(&rule, &plan)

failures:
    check::tests::filter_rule_by_tags_disable_tags_no_match
    check::tests::filter_rule_by_tags_enable_tags_additive_with_only_tags
    check::tests::filter_rule_by_tags_enable_tags_no_effect_without_only_tags
    check::tests::filter_rule_by_tags_no_filters
    check::tests::filter_rule_by_tags_only_tags_case_insensitive
    check::tests::filter_rule_by_tags_only_tags_matches
    check::tests::filter_rule_by_tags_rule_without_tags
    check::tests::run_check_dedupes_duplicate_diff_lines
    check::tests::run_check_filters_acknowledged_false_positive_fingerprints
    check::tests::run_check_filters_by_allowed_lines
    check::tests::run_check_force_language_applies_rules_for_unknown_extensions
    check::tests::run_check_includes_truncation_reason

test result: FAILED. 107 passed; 19 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
