*** crates/diffguard-core/src/check.rs:270:8: delete ! in filter_rule_by_tags

*** mutation diff:
--- crates/diffguard-core/src/check.rs
+++ delete ! in filter_rule_by_tags
@@ -262,17 +262,17 @@
 /// Filter a rule based on tag criteria in the plan.
 ///
 /// - If `only_tags` is non-empty, the rule must have at least one matching tag.
 /// - `enable_tags` is additive to `only_tags` (a rule matching either set is included).
 /// - If `disable_tags` is non-empty and the rule has any matching tag, it's excluded.
 fn filter_rule_by_tags(rule: &diffguard_types::RuleConfig, plan: &CheckPlan) -> bool {
     // If only_tags is specified, allow rules matching only_tags OR enable_tags.
     // This keeps enable_tags additive rather than restrictive on its own.
-    if !plan.only_tags.is_empty() {
+    if  /* ~ changed by cargo-mutants ~ */plan.only_tags.is_empty() {
         let has_only_tag = rule
             .tags
             .iter()
             .any(|t| plan.only_tags.iter().any(|ot| ot.eq_ignore_ascii_case(t)));
         let has_enabled_tag = !plan.enable_tags.is_empty()
             && rule
                 .tags
                 .iter()

---- check::tests::filter_rule_by_tags_disable_tags_no_match stdout ----

thread 'check::tests::filter_rule_by_tags_disable_tags_no_match' (819383) panicked at crates/diffguard-core/src/check.rs:841:9:
assertion failed: filter_rule_by_tags(&rule, &plan)

---- check::tests::filter_rule_by_tags_enable_tags_no_effect_without_only_tags stdout ----

thread 'check::tests::filter_rule_by_tags_enable_tags_no_effect_without_only_tags' (819385) panicked at crates/diffguard-core/src/check.rs:825:9:
assertion failed: filter_rule_by_tags(&rule, &plan)

---- check::tests::filter_rule_by_tags_no_filters stdout ----

thread 'check::tests::filter_rule_by_tags_no_filters' (819386) panicked at crates/diffguard-core/src/check.rs:782:9:
assertion failed: filter_rule_by_tags(&rule, &plan)

failures:
    check::tests::filter_rule_by_tags_disable_tags_no_match
    check::tests::filter_rule_by_tags_enable_tags_no_effect_without_only_tags
    check::tests::filter_rule_by_tags_no_filters
    check::tests::filter_rule_by_tags_only_tags_no_match
    check::tests::filter_rule_by_tags_rule_without_tags
    check::tests::run_check_dedupes_duplicate_diff_lines
    check::tests::run_check_filters_acknowledged_false_positive_fingerprints
    check::tests::run_check_filters_by_allowed_lines
    check::tests::run_check_force_language_applies_rules_for_unknown_extensions
    check::tests::run_check_includes_truncation_reason
    check::tests::run_check_sets_error_verdict_and_reasons
    check::tests::run_check_sets_warn_verdict_and_reasons

test result: FAILED. 109 passed; 17 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.16s

*** result: Failure(101)
