*** crates/diffguard-core/src/check.rs:275:31: delete ! in filter_rule_by_tags

*** mutation diff:
--- crates/diffguard-core/src/check.rs
+++ delete ! in filter_rule_by_tags
@@ -267,17 +267,17 @@
 fn filter_rule_by_tags(rule: &diffguard_types::RuleConfig, plan: &CheckPlan) -> bool {
     // If only_tags is specified, allow rules matching only_tags OR enable_tags.
     // This keeps enable_tags additive rather than restrictive on its own.
     if !plan.only_tags.is_empty() {
         let has_only_tag = rule
             .tags
             .iter()
             .any(|t| plan.only_tags.iter().any(|ot| ot.eq_ignore_ascii_case(t)));
-        let has_enabled_tag = !plan.enable_tags.is_empty()
+        let has_enabled_tag =  /* ~ changed by cargo-mutants ~ */plan.enable_tags.is_empty()
             && rule
                 .tags
                 .iter()
                 .any(|t| plan.enable_tags.iter().any(|et| et.eq_ignore_ascii_case(t)));
         if !has_only_tag && !has_enabled_tag {
             return false;
         }
     }

---- check::tests::filter_rule_by_tags_enable_tags_additive_with_only_tags stdout ----

thread 'check::tests::filter_rule_by_tags_enable_tags_additive_with_only_tags' (821016) panicked at crates/diffguard-core/src/check.rs:816:9:
assertion failed: filter_rule_by_tags(&rule, &plan)

failures:
    check::tests::filter_rule_by_tags_enable_tags_additive_with_only_tags

test result: FAILED. 125 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
