*** crates/diffguard-core/src/check.rs:276:13: replace && with || in filter_rule_by_tags

*** mutation diff:
--- crates/diffguard-core/src/check.rs
+++ replace && with || in filter_rule_by_tags
@@ -268,17 +268,17 @@
     // If only_tags is specified, allow rules matching only_tags OR enable_tags.
     // This keeps enable_tags additive rather than restrictive on its own.
     if !plan.only_tags.is_empty() {
         let has_only_tag = rule
             .tags
             .iter()
             .any(|t| plan.only_tags.iter().any(|ot| ot.eq_ignore_ascii_case(t)));
         let has_enabled_tag = !plan.enable_tags.is_empty()
-            && rule
+            || /* ~ changed by cargo-mutants ~ */ rule
                 .tags
                 .iter()
                 .any(|t| plan.enable_tags.iter().any(|et| et.eq_ignore_ascii_case(t)));
         if !has_only_tag && !has_enabled_tag {
             return false;
         }
     }

*** result: Success
