*** crates/diffguard-core/src/check.rs:280:12: delete ! in filter_rule_by_tags

*** mutation diff:
--- crates/diffguard-core/src/check.rs
+++ delete ! in filter_rule_by_tags
@@ -272,17 +272,17 @@
             .tags
             .iter()
             .any(|t| plan.only_tags.iter().any(|ot| ot.eq_ignore_ascii_case(t)));
         let has_enabled_tag = !plan.enable_tags.is_empty()
             && rule
                 .tags
                 .iter()
                 .any(|t| plan.enable_tags.iter().any(|et| et.eq_ignore_ascii_case(t)));
-        if !has_only_tag && !has_enabled_tag {
+        if  /* ~ changed by cargo-mutants ~ */has_only_tag && !has_enabled_tag {
             return false;
         }
     }
 
     // If disable_tags is specified, exclude rules that have any matching tag
     if !plan.disable_tags.is_empty() {
         let has_disabled_tag = rule.tags.iter().any(|t| {
             plan.disable_tags

---- check::tests::filter_rule_by_tags_only_tags_case_insensitive stdout ----

thread 'check::tests::filter_rule_by_tags_only_tags_case_insensitive' (822605) panicked at crates/diffguard-core/src/check.rs:806:9:
assertion failed: filter_rule_by_tags(&rule, &plan)

---- check::tests::filter_rule_by_tags_only_tags_no_match stdout ----

thread 'check::tests::filter_rule_by_tags_only_tags_no_match' (822607) panicked at crates/diffguard-core/src/check.rs:798:9:
assertion failed: !filter_rule_by_tags(&rule, &plan)

---- check::tests::filter_rule_by_tags_only_tags_matches stdout ----

thread 'check::tests::filter_rule_by_tags_only_tags_matches' (822606) panicked at crates/diffguard-core/src/check.rs:790:9:
assertion failed: filter_rule_by_tags(&rule, &plan)

failures:
    check::tests::filter_rule_by_tags_only_tags_case_insensitive
    check::tests::filter_rule_by_tags_only_tags_matches
    check::tests::filter_rule_by_tags_only_tags_no_match
    check::tests::filter_rule_by_tags_rule_without_tags

test result: FAILED. 122 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
