*** crates/diffguard-core/src/check.rs:280:26: replace && with || in filter_rule_by_tags

*** mutation diff:
--- crates/diffguard-core/src/check.rs
+++ replace && with || in filter_rule_by_tags
@@ -272,17 +272,17 @@
             .tags
             .iter()
             .any(|t| plan.only_tags.iter().any(|ot| ot.eq_ignore_ascii_case(t)));
         let has_enabled_tag = !plan.enable_tags.is_empty()
             && rule
                 .tags
                 .iter()
                 .any(|t| plan.enable_tags.iter().any(|et| et.eq_ignore_ascii_case(t)));
-        if !has_only_tag && !has_enabled_tag {
+        if !has_only_tag || /* ~ changed by cargo-mutants ~ */ !has_enabled_tag {
             return false;
         }
     }
 
     // If disable_tags is specified, exclude rules that have any matching tag
     if !plan.disable_tags.is_empty() {
         let has_disabled_tag = rule.tags.iter().any(|t| {
             plan.disable_tags

---- check::tests::filter_rule_by_tags_enable_tags_additive_with_only_tags stdout ----

thread 'check::tests::filter_rule_by_tags_enable_tags_additive_with_only_tags' (821809) panicked at crates/diffguard-core/src/check.rs:816:9:
assertion failed: filter_rule_by_tags(&rule, &plan)

---- check::tests::filter_rule_by_tags_only_tags_case_insensitive stdout ----

thread 'check::tests::filter_rule_by_tags_only_tags_case_insensitive' (821812) panicked at crates/diffguard-core/src/check.rs:806:9:
assertion failed: filter_rule_by_tags(&rule, &plan)

---- check::tests::filter_rule_by_tags_only_tags_matches stdout ----

thread 'check::tests::filter_rule_by_tags_only_tags_matches' (821813) panicked at crates/diffguard-core/src/check.rs:790:9:
assertion failed: filter_rule_by_tags(&rule, &plan)

failures:
    check::tests::filter_rule_by_tags_enable_tags_additive_with_only_tags
    check::tests::filter_rule_by_tags_only_tags_case_insensitive
    check::tests::filter_rule_by_tags_only_tags_matches

test result: FAILED. 123 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.10s

*** result: Failure(101)
