*** crates/diffguard-core/src/check.rs:280:29: delete ! in filter_rule_by_tags

*** mutation diff:
--- crates/diffguard-core/src/check.rs
+++ delete ! in filter_rule_by_tags
@@ -272,17 +272,17 @@
             .tags
             .iter()
             .any(|t| plan.only_tags.iter().any(|ot| ot.eq_ignore_ascii_case(t)));
         let has_enabled_tag = !plan.enable_tags.is_empty()
             && rule
                 .tags
                 .iter()
                 .any(|t| plan.enable_tags.iter().any(|et| et.eq_ignore_ascii_case(t)));
-        if !has_only_tag && !has_enabled_tag {
+        if !has_only_tag &&  /* ~ changed by cargo-mutants ~ */has_enabled_tag {
             return false;
         }
     }
 
     // If disable_tags is specified, exclude rules that have any matching tag
     if !plan.disable_tags.is_empty() {
         let has_disabled_tag = rule.tags.iter().any(|t| {
             plan.disable_tags

---- check::tests::filter_rule_by_tags_enable_tags_additive_with_only_tags stdout ----

thread 'check::tests::filter_rule_by_tags_enable_tags_additive_with_only_tags' (823395) panicked at crates/diffguard-core/src/check.rs:816:9:
assertion failed: filter_rule_by_tags(&rule, &plan)

---- check::tests::filter_rule_by_tags_only_tags_no_match stdout ----

thread 'check::tests::filter_rule_by_tags_only_tags_no_match' (823400) panicked at crates/diffguard-core/src/check.rs:798:9:
assertion failed: !filter_rule_by_tags(&rule, &plan)

---- check::tests::filter_rule_by_tags_rule_without_tags stdout ----

thread 'check::tests::filter_rule_by_tags_rule_without_tags' (823401) panicked at crates/diffguard-core/src/check.rs:864:9:
assertion failed: !filter_rule_by_tags(&rule, &plan)

failures:
    check::tests::filter_rule_by_tags_enable_tags_additive_with_only_tags
    check::tests::filter_rule_by_tags_only_tags_no_match
    check::tests::filter_rule_by_tags_rule_without_tags

test result: FAILED. 123 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.10s

*** result: Failure(101)
