*** crates/diffguard-core/src/check.rs:286:8: delete ! in filter_rule_by_tags

*** mutation diff:
--- crates/diffguard-core/src/check.rs
+++ delete ! in filter_rule_by_tags
@@ -278,17 +278,17 @@
                 .iter()
                 .any(|t| plan.enable_tags.iter().any(|et| et.eq_ignore_ascii_case(t)));
         if !has_only_tag && !has_enabled_tag {
             return false;
         }
     }
 
     // If disable_tags is specified, exclude rules that have any matching tag
-    if !plan.disable_tags.is_empty() {
+    if  /* ~ changed by cargo-mutants ~ */plan.disable_tags.is_empty() {
         let has_disabled_tag = rule.tags.iter().any(|t| {
             plan.disable_tags
                 .iter()
                 .any(|dt| dt.eq_ignore_ascii_case(t))
         });
         if has_disabled_tag {
             return false;
         }

---- check::tests::filter_rule_by_tags_disable_tags_excludes stdout ----

thread 'check::tests::filter_rule_by_tags_disable_tags_excludes' (824186) panicked at crates/diffguard-core/src/check.rs:833:9:
assertion failed: !filter_rule_by_tags(&rule, &plan)

---- check::tests::filter_rule_by_tags_combined_filters stdout ----

thread 'check::tests::filter_rule_by_tags_combined_filters' (824185) panicked at crates/diffguard-core/src/check.rs:855:9:
assertion failed: !filter_rule_by_tags(&rule, &plan)

failures:
    check::tests::filter_rule_by_tags_combined_filters
    check::tests::filter_rule_by_tags_disable_tags_excludes

test result: FAILED. 124 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.10s

*** result: Failure(101)
