*** crates/diffguard-core/src/check.rs:301:5: replace compute_exit_code -> i32 with 0

*** mutation diff:
--- crates/diffguard-core/src/check.rs
+++ replace compute_exit_code -> i32 with 0
@@ -293,29 +293,17 @@
             return false;
         }
     }
 
     true
 }
 
 fn compute_exit_code(fail_on: FailOn, counts: &VerdictCounts) -> i32 {
-    if matches!(fail_on, FailOn::Never) {
-        return 0;
-    }
-
-    if counts.error > 0 {
-        return 2;
-    }
-
-    if matches!(fail_on, FailOn::Warn) && counts.warn > 0 {
-        return 3;
-    }
-
-    0
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 fn render_annotations(findings: &[Finding]) -> Vec<String> {
     findings
         .iter()
         .map(|f| {
             let level = match f.severity {
                 diffguard_types::Severity::Info => "notice",

---- check::tests::exit_code_semantics stdout ----

thread 'check::tests::exit_code_semantics' (824977) panicked at crates/diffguard-core/src/check.rs:405:9:
assertion `left == right` failed
  left: 0
 right: 3

failures:
    check::tests::exit_code_semantics

test result: FAILED. 125 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
