*** crates/diffguard-core/src/check.rs:305:21: replace > with < in compute_exit_code

*** mutation diff:
--- crates/diffguard-core/src/check.rs
+++ replace > with < in compute_exit_code
@@ -297,17 +297,17 @@
     true
 }
 
 fn compute_exit_code(fail_on: FailOn, counts: &VerdictCounts) -> i32 {
     if matches!(fail_on, FailOn::Never) {
         return 0;
     }
 
-    if counts.error > 0 {
+    if counts.error < /* ~ changed by cargo-mutants ~ */ 0 {
         return 2;
     }
 
     if matches!(fail_on, FailOn::Warn) && counts.warn > 0 {
         return 3;
     }
 
     0

---- check::tests::exit_code_semantics stdout ----

thread 'check::tests::exit_code_semantics' (828149) panicked at crates/diffguard-core/src/check.rs:420:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    check::tests::exit_code_semantics

test result: FAILED. 125 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.10s

*** result: Failure(101)
