*** crates/diffguard-core/src/check.rs:309:55: replace > with == in compute_exit_code

*** mutation diff:
--- crates/diffguard-core/src/check.rs
+++ replace > with == in compute_exit_code
@@ -301,17 +301,17 @@
     if matches!(fail_on, FailOn::Never) {
         return 0;
     }
 
     if counts.error > 0 {
         return 2;
     }
 
-    if matches!(fail_on, FailOn::Warn) && counts.warn > 0 {
+    if matches!(fail_on, FailOn::Warn) && counts.warn == /* ~ changed by cargo-mutants ~ */ 0 {
         return 3;
     }
 
     0
 }
 
 fn render_annotations(findings: &[Finding]) -> Vec<String> {
     findings

---- check::tests::exit_code_semantics stdout ----

thread 'check::tests::exit_code_semantics' (830529) panicked at crates/diffguard-core/src/check.rs:413:9:
assertion `left == right` failed
  left: 3
 right: 0

failures:
    check::tests::exit_code_semantics

test result: FAILED. 125 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
