*** crates/diffguard-core/src/check.rs:317:5: replace render_annotations -> Vec<String> with vec![]

*** mutation diff:
--- crates/diffguard-core/src/check.rs
+++ replace render_annotations -> Vec<String> with vec![]
@@ -309,34 +309,17 @@
     if matches!(fail_on, FailOn::Warn) && counts.warn > 0 {
         return 3;
     }
 
     0
 }
 
 fn render_annotations(findings: &[Finding]) -> Vec<String> {
-    findings
-        .iter()
-        .map(|f| {
-            let level = match f.severity {
-                diffguard_types::Severity::Info => "notice",
-                diffguard_types::Severity::Warn => "warning",
-                diffguard_types::Severity::Error => "error",
-            };
-            format!(
-                "::{level} file={path},line={line}::{rule} {msg}",
-                level = level,
-                path = f.path,
-                line = f.line,
-                rule = f.rule_id,
-                msg = f.message
-            )
-        })
-        .collect()
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use proptest::prelude::*;
 
     fn test_finding(severity: diffguard_types::Severity) -> Finding {

---- check::tests::property_annotations_format_matches_expected stdout ----
proptest: Saving this and future failures in /tmp/cargo-mutants-diffguard-zpeclc.tmp/crates/diffguard-core/proptest-regressions/check.txt
proptest: If this test was run on a CI system, you may wish to add the following line to your copy of the file. (You may need to create it.)
cc 0281d2a54e25bfc208927124dc2e8b4296e4c5d8d881caad4f2c01ad2dcd1399

thread 'check::tests::property_annotations_format_matches_expected' (832919) panicked at crates/diffguard-core/src/check.rs:648:5:
Test failed: assertion failed: `(left == right)` 
  left: `0`,
 right: `1` at crates/diffguard-core/src/check.rs:660.
minimal failing input: severity = Info, line = 1
	successes: 0
	local rejects: 0
	global rejects: 0

---- check::tests::snapshot_annotations_with_multiple_severities stdout ----
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ Snapshot Summary ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
Snapshot file: crates/diffguard-core/src/snapshots/diffguard_core__check__tests__snapshot_annotations_with_multiple_severities.snap
Snapshot: snapshot_annotations_with_multiple_severities
Source: crates/diffguard-core/src/check.rs:689
────────────────────────────────────────────────────────────────────────────────
Expression: annotations.join("\n")
────────────────────────────────────────────────────────────────────────────────
-old snapshot
+new results
────────────┬───────────────────────────────────────────────────────────────────
    1       │-::notice file=src/lib.rs,line=42::test.rule Test message
    2       │-::warning file=src/lib.rs,line=42::test.rule Test message
    3       │-::error file=src/lib.rs,line=42::test.rule Te

failures:
    check::tests::property_annotations_format_matches_expected
    check::tests::snapshot_annotations_with_multiple_severities

test result: FAILED. 124 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
