*** crates/diffguard-core/src/check.rs:317:5: replace render_annotations -> Vec<String> with vec!["xyzzy".into()]

*** mutation diff:
--- crates/diffguard-core/src/check.rs
+++ replace render_annotations -> Vec<String> with vec!["xyzzy".into()]
@@ -309,34 +309,17 @@
     if matches!(fail_on, FailOn::Warn) && counts.warn > 0 {
         return 3;
     }
 
     0
 }
 
 fn render_annotations(findings: &[Finding]) -> Vec<String> {
-    findings
-        .iter()
-        .map(|f| {
-            let level = match f.severity {
-                diffguard_types::Severity::Info => "notice",
-                diffguard_types::Severity::Warn => "warning",
-                diffguard_types::Severity::Error => "error",
-            };
-            format!(
-                "::{level} file={path},line={line}::{rule} {msg}",
-                level = level,
-                path = f.path,
-                line = f.line,
-                rule = f.rule_id,
-                msg = f.message
-            )
-        })
-        .collect()
+    vec!["xyzzy".into()] /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use proptest::prelude::*;
 
     fn test_finding(severity: diffguard_types::Severity) -> Finding {

---- check::tests::property_annotations_format_matches_expected stdout ----

thread 'check::tests::property_annotations_format_matches_expected' (834523) panicked at crates/diffguard-core/src/check.rs:648:5:
Test failed: assertion failed: `(left == right)` 
  left: `"xyzzy"`,
 right: `"::notice file=src/lib.rs,line=1::test.rule Test message"` at crates/diffguard-core/src/check.rs:677.
minimal failing input: severity = Info, line = 1
	successes: 0
	local rejects: 0
	global rejects: 0

---- check::tests::snapshot_annotations_with_multiple_severities stdout ----
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ Snapshot Summary ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
Snapshot file: crates/diffguard-core/src/snapshots/diffguard_core__check__tests__snapshot_annotations_with_multiple_severities.snap
Snapshot: snapshot_annotations_with_multiple_severities
Source: crates/diffguard-core/src/check.rs:689
────────────────────────────────────────────────────────────────────────────────
Expression: annotations.join("\n")
────────────────────────────────────────────────────────────────────────────────
-old snapshot
+new results
────────────┬───────────────────────────────────────────────────────────────────
    1       │-::notice file=src/lib.rs,line=42::test.rule Test message
    2       │-::warning file=src/lib.rs,line=42::test.rule Test message
    3       │-::error file=src/lib.rs,line=42::test.rule Te

failures:
    check::tests::property_annotations_format_matches_expected
    check::tests::snapshot_annotations_with_multiple_severities

test result: FAILED. 124 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.12s

*** result: Failure(101)
