*** crates/diffguard-core/src/check.rs:91:8: delete ! in run_check

*** mutation diff:
--- crates/diffguard-core/src/check.rs
+++ delete ! in run_check
@@ -83,17 +83,17 @@
 
 pub fn run_check(
     plan: &CheckPlan,
     config: &diffguard_types::ConfigFile,
     diff_text: &str,
 ) -> Result<CheckRun, anyhow::Error> {
     let (mut diff_lines, _stats) = parse_unified_diff(diff_text, plan.scope)?;
 
-    if !plan.path_filters.is_empty() {
+    if  /* ~ changed by cargo-mutants ~ */plan.path_filters.is_empty() {
         let filters = compile_filter_globs(&plan.path_filters)?;
         diff_lines.retain(|l| filters.is_match(Path::new(&l.path)));
     }
 
     if let Some(allowed_lines) = &plan.allowed_lines {
         diff_lines.retain(|l| allowed_lines.contains(&(l.path.clone(), l.line)));
     }

---- check::tests::run_check_dedupes_duplicate_diff_lines stdout ----

thread 'check::tests::run_check_dedupes_duplicate_diff_lines' (808293) panicked at crates/diffguard-core/src/check.rs:489:9:
assertion `left == right` failed
  left: 0
 right: 1

---- check::tests::run_check_includes_truncation_reason stdout ----

thread 'check::tests::run_check_includes_truncation_reason' (808297) panicked at crates/diffguard-core/src/check.rs:638:9:
assertion failed: run.receipt.verdict.reasons.iter().any(|r| r == REASON_TRUNCATED)

---- check::tests::run_check_filters_acknowledged_false_positive_fingerprints stdout ----

thread 'check::tests::run_check_filters_acknowledged_false_positive_fingerprints' (808294) panicked at crates/diffguard-core/src/check.rs:573:86:
index out of bounds: the len is 0 but the index is 0

failures:
    check::tests::run_check_dedupes_duplicate_diff_lines
    check::tests::run_check_filters_acknowledged_false_positive_fingerprints
    check::tests::run_check_filters_by_allowed_lines
    check::tests::run_check_force_language_applies_rules_for_unknown_extensions
    check::tests::run_check_includes_truncation_reason
    check::tests::run_check_sets_error_verdict_and_reasons
    check::tests::run_check_sets_warn_verdict_and_reasons
    check::tests::run_check_with_path_filters_filters_findings
    check::tests::run_check_without_path_filters_keeps_findings
    sensor_api::tests::run_sensor_populates_rule_metadata
    sensor_api::tests::run_sensor_returns_sensor_report

test result: FAILED. 115 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
