*** crates/diffguard-core/src/csv.rs:15:5: replace render_csv_for_receipt -> String with "xyzzy".into()

*** mutation diff:
--- crates/diffguard-core/src/csv.rs
+++ replace render_csv_for_receipt -> String with "xyzzy".into()
@@ -7,28 +7,17 @@
 
 /// CSV header row.
 const CSV_HEADER: &str = "file,line,rule_id,severity,message,snippet";
 
 /// Renders a CheckReceipt as a CSV report (RFC 4180 compliant).
 ///
 /// Columns: file, line, rule_id, severity, message, snippet
 pub fn render_csv_for_receipt(receipt: &CheckReceipt) -> String {
-    let mut out = String::new();
-
-    // Header row
-    out.push_str(CSV_HEADER);
-    out.push('\n');
-
-    // Data rows
-    for f in &receipt.findings {
-        out.push_str(&render_csv_row(f));
-    }
-
-    out
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Renders a CheckReceipt as a TSV report.
 ///
 /// Columns: file, line, rule_id, severity, message, snippet
 pub fn render_tsv_for_receipt(receipt: &CheckReceipt) -> String {
     let mut out = String::new();

---- csv::tests::csv_has_correct_row_count stdout ----

thread 'csv::tests::csv_has_correct_row_count' (836162) panicked at crates/diffguard-core/src/csv.rs:228:9:
assertion `left == right` failed
  left: 1
 right: 3

---- csv::tests::csv_has_header_row stdout ----

thread 'csv::tests::csv_has_header_row' (836163) panicked at crates/diffguard-core/src/csv.rs:219:9:
assertion failed: csv.starts_with("file,line,rule_id,severity,message,snippet\n")

---- csv::tests::csv_escapes_newlines stdout ----

thread 'csv::tests::csv_escapes_newlines' (836160) panicked at crates/diffguard-core/src/csv.rs:261:9:
assertion failed: csv.contains("\"let s = \"\"hello")

failures:
    csv::tests::csv_empty_receipt_has_header_only
    csv::tests::csv_escapes_commas
    csv::tests::csv_escapes_newlines
    csv::tests::csv_escapes_quotes
    csv::tests::csv_has_correct_row_count
    csv::tests::csv_has_header_row
    csv::tests::snapshot_csv_no_findings
    csv::tests::snapshot_csv_special_chars
    csv::tests::snapshot_csv_with_findings

test result: FAILED. 117 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
