*** crates/diffguard-core/src/csv.rs:33:5: replace render_tsv_for_receipt -> String with "xyzzy".into()

*** mutation diff:
--- crates/diffguard-core/src/csv.rs
+++ replace render_tsv_for_receipt -> String with "xyzzy".into()
@@ -25,28 +25,17 @@
 
     out
 }
 
 /// Renders a CheckReceipt as a TSV report.
 ///
 /// Columns: file, line, rule_id, severity, message, snippet
 pub fn render_tsv_for_receipt(receipt: &CheckReceipt) -> String {
-    let mut out = String::new();
-
-    // Header row
-    out.push_str(&CSV_HEADER.replace(',', "\t"));
-    out.push('\n');
-
-    // Data rows
-    for f in &receipt.findings {
-        out.push_str(&render_tsv_row(f));
-    }
-
-    out
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Renders a single finding as a CSV row.
 fn render_csv_row(f: &Finding) -> String {
     format!(
         "{},{},{},{},{},{}\n",
         escape_csv_field(&f.path),
         f.line,

---- csv::tests::tsv_escapes_newlines stdout ----

thread 'csv::tests::tsv_escapes_newlines' (837822) panicked at crates/diffguard-core/src/csv.rs:304:9:
assertion failed: tsv.contains("hello\\nworld")

---- csv::tests::tsv_escapes_tabs stdout ----

thread 'csv::tests::tsv_escapes_tabs' (837823) panicked at crates/diffguard-core/src/csv.rs:296:9:
assertion failed: tsv.contains("let\\tx = 1;")

---- csv::tests::tsv_has_header_row stdout ----

thread 'csv::tests::tsv_has_header_row' (837825) panicked at crates/diffguard-core/src/csv.rs:270:9:
assertion failed: tsv.starts_with("file\tline\trule_id\tseverity\tmessage\tsnippet\n")

failures:
    csv::tests::snapshot_tsv_no_findings
    csv::tests::snapshot_tsv_special_chars
    csv::tests::snapshot_tsv_with_findings
    csv::tests::tsv_escapes_newlines
    csv::tests::tsv_escapes_tabs
    csv::tests::tsv_has_correct_row_count
    csv::tests::tsv_has_header_row

test result: FAILED. 119 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
