*** crates/diffguard-core/src/csv.rs:49:5: replace render_csv_row -> String with String::new()

*** mutation diff:
--- crates/diffguard-core/src/csv.rs
+++ replace render_csv_row -> String with String::new()
@@ -41,25 +41,17 @@
         out.push_str(&render_tsv_row(f));
     }
 
     out
 }
 
 /// Renders a single finding as a CSV row.
 fn render_csv_row(f: &Finding) -> String {
-    format!(
-        "{},{},{},{},{},{}\n",
-        escape_csv_field(&f.path),
-        f.line,
-        escape_csv_field(&f.rule_id),
-        f.severity.as_str(),
-        escape_csv_field(&f.message),
-        escape_csv_field(&f.snippet)
-    )
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Renders a single finding as a TSV row.
 fn render_tsv_row(f: &Finding) -> String {
     format!(
         "{}\t{}\t{}\t{}\t{}\t{}\n",
         escape_tsv_field(&f.path),
         f.line,

---- csv::tests::csv_escapes_commas stdout ----

thread 'csv::tests::csv_escapes_commas' (838619) panicked at crates/diffguard-core/src/csv.rs:256:9:
assertion failed: csv.contains("\"Message with")

---- csv::tests::csv_escapes_quotes stdout ----

thread 'csv::tests::csv_escapes_quotes' (838621) panicked at crates/diffguard-core/src/csv.rs:248:9:
assertion failed: csv.contains("\"\"quotes\"\"")

---- csv::tests::csv_has_correct_row_count stdout ----

thread 'csv::tests::csv_has_correct_row_count' (838622) panicked at crates/diffguard-core/src/csv.rs:231:9:
assertion `left == right` failed
  left: 1
 right: 3

failures:
    csv::tests::csv_escapes_commas
    csv::tests::csv_escapes_newlines
    csv::tests::csv_escapes_quotes
    csv::tests::csv_has_correct_row_count
    csv::tests::snapshot_csv_special_chars
    csv::tests::snapshot_csv_with_findings

test result: FAILED. 120 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.12s

*** result: Failure(101)
