*** crates/diffguard-core/src/csv.rs:62:5: replace render_tsv_row -> String with String::new()

*** mutation diff:
--- crates/diffguard-core/src/csv.rs
+++ replace render_tsv_row -> String with String::new()
@@ -54,25 +54,17 @@
         f.severity.as_str(),
         escape_csv_field(&f.message),
         escape_csv_field(&f.snippet)
     )
 }
 
 /// Renders a single finding as a TSV row.
 fn render_tsv_row(f: &Finding) -> String {
-    format!(
-        "{}\t{}\t{}\t{}\t{}\t{}\n",
-        escape_tsv_field(&f.path),
-        f.line,
-        escape_tsv_field(&f.rule_id),
-        f.severity.as_str(),
-        escape_tsv_field(&f.message),
-        escape_tsv_field(&f.snippet)
-    )
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Escapes a field for CSV according to RFC 4180.
 ///
 /// Fields containing commas, double quotes, or newlines are quoted.
 /// Double quotes within the field are escaped by doubling them.
 fn escape_csv_field(s: &str) -> String {
     let needs_quoting = s.contains(',') || s.contains('"') || s.contains('\n') || s.contains('\r');

---- csv::tests::tsv_escapes_tabs stdout ----

thread 'csv::tests::tsv_escapes_tabs' (840265) panicked at crates/diffguard-core/src/csv.rs:299:9:
assertion failed: tsv.contains("let\\tx = 1;")

---- csv::tests::tsv_escapes_newlines stdout ----

thread 'csv::tests::tsv_escapes_newlines' (840264) panicked at crates/diffguard-core/src/csv.rs:307:9:
assertion failed: tsv.contains("hello\\nworld")

---- csv::tests::tsv_has_correct_row_count stdout ----

thread 'csv::tests::tsv_has_correct_row_count' (840266) panicked at crates/diffguard-core/src/csv.rs:282:9:
assertion `left == right` failed
  left: 1
 right: 3

failures:
    csv::tests::snapshot_tsv_special_chars
    csv::tests::snapshot_tsv_with_findings
    csv::tests::tsv_escapes_newlines
    csv::tests::tsv_escapes_tabs
    csv::tests::tsv_has_correct_row_count

test result: FAILED. 121 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
