*** crates/diffguard-core/src/csv.rs:78:5: replace escape_csv_field -> String with "xyzzy".into()

*** mutation diff:
--- crates/diffguard-core/src/csv.rs
+++ replace escape_csv_field -> String with "xyzzy".into()
@@ -70,24 +70,17 @@
     )
 }
 
 /// Escapes a field for CSV according to RFC 4180.
 ///
 /// Fields containing commas, double quotes, or newlines are quoted.
 /// Double quotes within the field are escaped by doubling them.
 fn escape_csv_field(s: &str) -> String {
-    let needs_quoting = s.contains(',') || s.contains('"') || s.contains('\n') || s.contains('\r');
-
-    if needs_quoting {
-        let escaped = s.replace('"', "\"\"");
-        format!("\"{}\"", escaped)
-    } else {
-        s.to_string()
-    }
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Escapes a field for TSV.
 ///
 /// Tabs and newlines are escaped with backslash notation.
 fn escape_tsv_field(s: &str) -> String {
     s.replace('\\', "\\\\")
         .replace('\t', "\\t")

---- csv::tests::csv_escapes_commas stdout ----

thread 'csv::tests::csv_escapes_commas' (842674) panicked at crates/diffguard-core/src/csv.rs:257:9:
assertion failed: csv.contains("\"Message with")

---- csv::tests::csv_escapes_newlines stdout ----

thread 'csv::tests::csv_escapes_newlines' (842675) panicked at crates/diffguard-core/src/csv.rs:265:9:
assertion failed: csv.contains("\"let s = \"\"hello")

---- csv::tests::csv_escapes_quotes stdout ----

thread 'csv::tests::csv_escapes_quotes' (842677) panicked at crates/diffguard-core/src/csv.rs:249:9:
assertion failed: csv.contains("\"\"quotes\"\"")

failures:
    csv::tests::csv_escapes_commas
    csv::tests::csv_escapes_newlines
    csv::tests::csv_escapes_quotes
    csv::tests::escape_csv_field_plain_text
    csv::tests::escape_csv_field_with_carriage_return
    csv::tests::escape_csv_field_with_comma
    csv::tests::escape_csv_field_with_newline
    csv::tests::escape_csv_field_with_quote
    csv::tests::snapshot_csv_special_chars
    csv::tests::snapshot_csv_with_findings

test result: FAILED. 116 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
