*** crates/diffguard-core/src/csv.rs:78:60: replace || with && in escape_csv_field

*** mutation diff:
--- crates/diffguard-core/src/csv.rs
+++ replace || with && in escape_csv_field
@@ -70,17 +70,17 @@
     )
 }
 
 /// Escapes a field for CSV according to RFC 4180.
 ///
 /// Fields containing commas, double quotes, or newlines are quoted.
 /// Double quotes within the field are escaped by doubling them.
 fn escape_csv_field(s: &str) -> String {
-    let needs_quoting = s.contains(',') || s.contains('"') || s.contains('\n') || s.contains('\r');
+    let needs_quoting = s.contains(',') || s.contains('"') && /* ~ changed by cargo-mutants ~ */ s.contains('\n') || s.contains('\r');
 
     if needs_quoting {
         let escaped = s.replace('"', "\"\"");
         format!("\"{}\"", escaped)
     } else {
         s.to_string()
     }
 }

---- csv::tests::escape_csv_field_with_quote stdout ----

thread 'csv::tests::escape_csv_field_with_quote' (844288) panicked at crates/diffguard-core/src/csv.rs:332:9:
assertion `left == right` failed
  left: "say \"hello\""
 right: "\"say \"\"hello\"\"\""

---- csv::tests::escape_csv_field_with_newline stdout ----

thread 'csv::tests::escape_csv_field_with_newline' (844287) panicked at crates/diffguard-core/src/csv.rs:337:9:
assertion `left == right` failed
  left: "line1\nline2"
 right: "\"line1\nline2\""

failures:
    csv::tests::escape_csv_field_with_newline
    csv::tests::escape_csv_field_with_quote

test result: FAILED. 124 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.10s

*** result: Failure(101)
