*** crates/diffguard-core/src/csv.rs:92:5: replace escape_tsv_field -> String with String::new()

*** mutation diff:
--- crates/diffguard-core/src/csv.rs
+++ replace escape_tsv_field -> String with String::new()
@@ -84,20 +84,17 @@
         s.to_string()
     }
 }
 
 /// Escapes a field for TSV.
 ///
 /// Tabs and newlines are escaped with backslash notation.
 fn escape_tsv_field(s: &str) -> String {
-    s.replace('\\', "\\\\")
-        .replace('\t', "\\t")
-        .replace('\n', "\\n")
-        .replace('\r', "\\r")
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use diffguard_types::{
         CHECK_SCHEMA_V1, CheckReceipt, DiffMeta, Finding, Scope, Severity, ToolMeta, Verdict,
         VerdictCounts, VerdictStatus,

---- csv::tests::escape_tsv_field_with_newline stdout ----

thread 'csv::tests::escape_tsv_field_with_newline' (845878) panicked at crates/diffguard-core/src/csv.rs:354:9:
assertion `left == right` failed
  left: ""
 right: "a\\nb"

---- csv::tests::escape_tsv_field_with_tab stdout ----

thread 'csv::tests::escape_tsv_field_with_tab' (845879) panicked at crates/diffguard-core/src/csv.rs:349:9:
assertion `left == right` failed
  left: ""
 right: "a\\tb"

---- csv::tests::escape_tsv_field_plain_text stdout ----

thread 'csv::tests::escape_tsv_field_plain_text' (845875) panicked at crates/diffguard-core/src/csv.rs:344:9:
assertion `left == right` failed
  left: ""
 right: "plain text"

failures:
    csv::tests::escape_tsv_field_plain_text
    csv::tests::escape_tsv_field_with_backslash
    csv::tests::escape_tsv_field_with_carriage_return
    csv::tests::escape_tsv_field_with_newline
    csv::tests::escape_tsv_field_with_tab
    csv::tests::snapshot_tsv_special_chars
    csv::tests::snapshot_tsv_with_findings
    csv::tests::tsv_escapes_newlines
    csv::tests::tsv_escapes_tabs

test result: FAILED. 117 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
