*** crates/diffguard-core/src/csv.rs:92:5: replace escape_tsv_field -> String with "xyzzy".into()

*** mutation diff:
--- crates/diffguard-core/src/csv.rs
+++ replace escape_tsv_field -> String with "xyzzy".into()
@@ -84,20 +84,17 @@
         s.to_string()
     }
 }
 
 /// Escapes a field for TSV.
 ///
 /// Tabs and newlines are escaped with backslash notation.
 fn escape_tsv_field(s: &str) -> String {
-    s.replace('\\', "\\\\")
-        .replace('\t', "\\t")
-        .replace('\n', "\\n")
-        .replace('\r', "\\r")
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use diffguard_types::{
         CHECK_SCHEMA_V1, CheckReceipt, DiffMeta, Finding, Scope, Severity, ToolMeta, Verdict,
         VerdictCounts, VerdictStatus,

---- csv::tests::escape_tsv_field_plain_text stdout ----

thread 'csv::tests::escape_tsv_field_plain_text' (846686) panicked at crates/diffguard-core/src/csv.rs:344:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "plain text"

---- csv::tests::escape_tsv_field_with_carriage_return stdout ----

thread 'csv::tests::escape_tsv_field_with_carriage_return' (846688) panicked at crates/diffguard-core/src/csv.rs:359:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "a\\rb"

---- csv::tests::escape_tsv_field_with_backslash stdout ----

thread 'csv::tests::escape_tsv_field_with_backslash' (846687) panicked at crates/diffguard-core/src/csv.rs:364:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "a\\\\b"

failures:
    csv::tests::escape_tsv_field_plain_text
    csv::tests::escape_tsv_field_with_backslash
    csv::tests::escape_tsv_field_with_carriage_return
    csv::tests::escape_tsv_field_with_newline
    csv::tests::escape_tsv_field_with_tab
    csv::tests::snapshot_tsv_special_chars
    csv::tests::snapshot_tsv_with_findings
    csv::tests::tsv_escapes_newlines
    csv::tests::tsv_escapes_tabs

test result: FAILED. 117 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.20s

*** result: Failure(101)
