*** crates/diffguard-core/src/fingerprint.rs:14:5: replace compute_fingerprint -> String with String::new()

*** mutation diff:
--- crates/diffguard-core/src/fingerprint.rs
+++ replace compute_fingerprint -> String with String::new()
@@ -6,18 +6,17 @@
 use diffguard_types::Finding;
 use sha2::{Digest, Sha256};
 
 /// Computes a stable fingerprint for a finding.
 ///
 /// The fingerprint is a full SHA-256 hash of `rule_id:path:line:match_text`
 /// (64 hex characters / 32 bytes).
 pub fn compute_fingerprint(f: &Finding) -> String {
-    let input = format!("{}:{}:{}:{}", f.rule_id, f.path, f.line, f.match_text);
-    compute_fingerprint_raw(&input)
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Computes a full SHA-256 fingerprint from an arbitrary input string.
 ///
 /// Returns 64 hex characters (32 bytes).
 pub fn compute_fingerprint_raw(input: &str) -> String {
     let hash = Sha256::digest(input.as_bytes());
     hex::encode(hash)

---- fingerprint::tests::fingerprint_differs_for_different_line stdout ----

thread 'fingerprint::tests::fingerprint_differs_for_different_line' (847514) panicked at crates/diffguard-core/src/fingerprint.rs:83:9:
assertion `left != right` failed
  left: ""
 right: ""

---- fingerprint::tests::fingerprint_differs_for_different_rule_id stdout ----

thread 'fingerprint::tests::fingerprint_differs_for_different_rule_id' (847517) panicked at crates/diffguard-core/src/fingerprint.rs:65:9:
assertion `left != right` failed
  left: ""
 right: ""

---- fingerprint::tests::fingerprint_is_64_hex_chars stdout ----

thread 'fingerprint::tests::fingerprint_is_64_hex_chars' (847520) panicked at crates/diffguard-core/src/fingerprint.rs:47:9:
assertion `left == right` failed
  left: 0
 right: 64

failures:
    fingerprint::tests::fingerprint_differs_for_different_line
    fingerprint::tests::fingerprint_differs_for_different_match_text
    fingerprint::tests::fingerprint_differs_for_different_path
    fingerprint::tests::fingerprint_differs_for_different_rule_id
    fingerprint::tests::fingerprint_is_64_hex_chars
    fingerprint::tests::snapshot_fingerprint_value
    sensor::tests::sensor_finding_has_fingerprint
    sensor::tests::snapshot_sensor_report_with_findings

test result: FAILED. 118 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.20s

*** result: Failure(101)
