*** crates/diffguard-core/src/fingerprint.rs:22:5: replace compute_fingerprint_raw -> String with String::new()

*** mutation diff:
--- crates/diffguard-core/src/fingerprint.rs
+++ replace compute_fingerprint_raw -> String with String::new()
@@ -14,18 +14,17 @@
     let input = format!("{}:{}:{}:{}", f.rule_id, f.path, f.line, f.match_text);
     compute_fingerprint_raw(&input)
 }
 
 /// Computes a full SHA-256 fingerprint from an arbitrary input string.
 ///
 /// Returns 64 hex characters (32 bytes).
 pub fn compute_fingerprint_raw(input: &str) -> String {
-    let hash = Sha256::digest(input.as_bytes());
-    hex::encode(hash)
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use diffguard_types::Severity;
 
     fn test_finding() -> Finding {

---- fingerprint::tests::compute_fingerprint_raw_produces_64_hex stdout ----

thread 'fingerprint::tests::compute_fingerprint_raw_produces_64_hex' (849133) panicked at crates/diffguard-core/src/fingerprint.rs:126:9:
assertion `left == right` failed
  left: 0
 right: 64

---- fingerprint::tests::fingerprint_differs_for_different_line stdout ----

thread 'fingerprint::tests::fingerprint_differs_for_different_line' (849134) panicked at crates/diffguard-core/src/fingerprint.rs:83:9:
assertion `left != right` failed
  left: ""
 right: ""

---- fingerprint::tests::fingerprint_differs_for_different_match_text stdout ----

thread 'fingerprint::tests::fingerprint_differs_for_different_match_text' (849135) panicked at crates/diffguard-core/src/fingerprint.rs:92:9:
assertion `left != right` failed
  left: ""
 right: ""

failures:
    fingerprint::tests::compute_fingerprint_raw_produces_64_hex
    fingerprint::tests::fingerprint_differs_for_different_line
    fingerprint::tests::fingerprint_differs_for_different_match_text
    fingerprint::tests::fingerprint_differs_for_different_path
    fingerprint::tests::fingerprint_differs_for_different_rule_id
    fingerprint::tests::fingerprint_is_64_hex_chars
    fingerprint::tests::snapshot_fingerprint_value
    sensor::tests::sensor_finding_has_fingerprint
    sensor::tests::snapshot_sensor_report_with_findings

test result: FAILED. 117 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
