*** crates/diffguard-core/src/gitlab_quality.rs:119:5: replace compute_fingerprint -> String with "xyzzy".into()

*** mutation diff:
--- crates/diffguard-core/src/gitlab_quality.rs
+++ replace compute_fingerprint -> String with "xyzzy".into()
@@ -111,25 +111,17 @@
         },
         check_name: finding.rule_id.clone(),
         content,
     }
 }
 
 /// Computes a deterministic fingerprint for a finding.
 fn compute_fingerprint(finding: &Finding) -> String {
-    let mut hasher = Sha256::new();
-    hasher.update(finding.rule_id.as_bytes());
-    hasher.update(finding.path.as_bytes());
-    hasher.update(finding.line.to_string().as_bytes());
-    if let Some(col) = finding.column {
-        hasher.update(col.to_string().as_bytes());
-    }
-    hasher.update(finding.message.as_bytes());
-    format!("{:x}", hasher.finalize())
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use diffguard_types::{
         CHECK_SCHEMA_V1, CheckReceipt, DiffMeta, Finding, Scope, Severity, ToolMeta, Verdict,
         VerdictCounts, VerdictStatus,

---- gitlab_quality::tests::snapshot_gitlab_quality_with_findings stdout ----
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ Snapshot Summary ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
Snapshot file: crates/diffguard-core/src/snapshots/diffguard_core__gitlab_quality__tests__gitlab_quality_with_findings.snap
Snapshot: gitlab_quality_with_findings
Source: crates/diffguard-core/src/gitlab_quality.rs:285
────────────────────────────────────────────────────────────────────────────────
Expression: json
────────────────────────────────────────────────────────────────────────────────
-old snapshot
+new results
────────────┬───────────────────────────────────────────────────────────────────
    1     1 │ [
    2     2 │   {
    3     3 │     "description": "Avoid unwrap/expect in production code.",

failures:
    gitlab_quality::tests::snapshot_gitlab_quality_with_findings

test result: FAILED. 125 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
