*** crates/diffguard-core/src/gitlab_quality.rs:82:5: replace render_gitlab_quality_for_receipt -> GitLabQualityReport with Default::default()

*** mutation diff:
--- crates/diffguard-core/src/gitlab_quality.rs
+++ replace render_gitlab_quality_for_receipt -> GitLabQualityReport with Default::default()
@@ -74,17 +74,17 @@
             Severity::Warn => GitLabSeverity::Minor,
             Severity::Error => GitLabSeverity::Major,
         }
     }
 }
 
 /// Renders a CheckReceipt as a GitLab Code Quality report.
 pub fn render_gitlab_quality_for_receipt(receipt: &CheckReceipt) -> GitLabQualityReport {
-    receipt.findings.iter().map(finding_to_gitlab).collect()
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Renders a GitLab Code Quality report as a JSON string.
 pub fn render_gitlab_quality_json(receipt: &CheckReceipt) -> Result<String, serde_json::Error> {
     let report = render_gitlab_quality_for_receipt(receipt);
     serde_json::to_string_pretty(&report)
 }

---- gitlab_quality::tests::gitlab_quality_severity_mapping stdout ----

thread 'gitlab_quality::tests::gitlab_quality_severity_mapping' (850771) panicked at crates/diffguard-core/src/gitlab_quality.rs:227:9:
assertion `left == right` failed
  left: 0
 right: 3

---- gitlab_quality::tests::gitlab_quality_fingerprint_consistency stdout ----

thread 'gitlab_quality::tests::gitlab_quality_fingerprint_consistency' (850769) panicked at crates/diffguard-core/src/gitlab_quality.rs:254:27:
index out of bounds: the len is 0 but the index is 0

---- gitlab_quality::tests::snapshot_gitlab_quality_with_findings stdout ----
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ Snapshot Summary ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
Snapshot file: crates/diffguard-core/src/snapshots/diffguard_core__gitlab_quality__tests__gitlab_quality_with_findings.snap
Snapshot: gitlab_quality_with_findings
Source: crates/diffguard-core/src/gitlab_quality.rs:293
────────────────────────────────────────────────────────────────────────────────
Expression: json
────────────────────────────────────────────────────────────────────────────────
-old snapshot
+new results
────────────┬───────────────────────────────────────────────────────────────────
    1       │-[
    2       │-  {
    3       │-    "description": "Avoid unwrap/expect in production code.",

failures:
    gitlab_quality::tests::gitlab_quality_fingerprint_consistency
    gitlab_quality::tests::gitlab_quality_severity_mapping
    gitlab_quality::tests::snapshot_gitlab_quality_with_findings

test result: FAILED. 123 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.16s

*** result: Failure(101)
