*** crates/diffguard-core/src/gitlab_quality.rs:87:5: replace render_gitlab_quality_json -> Result<String, serde_json::Error> with Ok("xyzzy".into())

*** mutation diff:
--- crates/diffguard-core/src/gitlab_quality.rs
+++ replace render_gitlab_quality_json -> Result<String, serde_json::Error> with Ok("xyzzy".into())
@@ -79,18 +79,17 @@
 
 /// Renders a CheckReceipt as a GitLab Code Quality report.
 pub fn render_gitlab_quality_for_receipt(receipt: &CheckReceipt) -> GitLabQualityReport {
     receipt.findings.iter().map(finding_to_gitlab).collect()
 }
 
 /// Renders a GitLab Code Quality report as a JSON string.
 pub fn render_gitlab_quality_json(receipt: &CheckReceipt) -> Result<String, serde_json::Error> {
-    let report = render_gitlab_quality_for_receipt(receipt);
-    serde_json::to_string_pretty(&report)
+    Ok("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Converts a Finding to a GitLab finding.
 fn finding_to_gitlab(finding: &Finding) -> GitLabFinding {
     let fingerprint = compute_fingerprint(finding);
     let content = if finding.snippet.is_empty() {
         None
     } else {

---- gitlab_quality::tests::gitlab_quality_json_serialization stdout ----

thread 'gitlab_quality::tests::gitlab_quality_json_serialization' (852373) panicked at crates/diffguard-core/src/gitlab_quality.rs:268:69:
should parse: Error("expected value", line: 1, column: 1)

---- gitlab_quality::tests::snapshot_gitlab_quality_no_findings stdout ----
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ Snapshot Summary ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
Snapshot file: crates/diffguard-core/src/snapshots/diffguard_core__gitlab_quality__tests__gitlab_quality_no_findings.snap
Snapshot: gitlab_quality_no_findings
Source: crates/diffguard-core/src/gitlab_quality.rs:300
────────────────────────────────────────────────────────────────────────────────
Expression: json
────────────────────────────────────────────────────────────────────────────────
-old snapshot
+new results
────────────┬───────────────────────────────────────────────────────────────────
    1       │-[]
          1 │+xyzzy
────────────┴───────────────────────────────────────────────────────────────────

---- gitlab_quality::tests::snapshot_gitlab_quality_with_findings stdout ----
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ Snapshot Summary ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
Snapshot file: crates/diffguard-core/src/snapshots/diffguard_core__gitlab_quality__tests__gitlab_quality_with_findings.snap
Snapshot: gitlab_quality_with_findings
Source: crates/diffguard-core/src/gitlab_quality.rs:292
────────────────────────────────────────────────────────────────────────────────
Expression: json
────────────────────────────────────────────────────────────────────────────────
-old snapshot
+new results
────────────┬───────────────────────────────────────────────────────────────────
    1       │-[
    2       │-  {
    3       │-    "description": "Avoid unwrap/expect in production code.",

failures:
    gitlab_quality::tests::gitlab_quality_json_serialization
    gitlab_quality::tests::snapshot_gitlab_quality_no_findings
    gitlab_quality::tests::snapshot_gitlab_quality_with_findings

test result: FAILED. 123 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
