*** crates/diffguard-core/src/junit.rs:108:5: replace escape_xml -> String with String::new()

*** mutation diff:
--- crates/diffguard-core/src/junit.rs
+++ replace escape_xml -> String with String::new()
@@ -100,28 +100,17 @@
     }
 
     out.push_str("</testsuites>\n");
     out
 }
 
 /// Escapes special XML characters in a string.
 fn escape_xml(s: &str) -> String {
-    let mut out = String::with_capacity(s.len());
-    for c in s.chars() {
-        match c {
-            '&' => out.push_str("&amp;"),
-            '<' => out.push_str("&lt;"),
-            '>' => out.push_str("&gt;"),
-            '"' => out.push_str("&quot;"),
-            '\'' => out.push_str("&apos;"),
-            _ => out.push(c),
-        }
-    }
-    out
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use diffguard_types::{
         CHECK_SCHEMA_V1, CheckReceipt, DiffMeta, Finding, Scope, ToolMeta, Verdict, VerdictCounts,
         VerdictStatus,

---- junit::tests::escape_xml_handles_all_special_chars stdout ----

thread 'junit::tests::escape_xml_handles_all_special_chars' (856403) panicked at crates/diffguard-core/src/junit.rs:322:9:
assertion `left == right` failed
  left: ""
 right: "&amp;"

---- junit::tests::junit_escapes_xml_special_chars stdout ----

thread 'junit::tests::junit_escapes_xml_special_chars' (856405) panicked at crates/diffguard-core/src/junit.rs:262:9:
assertion failed: xml.contains("&lt;special&gt;")

---- junit::tests::junit_groups_by_rule_id stdout ----

thread 'junit::tests::junit_groups_by_rule_id' (856407) panicked at crates/diffguard-core/src/junit.rs:228:9:
assertion failed: xml.contains("<testsuite name=\"rust.no_dbg\"")

failures:
    junit::tests::escape_xml_handles_all_special_chars
    junit::tests::junit_escapes_xml_special_chars
    junit::tests::junit_groups_by_rule_id
    junit::tests::snapshot_junit_with_findings

test result: FAILED. 122 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.16s

*** result: Failure(101)
