*** crates/diffguard-core/src/render.rs:17:5: replace render_markdown_for_receipt -> String with "xyzzy".into()

*** mutation diff:
--- crates/diffguard-core/src/render.rs
+++ replace render_markdown_for_receipt -> String with "xyzzy".into()
@@ -9,70 +9,17 @@
     REASON_TRUNCATED,
     REASON_MISSING_BASE,
     REASON_NO_DIFF_INPUT,
     REASON_GIT_UNAVAILABLE,
     REASON_TOOL_ERROR,
 ];
 
 pub fn render_markdown_for_receipt(receipt: &CheckReceipt) -> String {
-    let status = match receipt.verdict.status {
-        VerdictStatus::Pass => "PASS",
-        VerdictStatus::Warn => "WARN",
-        VerdictStatus::Fail => "FAIL",
-        VerdictStatus::Skip => "SKIP",
-    };
-
-    let mut out = String::new();
-    out.push_str(&format!("## diffguard — {status}\n\n"));
-
-    out.push_str(&format!(
-        "Scanned **{}** file(s), **{}** line(s) (scope: `{}`, base: `{}`, head: `{}`)\n\n",
-        receipt.diff.files_scanned,
-        receipt.diff.lines_scanned,
-        receipt.diff.scope.as_str(),
-        receipt.diff.base,
-        receipt.diff.head
-    ));
-
-    let meta_reasons: Vec<&String> = receipt
-        .verdict
-        .reasons
-        .iter()
-        .filter(|r| RENDERABLE_META_REASONS.contains(&r.as_str()))
-        .collect();
-    if !meta_reasons.is_empty() {
-        out.push_str("**Verdict reasons:**\n");
-        for r in &meta_reasons {
-            out.push_str(&format!("- {r}\n"));
-        }
-        out.push('\n');
-    }
-
-    if receipt.verdict.counts.suppressed > 0 {
-        out.push_str(&format!(
-            "**Note:** {} finding(s) suppressed via inline directives.\n\n",
-            receipt.verdict.counts.suppressed
-        ));
-    }
-
-    if receipt.findings.is_empty() {
-        out.push_str("No findings.\n");
-        return out;
-    }
-
-    out.push_str("| Severity | Rule | Location | Message | Snippet |\n");
-    out.push_str("|---|---|---|---|---|\n");
-
-    for f in &receipt.findings {
-        out.push_str(&render_finding_row(f));
-    }
-
-    out.push('\n');
-    out
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 fn render_finding_row(f: &Finding) -> String {
     let sev = f.severity.as_str();
     let loc = format!("{}:{}", escape_md(&f.path), f.line);
     let msg = escape_md(&f.message);
     let snippet = escape_md(&f.snippet);

---- render::tests::markdown_shows_suppressed_count stdout ----

thread 'render::tests::markdown_shows_suppressed_count' (862812) panicked at crates/diffguard-core/src/render.rs:314:9:
assertion failed: md.contains("3 finding(s) suppressed via inline directives")

---- render::tests::markdown_renders_all_meta_reasons stdout ----

thread 'render::tests::markdown_renders_all_meta_reasons' (862811) panicked at crates/diffguard-core/src/render.rs:411:9:
meta reasons should render

---- render::tests::renders_markdown_table stdout ----

thread 'render::tests::renders_markdown_table' (862814) panicked at crates/diffguard-core/src/render.rs:84:9:
assertion failed: md.contains("| Severity | Rule")

failures:
    render::tests::markdown_renders_all_meta_reasons
    render::tests::markdown_shows_suppressed_count
    render::tests::renders_markdown_table
    render::tests::snapshot_markdown_no_findings
    render::tests::snapshot_markdown_with_findings
    render::tests::snapshot_markdown_with_suppressions
    render::tests::snapshot_verdict_rendering

test result: FAILED. 119 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
