*** crates/diffguard-core/src/render.rs:42:8: delete ! in render_markdown_for_receipt

*** mutation diff:
--- crates/diffguard-core/src/render.rs
+++ delete ! in render_markdown_for_receipt
@@ -34,17 +34,17 @@
     ));
 
     let meta_reasons: Vec<&String> = receipt
         .verdict
         .reasons
         .iter()
         .filter(|r| RENDERABLE_META_REASONS.contains(&r.as_str()))
         .collect();
-    if !meta_reasons.is_empty() {
+    if  /* ~ changed by cargo-mutants ~ */meta_reasons.is_empty() {
         out.push_str("**Verdict reasons:**\n");
         for r in &meta_reasons {
             out.push_str(&format!("- {r}\n"));
         }
         out.push('\n');
     }
 
     if receipt.verdict.counts.suppressed > 0 {

---- render::tests::markdown_filters_non_meta_reasons stdout ----

thread 'render::tests::markdown_filters_non_meta_reasons' (863638) panicked at crates/diffguard-core/src/render.rs:422:9:
non-meta reasons should not render

---- render::tests::markdown_renders_all_meta_reasons stdout ----

thread 'render::tests::markdown_renders_all_meta_reasons' (863640) panicked at crates/diffguard-core/src/render.rs:464:9:
meta reasons should render

---- render::tests::snapshot_verdict_rendering stdout ----
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ Snapshot Summary ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
Snapshot file: crates/diffguard-core/src/snapshots/diffguard_core__render__tests__snapshot_verdict_rendering.snap
Snapshot: snapshot_verdict_rendering
Source: crates/diffguard-core/src/render.rs:319
────────────────────────────────────────────────────────────────────────────────
Expression: md
────────────────────────────────────────────────────────────────────────────────
-old snapshot
+new results
────────────┬───────────────────────────────────────────────────────────────────
    1     1 │ ## diffguard — WARN
    2     2 │ 
    3     3 │ Scanned **2** file(s), **35** line(s) (scope: `changed`, base: `feature/branch`, head: `HEAD`)

failures:
    render::tests::markdown_filters_non_meta_reasons
    render::tests::markdown_renders_all_meta_reasons
    render::tests::snapshot_markdown_no_findings
    render::tests::snapshot_markdown_with_findings
    render::tests::snapshot_markdown_with_suppressions
    render::tests::snapshot_verdict_rendering

test result: FAILED. 120 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
