*** crates/diffguard-core/src/render.rs:50:42: replace > with < in render_markdown_for_receipt

*** mutation diff:
--- crates/diffguard-core/src/render.rs
+++ replace > with < in render_markdown_for_receipt
@@ -42,17 +42,17 @@
     if !meta_reasons.is_empty() {
         out.push_str("**Verdict reasons:**\n");
         for r in &meta_reasons {
             out.push_str(&format!("- {r}\n"));
         }
         out.push('\n');
     }
 
-    if receipt.verdict.counts.suppressed > 0 {
+    if receipt.verdict.counts.suppressed < /* ~ changed by cargo-mutants ~ */ 0 {
         out.push_str(&format!(
             "**Note:** {} finding(s) suppressed via inline directives.\n\n",
             receipt.verdict.counts.suppressed
         ));
     }
 
     if receipt.findings.is_empty() {
         out.push_str("No findings.\n");

---- render::tests::markdown_shows_suppressed_count stdout ----

thread 'render::tests::markdown_shows_suppressed_count' (865299) panicked at crates/diffguard-core/src/render.rs:367:9:
assertion failed: md.contains("3 finding(s) suppressed via inline directives")

---- render::tests::snapshot_markdown_with_suppressions stdout ----
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ Snapshot Summary ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
Snapshot file: crates/diffguard-core/src/snapshots/diffguard_core__render__tests__snapshot_markdown_with_suppressions.snap
Snapshot: snapshot_markdown_with_suppressions
Source: crates/diffguard-core/src/render.rs:383
────────────────────────────────────────────────────────────────────────────────
Expression: md
────────────────────────────────────────────────────────────────────────────────
-old snapshot
+new results
────────────┬───────────────────────────────────────────────────────────────────
    1     1 │ ## diffguard — WARN
    2     2 │ 
    3     3 │ Scanned **2** file(s), **30** line(s) (scope: `added`, base: `origin/main`, head: `HEAD`)

failures:
    render::tests::markdown_shows_suppressed_count
    render::tests::snapshot_markdown_with_suppressions

test result: FAILED. 124 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
