*** crates/diffguard-core/src/render.rs:50:42: replace > with >= in render_markdown_for_receipt

*** mutation diff:
--- crates/diffguard-core/src/render.rs
+++ replace > with >= in render_markdown_for_receipt
@@ -42,17 +42,17 @@
     if !meta_reasons.is_empty() {
         out.push_str("**Verdict reasons:**\n");
         for r in &meta_reasons {
             out.push_str(&format!("- {r}\n"));
         }
         out.push('\n');
     }
 
-    if receipt.verdict.counts.suppressed > 0 {
+    if receipt.verdict.counts.suppressed >= /* ~ changed by cargo-mutants ~ */ 0 {
         out.push_str(&format!(
             "**Note:** {} finding(s) suppressed via inline directives.\n\n",
             receipt.verdict.counts.suppressed
         ));
     }
 
     if receipt.findings.is_empty() {
         out.push_str("No findings.\n");

---- render::tests::markdown_hides_suppressed_when_zero stdout ----

thread 'render::tests::markdown_hides_suppressed_when_zero' (866099) panicked at crates/diffguard-core/src/render.rs:375:9:
assertion failed: !md.contains("suppressed")

---- render::tests::snapshot_verdict_rendering stdout ----
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ Snapshot Summary ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
Snapshot file: crates/diffguard-core/src/snapshots/diffguard_core__render__tests__snapshot_verdict_rendering.snap
Snapshot: snapshot_verdict_rendering
Source: crates/diffguard-core/src/render.rs:319
────────────────────────────────────────────────────────────────────────────────
Expression: md
────────────────────────────────────────────────────────────────────────────────
-old snapshot
+new results
────────────┬───────────────────────────────────────────────────────────────────
    1     1 │ ## diffguard — WARN
    2     2 │ 
    3     3 │ Scanned **2** file(s), **35** line(s) (scope: `changed`, base: `feature/branch`, head: `HEAD`)

---- render::tests::snapshot_markdown_no_findings stdout ----
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ Snapshot Summary ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
Snapshot file: crates/diffguard-core/src/snapshots/diffguard_core__render__tests__snapshot_markdown_no_findings.snap
Snapshot: snapshot_markdown_no_findings
Source: crates/diffguard-core/src/render.rs:310
────────────────────────────────────────────────────────────────────────────────
Expression: md
────────────────────────────────────────────────────────────────────────────────
-old snapshot
+new results
────────────┬───────────────────────────────────────────────────────────────────
    1     1 │ ## diffguard — PASS
    2     2 │ 
    3     3 │ Scanned **5** file(s), **120** line(s) (scope: `added`, base: `origin/main`, head: `HEAD`)

failures:
    render::tests::markdown_hides_suppressed_when_zero
    render::tests::snapshot_markdown_no_findings
    render::tests::snapshot_markdown_with_findings
    render::tests::snapshot_verdict_rendering

test result: FAILED. 122 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
