*** crates/diffguard-core/src/render.rs:74:5: replace render_finding_row -> String with String::new()

*** mutation diff:
--- crates/diffguard-core/src/render.rs
+++ replace render_finding_row -> String with String::new()
@@ -66,29 +66,17 @@
         out.push_str(&render_finding_row(f));
     }
 
     out.push('\n');
     out
 }
 
 fn render_finding_row(f: &Finding) -> String {
-    let sev = f.severity.as_str();
-    let loc = format!("{}:{}", escape_md(&f.path), f.line);
-    let msg = escape_md(&f.message);
-    let snippet = escape_md(&f.snippet);
-
-    format!(
-        "| {sev} | `{rule}` | `{loc}` | {msg} | `{snippet}` |\n",
-        sev = sev,
-        rule = escape_md(&f.rule_id),
-        loc = loc,
-        msg = msg,
-        snippet = snippet
-    )
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 fn escape_md(s: &str) -> String {
     s.replace('|', "\\|").replace('`', "\\`")
 }
 
 #[cfg(test)]
 mod tests {

---- render::tests::render_finding_row_escapes_pipes_and_backticks stdout ----

thread 'render::tests::render_finding_row_escapes_pipes_and_backticks' (866922) panicked at crates/diffguard-core/src/render.rs:144:9:
assertion failed: row.contains("rule\\|id\\`tick")

---- render::tests::renders_markdown_table stdout ----

thread 'render::tests::renders_markdown_table' (866923) panicked at crates/diffguard-core/src/render.rs:126:9:
assertion failed: md.contains("src/lib.rs")

---- render::tests::snapshot_markdown_with_findings stdout ----
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ Snapshot Summary ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
Snapshot file: crates/diffguard-core/src/snapshots/diffguard_core__render__tests__snapshot_markdown_with_findings.snap
Snapshot: snapshot_markdown_with_findings
Source: crates/diffguard-core/src/render.rs:289
────────────────────────────────────────────────────────────────────────────────
Expression: md
────────────────────────────────────────────────────────────────────────────────
-old snapshot
+new results
────────────┬───────────────────────────────────────────────────────────────────
    2     2 │ 
    3     3 │ Scanned **3** file(s), **42** line(s) (scope: `added`, base: `origin/main`, head: `HEAD`)
    4     4 │

failures:
    render::tests::render_finding_row_escapes_pipes_and_backticks
    render::tests::renders_markdown_table
    render::tests::snapshot_markdown_with_findings
    render::tests::snapshot_markdown_with_suppressions
    render::tests::snapshot_verdict_rendering

test result: FAILED. 121 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.17s

*** result: Failure(101)
