*** crates/diffguard-core/src/render.rs:90:5: replace escape_md -> String with "xyzzy".into()

*** mutation diff:
--- crates/diffguard-core/src/render.rs
+++ replace escape_md -> String with "xyzzy".into()
@@ -82,17 +82,17 @@
         rule = escape_md(&f.rule_id),
         loc = loc,
         msg = msg,
         snippet = snippet
     )
 }
 
 fn escape_md(s: &str) -> String {
-    s.replace('|', "\\|").replace('`', "\\`")
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
     fn renders_markdown_table() {

---- render::tests::render_finding_row_escapes_pipes_and_backticks stdout ----

thread 'render::tests::render_finding_row_escapes_pipes_and_backticks' (869382) panicked at crates/diffguard-core/src/render.rs:156:9:
assertion failed: row.contains("rule\\|id\\`tick")

---- render::tests::renders_markdown_table stdout ----

thread 'render::tests::renders_markdown_table' (869383) panicked at crates/diffguard-core/src/render.rs:138:9:
assertion failed: md.contains("src/lib.rs")

---- render::tests::snapshot_verdict_rendering stdout ----
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ Snapshot Summary ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
Snapshot file: crates/diffguard-core/src/snapshots/diffguard_core__render__tests__snapshot_verdict_rendering.snap
Snapshot: snapshot_verdict_rendering
Source: crates/diffguard-core/src/render.rs:319
────────────────────────────────────────────────────────────────────────────────
Expression: md
────────────────────────────────────────────────────────────────────────────────
-old snapshot
+new results
────────────┬───────────────────────────────────────────────────────────────────
    3     3 │ Scanned **2** file(s), **35** line(s) (scope: `changed`, base: `feature/branch`, head: `HEAD`)
    4     4 │ 
    5     5 │ | Severity | Rule | Location | Message | Snippet |

failures:
    render::tests::render_finding_row_escapes_pipes_and_backticks
    render::tests::renders_markdown_table
    render::tests::snapshot_markdown_with_findings
    render::tests::snapshot_markdown_with_suppressions
    render::tests::snapshot_verdict_rendering

test result: FAILED. 121 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
