*** crates/diffguard-core/src/sarif.rs:194:5: replace render_sarif_json -> Result<String, serde_json::Error> with Ok(String::new())

*** mutation diff:
--- crates/diffguard-core/src/sarif.rs
+++ replace render_sarif_json -> Result<String, serde_json::Error> with Ok(String::new())
@@ -186,18 +186,17 @@
             results,
             invocations: None,
         }],
     }
 }
 
 /// Renders a SARIF report as a JSON string.
 pub fn render_sarif_json(receipt: &CheckReceipt) -> Result<String, serde_json::Error> {
-    let report = render_sarif_for_receipt(receipt);
-    serde_json::to_string_pretty(&report)
+    Ok(String::new()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Collects unique rule definitions from findings.
 fn collect_rules_from_findings(findings: &[Finding]) -> Vec<SarifRule> {
     let mut seen = BTreeMap::new();
 
     for f in findings {
         if !seen.contains_key(&f.rule_id) {

---- sarif::tests::sarif_json_is_valid stdout ----

thread 'sarif::tests::sarif_json_is_valid' (870235) panicked at crates/diffguard-core/src/sarif.rs:518:64:
should be valid JSON: Error("EOF while parsing a value", line: 1, column: 0)

---- sarif::tests::snapshot_sarif_info_findings stdout ----
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ Snapshot Summary ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
Snapshot file: crates/diffguard-core/src/snapshots/diffguard_core__sarif__tests__snapshot_sarif_info_findings.snap
Snapshot: snapshot_sarif_info_findings
Source: crates/diffguard-core/src/sarif.rs:542
────────────────────────────────────────────────────────────────────────────────
Expression: json
────────────────────────────────────────────────────────────────────────────────
-old snapshot
+new results
────────────┬───────────────────────────────────────────────────────────────────
    1       │-{
    2       │-  "$schema": "https://raw.githubusercontent.com/oasis-tcs/sarif-spec/master/Schemata/sarif-schema-2.1.0.json",
    3       │-  "version": "2.1.0",

---- sarif::tests::snapshot_sarif_no_findings stdout ----
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ Snapshot Summary ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
Snapshot file: crates/diffguard-core/src/snapshots/diffguard_core__sarif__tests__snapshot_sarif_no_findings.snap
Snapshot: snapshot_sarif_no_findings
Source: crates/diffguard-core/src/sarif.rs:534
────────────────────────────────────────────────────────────────────────────────
Expression: json
────────────────────────────────────────────────────────────────────────────────
-old snapshot
+new results
────────────┬───────────────────────────────────────────────────────────────────
    1       │-{
    2       │-  "$schema": "https://raw.githubusercontent.com/oasis-tcs/sarif-spec/master/Schemata/sarif-schema-2.1.0.json",
    3       │-  "version": "2.1.0",

failures:
    sarif::tests::sarif_json_is_valid
    sarif::tests::snapshot_sarif_info_findings
    sarif::tests::snapshot_sarif_no_findings
    sarif::tests::snapshot_sarif_with_findings

test result: FAILED. 122 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.16s

*** result: Failure(101)
