*** crates/diffguard-core/src/sarif.rs:200:5: replace collect_rules_from_findings -> Vec<SarifRule> with vec![]

*** mutation diff:
--- crates/diffguard-core/src/sarif.rs
+++ replace collect_rules_from_findings -> Vec<SarifRule> with vec![]
@@ -192,36 +192,17 @@
 /// Renders a SARIF report as a JSON string.
 pub fn render_sarif_json(receipt: &CheckReceipt) -> Result<String, serde_json::Error> {
     let report = render_sarif_for_receipt(receipt);
     serde_json::to_string_pretty(&report)
 }
 
 /// Collects unique rule definitions from findings.
 fn collect_rules_from_findings(findings: &[Finding]) -> Vec<SarifRule> {
-    let mut seen = BTreeMap::new();
-
-    for f in findings {
-        if !seen.contains_key(&f.rule_id) {
-            seen.insert(
-                f.rule_id.clone(),
-                SarifRule {
-                    id: f.rule_id.clone(),
-                    short_description: Some(SarifMessage {
-                        text: f.message.clone(),
-                    }),
-                    default_configuration: Some(SarifRuleConfiguration {
-                        level: f.severity.into(),
-                    }),
-                },
-            );
-        }
-    }
-
-    seen.into_values().collect()
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Converts a diffguard Finding to a SARIF Result.
 fn finding_to_sarif_result(f: &Finding) -> SarifResult {
     // Create a fingerprint based on rule, path, line
     let mut fingerprints = BTreeMap::new();
     fingerprints.insert(
         "primaryLocationLineHash".to_string(),

---- sarif::tests::sarif_rules_are_deduplicated stdout ----

thread 'sarif::tests::sarif_rules_are_deduplicated' (871878) panicked at crates/diffguard-core/src/sarif.rs:491:9:
assertion `left == right` failed
  left: 0
 right: 3

---- sarif::tests::snapshot_sarif_info_findings stdout ----
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ Snapshot Summary ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
Snapshot file: crates/diffguard-core/src/snapshots/diffguard_core__sarif__tests__snapshot_sarif_info_findings.snap
Snapshot: snapshot_sarif_info_findings
Source: crates/diffguard-core/src/sarif.rs:524
────────────────────────────────────────────────────────────────────────────────
Expression: json
────────────────────────────────────────────────────────────────────────────────
-old snapshot
+new results
────────────┬───────────────────────────────────────────────────────────────────
    6     6 │       "tool": {
    7     7 │         "driver": {
    8     8 │           "name": "diffguard",

---- sarif::tests::snapshot_sarif_with_findings stdout ----
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ Snapshot Summary ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
Snapshot file: crates/diffguard-core/src/snapshots/diffguard_core__sarif__tests__snapshot_sarif_with_findings.snap
Snapshot: snapshot_sarif_with_findings
Source: crates/diffguard-core/src/sarif.rs:508
────────────────────────────────────────────────────────────────────────────────
Expression: json
────────────────────────────────────────────────────────────────────────────────
-old snapshot
+new results
────────────┬───────────────────────────────────────────────────────────────────
    6     6 │       "tool": {
    7     7 │         "driver": {
    8     8 │           "name": "diffguard",

failures:
    sarif::tests::sarif_rules_are_deduplicated
    sarif::tests::snapshot_sarif_info_findings
    sarif::tests::snapshot_sarif_with_findings

test result: FAILED. 123 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
