*** crates/diffguard-core/src/sarif.rs:203:12: delete ! in collect_rules_from_findings

*** mutation diff:
--- crates/diffguard-core/src/sarif.rs
+++ delete ! in collect_rules_from_findings
@@ -195,17 +195,17 @@
     serde_json::to_string_pretty(&report)
 }
 
 /// Collects unique rule definitions from findings.
 fn collect_rules_from_findings(findings: &[Finding]) -> Vec<SarifRule> {
     let mut seen = BTreeMap::new();
 
     for f in findings {
-        if !seen.contains_key(&f.rule_id) {
+        if  /* ~ changed by cargo-mutants ~ */seen.contains_key(&f.rule_id) {
             seen.insert(
                 f.rule_id.clone(),
                 SarifRule {
                     id: f.rule_id.clone(),
                     short_description: Some(SarifMessage {
                         text: f.message.clone(),
                     }),
                     default_configuration: Some(SarifRuleConfiguration {

---- sarif::tests::sarif_rules_are_deduplicated stdout ----

thread 'sarif::tests::sarif_rules_are_deduplicated' (872701) panicked at crates/diffguard-core/src/sarif.rs:510:9:
assertion `left == right` failed
  left: 0
 right: 3

---- sarif::tests::snapshot_sarif_info_findings stdout ----
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ Snapshot Summary ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
Snapshot file: crates/diffguard-core/src/snapshots/diffguard_core__sarif__tests__snapshot_sarif_info_findings.snap
Snapshot: snapshot_sarif_info_findings
Source: crates/diffguard-core/src/sarif.rs:543
────────────────────────────────────────────────────────────────────────────────
Expression: json
────────────────────────────────────────────────────────────────────────────────
-old snapshot
+new results
────────────┬───────────────────────────────────────────────────────────────────
    6     6 │       "tool": {
    7     7 │         "driver": {
    8     8 │           "name": "diffguard",

---- sarif::tests::snapshot_sarif_with_findings stdout ----
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ Snapshot Summary ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
Snapshot file: crates/diffguard-core/src/snapshots/diffguard_core__sarif__tests__snapshot_sarif_with_findings.snap
Snapshot: snapshot_sarif_with_findings
Source: crates/diffguard-core/src/sarif.rs:527
────────────────────────────────────────────────────────────────────────────────
Expression: json
────────────────────────────────────────────────────────────────────────────────
-old snapshot
+new results
────────────┬───────────────────────────────────────────────────────────────────
    6     6 │       "tool": {
    7     7 │         "driver": {
    8     8 │           "name": "diffguard",

failures:
    sarif::tests::sarif_rules_are_deduplicated
    sarif::tests::snapshot_sarif_info_findings
    sarif::tests::snapshot_sarif_with_findings

test result: FAILED. 123 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
