*** crates/diffguard-core/src/sensor.rs:100:8: delete ! in render_sensor_report

*** mutation diff:
--- crates/diffguard-core/src/sensor.rs
+++ delete ! in render_sensor_report
@@ -92,17 +92,17 @@
 
     let mut diffguard_data = serde_json::json!({
         "suppressed_count": receipt.verdict.counts.suppressed,
         "truncated_count": ctx.truncated_count,
         "rules_matched": rules_matched,
         "rules_total": ctx.rules_total,
     });
 
-    if !tags_matched.is_empty() {
+    if  /* ~ changed by cargo-mutants ~ */tags_matched.is_empty() {
         diffguard_data["tags_matched"] =
             serde_json::to_value(&tags_matched).expect("serialize tags_matched");
     }
 
     let data = serde_json::json!({
         "diff": {
             "base": receipt.diff.base,
             "head": receipt.diff.head,

---- sensor::tests::sensor_report_omits_tags_matched_when_metadata_missing stdout ----

thread 'sensor::tests::sensor_report_omits_tags_matched_when_metadata_missing' (875149) panicked at crates/diffguard-core/src/sensor.rs:337:9:
assertion failed: !diffguard.contains_key("tags_matched")

---- sensor::tests::sensor_report_includes_tags_matched stdout ----

thread 'sensor::tests::sensor_report_includes_tags_matched' (875148) panicked at crates/diffguard-core/src/sensor.rs:319:14:
tags_matched

---- sensor::tests::snapshot_sensor_report_no_findings stdout ----
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ Snapshot Summary ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
Snapshot file: crates/diffguard-core/src/snapshots/diffguard_core__sensor__tests__snapshot_sensor_report_no_findings.snap
Snapshot: snapshot_sensor_report_no_findings
Source: crates/diffguard-core/src/sensor.rs:366
────────────────────────────────────────────────────────────────────────────────
Expression: json
────────────────────────────────────────────────────────────────────────────────
-old snapshot
+new results
────────────┬───────────────────────────────────────────────────────────────────
   42    42 │     "diffguard": {
   43    43 │       "rules_matched": 0,
   44    44 │       "rules_total": 5,

failures:
    sensor::tests::sensor_report_includes_tags_matched
    sensor::tests::sensor_report_omits_tags_matched_when_metadata_missing
    sensor::tests::snapshot_sensor_report_no_findings
    sensor::tests::snapshot_sensor_report_skip_status
    sensor::tests::snapshot_sensor_report_with_findings

test result: FAILED. 121 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
