*** crates/diffguard-core/src/sensor.rs:138:5: replace render_sensor_json -> Result<String, serde_json::Error> with Ok(String::new())

*** mutation diff:
--- crates/diffguard-core/src/sensor.rs
+++ replace render_sensor_json -> Result<String, serde_json::Error> with Ok(String::new())
@@ -130,18 +130,17 @@
     }
 }
 
 /// Renders a CheckReceipt as a sensor.report.v1 JSON string.
 pub fn render_sensor_json(
     receipt: &CheckReceipt,
     ctx: &SensorReportContext,
 ) -> Result<String, serde_json::Error> {
-    let report = render_sensor_report(receipt, ctx);
-    serde_json::to_string_pretty(&report)
+    Ok(String::new()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Normalizes a path to use forward slashes (for cross-platform consistency).
 fn normalize_path(path: &str) -> String {
     path.replace('\\', "/")
 }
 
 #[cfg(test)]

---- sensor::tests::snapshot_sensor_report_no_findings stdout ----
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ Snapshot Summary ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
Snapshot file: crates/diffguard-core/src/snapshots/diffguard_core__sensor__tests__snapshot_sensor_report_no_findings.snap
Snapshot: snapshot_sensor_report_no_findings
Source: crates/diffguard-core/src/sensor.rs:365
────────────────────────────────────────────────────────────────────────────────
Expression: json
────────────────────────────────────────────────────────────────────────────────
-old snapshot
+new results
────────────┬───────────────────────────────────────────────────────────────────
    1       │-{
    2       │-  "schema": "sensor.report.v1",
    3       │-  "tool": {

---- sensor::tests::snapshot_sensor_report_skip_status stdout ----
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ Snapshot Summary ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
Snapshot file: crates/diffguard-core/src/snapshots/diffguard_core__sensor__tests__snapshot_sensor_report_skip_status.snap
Snapshot: snapshot_sensor_report_skip_status
Source: crates/diffguard-core/src/sensor.rs:387
────────────────────────────────────────────────────────────────────────────────
Expression: json
────────────────────────────────────────────────────────────────────────────────
-old snapshot
+new results
────────────┬───────────────────────────────────────────────────────────────────
    1       │-{
    2       │-  "schema": "sensor.report.v1",
    3       │-  "tool": {

---- sensor::tests::snapshot_sensor_report_with_findings stdout ----
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ Snapshot Summary ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
Snapshot file: crates/diffguard-core/src/snapshots/diffguard_core__sensor__tests__snapshot_sensor_report_with_findings.snap
Snapshot: snapshot_sensor_report_with_findings
Source: crates/diffguard-core/src/sensor.rs:351
────────────────────────────────────────────────────────────────────────────────
Expression: json
────────────────────────────────────────────────────────────────────────────────
-old snapshot
+new results
────────────┬───────────────────────────────────────────────────────────────────
    1       │-{
    2       │-  "schema": "sensor.report.v1",
    3       │-  "tool": {

failures:
    sensor::tests::snapshot_sensor_report_no_findings
    sensor::tests::snapshot_sensor_report_skip_status
    sensor::tests::snapshot_sensor_report_with_findings

test result: FAILED. 123 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.19s

*** result: Failure(101)
