*** crates/diffguard-core/src/sensor.rs:144:5: replace normalize_path -> String with String::new()

*** mutation diff:
--- crates/diffguard-core/src/sensor.rs
+++ replace normalize_path -> String with String::new()
@@ -136,17 +136,17 @@
     ctx: &SensorReportContext,
 ) -> Result<String, serde_json::Error> {
     let report = render_sensor_report(receipt, ctx);
     serde_json::to_string_pretty(&report)
 }
 
 /// Normalizes a path to use forward slashes (for cross-platform consistency).
 fn normalize_path(path: &str) -> String {
-    path.replace('\\', "/")
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use diffguard_types::{
         CAP_GIT, CAP_STATUS_UNAVAILABLE, DiffMeta, Finding, REASON_GIT_UNAVAILABLE, Scope,
         Severity, ToolMeta, Verdict, VerdictCounts, VerdictStatus,

---- sensor::tests::normalize_path_converts_backslashes stdout ----

thread 'sensor::tests::normalize_path_converts_backslashes' (877587) panicked at crates/diffguard-core/src/sensor.rs:342:9:
assertion `left == right` failed
  left: ""
 right: "src/lib.rs"

---- sensor::tests::snapshot_sensor_report_with_findings stdout ----
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ Snapshot Summary ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
Snapshot file: crates/diffguard-core/src/snapshots/diffguard_core__sensor__tests__snapshot_sensor_report_with_findings.snap
Snapshot: snapshot_sensor_report_with_findings
Source: crates/diffguard-core/src/sensor.rs:352
────────────────────────────────────────────────────────────────────────────────
Expression: json
────────────────────────────────────────────────────────────────────────────────
-old snapshot
+new results
────────────┬───────────────────────────────────────────────────────────────────
   29    29 │       "code": "rust.no_unwrap",
   30    30 │       "severity": "error",
   31    31 │       "message": "Avoid unwrap",

failures:
    sensor::tests::normalize_path_converts_backslashes
    sensor::tests::snapshot_sensor_report_with_findings

test result: FAILED. 124 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
