*** crates/diffguard-core/src/sensor.rs:86:61: replace += with -= in render_sensor_report

*** mutation diff:
--- crates/diffguard-core/src/sensor.rs
+++ replace += with -= in render_sensor_report
@@ -78,17 +78,17 @@
     };
 
     // Count findings per matched rule tag (BTreeMap for deterministic key ordering)
     let tags_matched: BTreeMap<String, u32> = {
         let mut counts = BTreeMap::new();
         for f in &receipt.findings {
             if let Some(meta) = ctx.rule_metadata.get(&f.rule_id) {
                 for tag in &meta.tags {
-                    *counts.entry(tag.clone()).or_insert(0) += 1;
+                    *counts.entry(tag.clone()).or_insert(0) -= /* ~ changed by cargo-mutants ~ */ 1;
                 }
             }
         }
         counts
     };
 
     let mut diffguard_data = serde_json::json!({
         "suppressed_count": receipt.verdict.counts.suppressed,

---- sensor::tests::sensor_finding_has_fingerprint stdout ----

thread 'sensor::tests::sensor_finding_has_fingerprint' (873546) panicked at crates/diffguard-core/src/sensor.rs:86:21:
attempt to subtract with overflow

---- sensor::tests::sensor_finding_includes_data stdout ----

thread 'sensor::tests::sensor_finding_includes_data' (873547) panicked at crates/diffguard-core/src/sensor.rs:86:21:
attempt to subtract with overflow

---- sensor::tests::sensor_report_has_correct_schema stdout ----

thread 'sensor::tests::sensor_report_has_correct_schema' (873550) panicked at crates/diffguard-core/src/sensor.rs:86:21:
attempt to subtract with overflow

failures:
    sensor::tests::sensor_finding_has_correct_check_id
    sensor::tests::sensor_finding_has_fingerprint
    sensor::tests::sensor_finding_includes_data
    sensor::tests::sensor_finding_includes_help_and_url
    sensor::tests::sensor_finding_maps_rule_id_to_code
    sensor::tests::sensor_report_has_correct_schema
    sensor::tests::sensor_report_includes_diff_data
    sensor::tests::sensor_report_includes_run_meta
    sensor::tests::sensor_report_includes_tags_matched
    sensor::tests::sensor_report_preserves_tool_meta
    sensor::tests::snapshot_sensor_report_with_findings

test result: FAILED. 115 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.10s

*** result: Failure(101)
