*** crates/diffguard-core/src/sensor.rs:86:61: replace += with *= in render_sensor_report

*** mutation diff:
--- crates/diffguard-core/src/sensor.rs
+++ replace += with *= in render_sensor_report
@@ -78,17 +78,17 @@
     };
 
     // Count findings per matched rule tag (BTreeMap for deterministic key ordering)
     let tags_matched: BTreeMap<String, u32> = {
         let mut counts = BTreeMap::new();
         for f in &receipt.findings {
             if let Some(meta) = ctx.rule_metadata.get(&f.rule_id) {
                 for tag in &meta.tags {
-                    *counts.entry(tag.clone()).or_insert(0) += 1;
+                    *counts.entry(tag.clone()).or_insert(0) *= /* ~ changed by cargo-mutants ~ */ 1;
                 }
             }
         }
         counts
     };
 
     let mut diffguard_data = serde_json::json!({
         "suppressed_count": receipt.verdict.counts.suppressed,

---- sensor::tests::sensor_report_includes_tags_matched stdout ----

thread 'sensor::tests::sensor_report_includes_tags_matched' (874346) panicked at crates/diffguard-core/src/sensor.rs:320:9:
assertion `left == right` failed
  left: Some(0)
 right: Some(1)

---- sensor::tests::snapshot_sensor_report_with_findings stdout ----
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ Snapshot Summary ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
Snapshot file: crates/diffguard-core/src/snapshots/diffguard_core__sensor__tests__snapshot_sensor_report_with_findings.snap
Snapshot: snapshot_sensor_report_with_findings
Source: crates/diffguard-core/src/sensor.rs:352
────────────────────────────────────────────────────────────────────────────────
Expression: json
────────────────────────────────────────────────────────────────────────────────
-old snapshot
+new results
────────────┬───────────────────────────────────────────────────────────────────
   62    62 │       "rules_matched": 1,
   63    63 │       "rules_total": 5,
   64    64 │       "suppressed_count": 0,

failures:
    sensor::tests::sensor_report_includes_tags_matched
    sensor::tests::snapshot_sensor_report_with_findings

test result: FAILED. 124 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.17s

*** result: Failure(101)
