*** crates/diffguard-core/src/sensor_api.rs:34:9: replace Substrate::changed_files -> Option<&[String]> with Some(Vec::leak(vec![String::new()]))

*** mutation diff:
--- crates/diffguard-core/src/sensor_api.rs
+++ replace Substrate::changed_files -> Option<&[String]> with Some(Vec::leak(vec![String::new()]))
@@ -26,17 +26,17 @@
 
 /// Optional shared substrate from the Cockpit runtime.
 ///
 /// Provides pre-computed inventory to avoid redundant scans.
 /// No sensor may *require* a `Substrate` to function.
 pub trait Substrate {
     /// Pre-computed list of changed file paths (forward-slash normalized).
     fn changed_files(&self) -> Option<&[String]> {
-        None
+        Some(Vec::leak(vec![String::new()])) /* ~ changed by cargo-mutants ~ */
     }
     /// Repository root path.
     fn repo_root(&self) -> Option<&std::path::Path> {
         None
     }
     /// Arbitrary metadata from the substrate provider.
     fn metadata(&self) -> Option<&serde_json::Value> {
         None

---- sensor_api::tests::substrate_defaults_return_none stdout ----

thread 'sensor_api::tests::substrate_defaults_return_none' (880005) panicked at crates/diffguard-core/src/sensor_api.rs:225:9:
assertion failed: dummy.changed_files().is_none()

failures:
    sensor_api::tests::substrate_defaults_return_none

test result: FAILED. 125 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
