*** crates/diffguard-core/src/sensor_api.rs:42:9: replace Substrate::metadata -> Option<&serde_json::Value> with Some(Box::leak(Box::new(Default::default())))

*** mutation diff:
--- crates/diffguard-core/src/sensor_api.rs
+++ replace Substrate::metadata -> Option<&serde_json::Value> with Some(Box::leak(Box::new(Default::default())))
@@ -34,17 +34,17 @@
         None
     }
     /// Repository root path.
     fn repo_root(&self) -> Option<&std::path::Path> {
         None
     }
     /// Arbitrary metadata from the substrate provider.
     fn metadata(&self) -> Option<&serde_json::Value> {
-        None
+        Some(Box::leak(Box::new(Default::default()))) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// R2 Library Contract: run the diffguard sensor and return a `SensorReport`.
 ///
 /// This is the entry point for BusyBox/integrated cockpit usage.
 /// For standalone CLI usage, use `run_check()` directly.
 pub fn run_sensor(

---- sensor_api::tests::substrate_defaults_return_none stdout ----

thread 'sensor_api::tests::substrate_defaults_return_none' (881603) panicked at crates/diffguard-core/src/sensor_api.rs:227:9:
assertion failed: dummy.metadata().is_none()

failures:
    sensor_api::tests::substrate_defaults_return_none

test result: FAILED. 125 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
