*** crates/diffguard-core/src/sensor_api.rs:62:9: delete field truncated_count from struct SensorReportContext expression in run_sensor

*** mutation diff:
--- crates/diffguard-core/src/sensor_api.rs
+++ delete field truncated_count from struct SensorReportContext expression in run_sensor
@@ -54,17 +54,17 @@
     // 1. Run the check (substrate currently unused; reserved for future optimization)
     let _ = substrate;
     let check_run = run_check(&settings.plan, &settings.config, &settings.diff_text)?;
 
     // 2. Build rule metadata from config and merge check stats into context
     let rule_metadata = extract_rule_metadata(&settings.config);
     let ctx = SensorReportContext {
         rule_metadata,
-        truncated_count: check_run.truncated_findings,
+         /* ~ changed by cargo-mutants ~ */
         rules_total: check_run.rules_evaluated,
         ..settings.context.clone()
     };
 
     // 3. Convert to sensor report
     Ok(render_sensor_report(&check_run.receipt, &ctx))
 }

*** result: Success
