*** crates/diffguard-core/src/sensor_api.rs:63:9: delete field rules_total from struct SensorReportContext expression in run_sensor

*** mutation diff:
--- crates/diffguard-core/src/sensor_api.rs
+++ delete field rules_total from struct SensorReportContext expression in run_sensor
@@ -55,17 +55,17 @@
     let _ = substrate;
     let check_run = run_check(&settings.plan, &settings.config, &settings.diff_text)?;
 
     // 2. Build rule metadata from config and merge check stats into context
     let rule_metadata = extract_rule_metadata(&settings.config);
     let ctx = SensorReportContext {
         rule_metadata,
         truncated_count: check_run.truncated_findings,
-        rules_total: check_run.rules_evaluated,
+         /* ~ changed by cargo-mutants ~ */
         ..settings.context.clone()
     };
 
     // 3. Convert to sensor report
     Ok(render_sensor_report(&check_run.receipt, &ctx))
 }
 
 /// Extracts rule metadata (help text, URL, and tags) from a config file.

*** result: Success
