*** crates/diffguard-core/src/sensor_api.rs:73:5: replace extract_rule_metadata -> HashMap<String, RuleMetadata> with HashMap::new()

*** mutation diff:
--- crates/diffguard-core/src/sensor_api.rs
+++ replace extract_rule_metadata -> HashMap<String, RuleMetadata> with HashMap::new()
@@ -65,30 +65,17 @@
     };
 
     // 3. Convert to sensor report
     Ok(render_sensor_report(&check_run.receipt, &ctx))
 }
 
 /// Extracts rule metadata (help text, URL, and tags) from a config file.
 fn extract_rule_metadata(config: &ConfigFile) -> HashMap<String, RuleMetadata> {
-    config
-        .rule
-        .iter()
-        .map(|r| {
-            (
-                r.id.clone(),
-                RuleMetadata {
-                    help: r.help.clone(),
-                    url: r.url.clone(),
-                    tags: r.tags.clone(),
-                },
-            )
-        })
-        .collect()
+    HashMap::new() /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use diffguard_types::{
         CAP_GIT, CAP_STATUS_AVAILABLE, CapabilityStatus, FailOn, RuleConfig,
         SENSOR_REPORT_SCHEMA_V1, Scope, Severity,

---- sensor_api::tests::extract_rule_metadata_maps_config_rules stdout ----

thread 'sensor_api::tests::extract_rule_metadata_maps_config_rules' (884864) panicked at crates/diffguard-core/src/sensor_api.rs:281:9:
assertion failed: meta.contains_key("test.rule")

---- sensor_api::tests::run_sensor_populates_rule_metadata stdout ----

thread 'sensor_api::tests::run_sensor_populates_rule_metadata' (884865) panicked at crates/diffguard-core/src/sensor_api.rs:202:9:
assertion `left == right` failed
  left: None
 right: Some("Fix the test pattern")

failures:
    sensor_api::tests::extract_rule_metadata_maps_config_rules
    sensor_api::tests::run_sensor_populates_rule_metadata

test result: FAILED. 124 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
