*** crates/diffguard-types/src/lib.rs:1555:5: replace is_false -> bool with true

*** mutation diff:
--- crates/diffguard-types/src/lib.rs
+++ replace is_false -> bool with true
@@ -1547,17 +1547,17 @@
 
 /// Serde predicate: skips serializing a [`bool`] field when it is [`false`].
 ///
 /// Used with `#[serde(skip_serializing_if = "is_false")]`.
 /// Takes [`bool`] by reference to avoid triggering
 /// `clippy::trivially_copy_pass_by_ref` while remaining Clone-free.
 #[allow(clippy::trivially_copy_pass_by_ref)]
 fn is_false(v: &bool) -> bool {
-    !*v
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 /// Serde predicate: skips serializing a [`MatchMode`] field when it is [`MatchMode::Any`].
 ///
 /// Used with `#[serde(skip_serializing_if = "is_match_mode_any")]`.
 /// Takes [`MatchMode`] by reference to avoid triggering
 /// `clippy::trivially_copy_pass_by_ref` while remaining Clone-free.
 #[allow(clippy::trivially_copy_pass_by_ref)]

---- test_all_predicates_combined_edge_cases stdout ----

thread 'test_all_predicates_combined_edge_cases' (2261552) panicked at crates/diffguard-types/tests/predicate_by_value.rs:296:5:
multiline=true should be serialized

---- test_is_false_with_true_value stdout ----

thread 'test_is_false_with_true_value' (2261556) panicked at crates/diffguard-types/tests/predicate_by_value.rs:234:5:
multiline=true should be serialized: {"id":"test-rule","severity":"warn","message":"test message","languages":[],"patterns":["pattern"],"paths":[],"exclude_paths":[],"ignore_comments":false,"ignore_strings":false,"match_mode":"absent"}

---- test_is_false_with_true_serializes stdout ----

thread 'test_is_false_with_true_serializes' (2261555) panicked at crates/diffguard-types/tests/predicate_by_value.rs:95:5:
multiline=true should be serialized: {"id":"test-rule","severity":"warn","message":"test message","languages":[],"patterns":["pattern"],"paths":[],"exclude_paths":[],"ignore_comments":false,"ignore_strings":false,"match_mode":"absent"}

failures:
    test_all_predicates_combined_edge_cases
    test_is_false_with_true_serializes
    test_is_false_with_true_value
    test_round_trip_with_edge_case_values
    test_skip_serializing_if_round_trip

test result: FAILED. 13 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
