*** crates/diffguard-types/src/lib.rs:1565:5: replace is_match_mode_any -> bool with false

*** mutation diff:
--- crates/diffguard-types/src/lib.rs
+++ replace is_match_mode_any -> bool with false
@@ -1557,17 +1557,17 @@
 
 /// Serde predicate: skips serializing a [`MatchMode`] field when it is [`MatchMode::Any`].
 ///
 /// Used with `#[serde(skip_serializing_if = "is_match_mode_any")]`.
 /// Takes [`MatchMode`] by reference to avoid triggering
 /// `clippy::trivially_copy_pass_by_ref` while remaining Clone-free.
 #[allow(clippy::trivially_copy_pass_by_ref)]
 fn is_match_mode_any(mode: &MatchMode) -> bool {
-    matches!(mode, MatchMode::Any)
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 // ============================================================================
 // Per-directory override types
 // ============================================================================
 
 /// Per-directory override configuration (.diffguard.toml).
 ///

---- test_all_predicates_combined_edge_cases stdout ----

thread 'test_all_predicates_combined_edge_cases' (2263248) panicked at crates/diffguard-types/tests/predicate_by_value.rs:253:5:
match_mode=Any should be skipped

---- test_is_match_mode_any_accepts_match_mode_by_value stdout ----

thread 'test_is_match_mode_any_accepts_match_mode_by_value' (2263253) panicked at crates/diffguard-types/tests/predicate_by_value.rs:107:5:
match_mode=Any should not be serialized: {"id":"test-rule","severity":"warn","message":"test message","languages":[],"patterns":["pattern"],"paths":[],"exclude_paths":[],"ignore_comments":false,"ignore_strings":false,"match_mode":"any"}

---- test_is_match_mode_any_with_any_variant stdout ----

thread 'test_is_match_mode_any_with_any_variant' (2263256) panicked at crates/diffguard-types/tests/predicate_by_value.rs:206:5:
match_mode=Any should not be serialized: {"id":"test-rule","severity":"warn","message":"test message","languages":[],"patterns":["pattern"],"paths":[],"exclude_paths":[],"ignore_comments":false,"ignore_strings":false,"match_mode":"any"}

failures:
    test_all_predicates_combined_edge_cases
    test_is_match_mode_any_accepts_match_mode_by_value
    test_is_match_mode_any_with_any_variant
    test_skip_serializing_if_combined_default_values

test result: FAILED. 14 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
